[
    {
        "id": "1",
        "title": "The Future of AI",
        "cover": "/covers/1.png",
        "author": "Sarah Johnson",
        "uploadDate": "2024-03-10",
        "text": "",
        "synopsis": "In 'The Future of AI,' Sarah Johnson presents a comprehensive exploration of artificial intelligence's revolutionary potential. Through expert analysis and real-world examples, she illuminates how AI is transforming industries, reshaping society, and redefining human potential in the digital age.",
        "chunks": []
    },
    {
        "id": "2",
        "title": "Digital Renaissance",
        "cover": "/covers/2.png",
        "author": "Michael Chen",
        "uploadDate": "2024-03-08",
        "text": "",
        "synopsis": "'Digital Renaissance' explores the convergence of art, technology, and human creativity in the modern era. Michael Chen weaves together stories of digital innovators, artists, and entrepreneurs who are pioneering new forms of expression and business in our connected world.",
        "chunks": []
    },
    {
        "id": "3",
        "title": "The Art of Code",
        "cover": "/covers/3.png",
        "author": "Emma Davis",
        "uploadDate": "2024-03-07",
        "text": "",
        "synopsis": "Emma Davis's 'The Art of Code' reveals the beauty and creativity behind software development. This groundbreaking work demonstrates how coding is not just a technical skill but a form of artistic expression, blending logical thinking with creative problem-solving.",
        "chunks": []
    },
    {
        "id": "4",
        "title": "Quantum Computing",
        "cover": "/covers/4.png",
        "author": "Robert Zhang",
        "uploadDate": "2024-03-05",
        "text": "",
        "synopsis": "A revolutionary guide to the world of quantum computing, Robert Zhang's book demystifies complex concepts for both technical and non-technical readers. From quantum mechanics principles to practical applications, this book charts the future of computing technology.",
        "chunks": []
    },
    {
        "id": "f7d67af3",
        "title": "Alice in Wonderland",
        "cover": "/covers/f7d67af3.png",
        "author": "Lewis Carroll",
        "uploadDate": "2025-04-22T16:34:25.559646",
        "pages": 60,
        "chunks": [
            {
                "chunk_id": 0,
                "chunk_text": "Down the Rabbit-Hole Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, \"and what is the use of a book,\" thought Alice \"without pictures or conversations?\" So she was considering in her own mind (as well as she could, for the hot day made her feel very sleepy and stupid), whether the pleasure of making a daisy-chain would be worth the trouble of getting up and picking the daisies, when suddenly a White Rabbit with pink eyes ran close by her. There was nothing so very remarkable in that; nor did Alice think it so very much out of the way to hear the Rabbit say to itself, \"Oh dear! (when she thought it over afterwards, it occurred to her that she ought to have wondered at this, but at the time it all seemed quite natural); but when the Rabbit actually took a watch out of its waistcoat-pocket, and looked at it, and then hurried on, Alice started to her feet, for it flashed across her mind that she had never before seen a rabbit with either a waistcoat-pocket, or a watch to take out of it, and burning with curiosity, she ran across the field after it, and fortunately was just in time to see it pop down a large rabbit-hole under the hedge. In another moment down went Alice after it, never once considering how in the world she was to get out again. The rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down a very deep well. Either the well was very deep, or she fell very slowly, for she had plenty of time as she went down to look about her and to wonder what was going to happen next. First, she tried to look down and make out what she was coming to, but it was too dark to see anything; then she looked at the sides of the well, and noticed that they were filled with cupboards and book-shelves; here and there she saw maps and pictures hung upon pegs. thought Alice to herself, \"after such a fall as this, I shall think nothing of tumbling down stairs! How brave they'll all think me at home! Would the fall never come to an end? Let me see: that would be four thousand miles down, I think--\" (for, you see, Alice had learnt several things of this sort in her lessons in the schoolroom, and though this was not a very good opportunity for showing off her knowledge, as there was no one to listen to her, still it was good practice to say it over) \"--yes, that's about the right distance--but then I wonder what Latitude or Longitude I've got to?\" \"I wonder if I shall fall right through the earth! The Antipathies, I think--\" (she was rather glad there was no one listening, this time, as it didn't sound at all the right word) \"--but I shall have to ask them what the name of the country is, you know. \"Dinah'll miss me very much to-night, I should think!\" And here Alice began to get rather sleepy, and went on saying to herself, in a dreamy sort of way, \"Do cats eat bats? She felt that she was dozing off, and had just begun to dream that she was walking hand in hand with Dinah, and saying to her very earnestly, \"Now, Dinah, tell me the truth: did you ever eat a bat?\" There was not a moment to be lost: away went Alice like the wind, and was just in time to hear it say, as it turned a corner, \"Oh my ears and whiskers, how late it's getting!\" There were doors all round the hall, but they were all locked; and when Alice had been all the way down one side and up the other, trying every door, she walked sadly down the middle, wondering how she was ever to get out again. Suddenly she came upon a little three-legged table, all made of solid glass; there was nothing on it except a tiny golden key, and Alice's first thought was that it might belong to one of the doors of the hall; but, alas! There seemed to be no use in waiting by the little door, so she went back to the table, half hoping she might find another key on it, or at any rate a book of rules for shutting people up like telescopes: this time she found a little bottle on it, (\"which certainly was not here before,\" said Alice,) and round the neck of the bottle was a paper label, with the words \"DRINK ME,\" beautifully printed on it in large letters. It was all very well to say \"Drink me,\" but the wise little Alice was not going to do that in a hurry. \"No, I'll look first,\" she said, \"and see whether it's marked 'poison' or not\"; for she had read several nice little histories about children who had got burnt, and eaten up by wild beasts and other unpleasant things, all because they would not remember the simple rules their friends had taught them: such as, that a red-hot poker will burn you if you hold it too long; and that if you cut your finger very deeply with a knife, it usually bleeds; and she had never forgotten that, if you drink much from a bottle marked \"poison,\" it is almost certain to disagree with you, sooner or later. And so it was indeed: she was now only ten inches high, and her face brightened up at the thought that she was now the right size for going through the little door into that lovely garden. First, however, she waited for a few minutes to see if she was going to shrink any further: she felt a little nervous about this; \"for it might end, you know,\" said Alice to herself, \"in my going out altogether, like a candle. I wonder what I should be like then?\" when she got to the door, she found she had forgotten the little golden key, and when she went back to the table for it, she found she could not possibly reach it: she could see it quite plainly through the glass, and she tried her best to climb up one of the legs of the table, but it was too slippery; and when she had tired herself out with trying, the poor little thing sat down and cried. Soon her eye fell on a little glass box that was lying under the table: she opened it, and found in it a very small cake, on which the words \"EAT ME\" were beautifully marked in currants. \"Well, I'll eat it,\" said Alice, \"and if it makes me grow larger, I can reach the key; and if it makes me grow smaller, I can creep under the door; so either way I'll get into the garden, and I don't care which happens!\" \", holding her hand on the top of her head to feel which way it was growing, and she was quite surprised to find that she remained the same size: to be sure, this generally happens when one eats cake, but Alice had got so much into the way of expecting nothing but out-of-the-way things to happen, that it seemed quite dull and stupid for life to go on in the common way."
            },
            {
                "chunk_id": 1,
                "chunk_text": "cried Alice (she was so much surprised, that for the moment she quite forgot how to speak good English); \"now I'm opening out like the largest telescope that ever was! I shall be a great deal too far off to trouble myself about you: you must manage the best way you can;--but I must be kind to them,\" thought Alice, \"or perhaps they won't walk the way I want to go! After a time she heard a little pattering of feet in the distance, and she hastily dried her eyes to see what was coming. Alice took up the fan and gloves, and, as the hall was very hot, she kept fanning herself all the time she went on talking: \"Dear, dear! Let me think: was I the same when I got up this morning? And she began thinking over all the children she knew that were of the same age as herself, to see if she could have been changed for any of them. \"I'm sure I'm not Ada,\" she said, \"for her hair goes in such long ringlets, and mine doesn't go in ringlets at all; and I'm sure I can't be Mabel, for I know all sorts of things, and she, oh! Besides, she's she, and I'm I, and--oh dear, how puzzling it all is! I'll try and say 'How doth the little--'\" and she crossed her hands on her lap as if she were saying lessons, and began to repeat it, but her voice sounded hoarse and strange, and the words did not come the same as they used to do:-- \"How doth the little crocodile Improve his shining tail, And pour the waters of the Nile On every golden scale! \"I'm sure those are not the right words,\" said poor Alice, and her eyes filled with tears again as she went on, \"I must be Mabel after all, and I shall have to go and live in that poky little house, and have next to no toys to play with, and oh! Tell me that first, and then, if I like being that person, I'll come up: if not, I'll stay down here till I'm somebody else'--but, oh dear!\" As she said this she looked down at her hands, and was surprised to see that she had put on one of the Rabbit's little white kid gloves while she was talking. \"How can I have done that?\" She got up and went to the table to measure herself by it, and found that, as nearly as she could guess, she was now about two feet high, and was going on shrinking rapidly: she soon found out that the cause of this was the fan she was holding, and she dropped it hastily, just in time to avoid shrinking away altogether. the little door was shut again, and the little golden key was lying on the glass table as before, \"and things are worse than ever,\" thought the poor child, \"for I never was so small as this before, never! Her first idea was that she had somehow fallen into the sea, \"and in that case I can go back by railway,\" she said to herself. However, she soon made out that she was in the pool of tears which she had wept when she was nine feet high. \"I wish I hadn't cried so much!\" Just then she heard something splashing about in the pool a little way off, and she swam nearer to make out what it was: at first she thought it must be a walrus or hippopotamus, but then she remembered how small she was now, and she soon made out that it was only a mouse that had slipped in like herself. Everything is so out-of-the-way down here, that I should think very likely it can talk: at any rate, there's no harm in trying.\" So she began: \"O Mouse, do you know the way out of this pool? (Alice thought this must be the right way of speaking to a mouse: she had never done such a thing before, but she remembered having seen in her brother's Latin Grammar, \"A mouse--of a mouse--to a mouse--a mouse--O mouse!\") \"Would you like cats if you were me?\" And yet I wish I could show you our cat Dinah: I think you'd take a fancy to cats if you could only see her. She is such a dear quiet thing,\" Alice went on, half to herself, as she swam lazily about in the pool, \"and she sits purring so nicely by the fire, licking her paws and washing her face--and she is such a nice soft thing to nurse--and she's such a capital one for catching mice--oh, I beg your pardon!\" cried Alice again, for this time the Mouse was bristling all over, and she felt certain it must be really offended. \"We won't talk about her any more if you'd rather not.\" For the Mouse was swimming away from her as hard as it could go, and making quite a commotion in the pool as it went. Do come back again, and we won't talk about cats or dogs either, if you don't like them!\" When the Mouse heard this, it turned round and swam slowly back to her: its face was quite pale (with passion, Alice thought), and it said in a low trembling voice, \"Let us get to the shore, and then I'll tell you my history, and you'll understand why it is I hate cats and dogs.\""
            },
            {
                "chunk_id": 2,
                "chunk_text": "The first question of course was, how to get dry again: they had a consultation about this, and after a few minutes it seemed quite natural to Alice to find herself talking familiarly with them, as if she had known them all her life. Indeed, she had quite a long argument with the Lory, who at last turned sulky, and would only say, \"I am older than you, and must know better;\" and this Alice would not allow without knowing how old it was, and, as the Lory positively refused to tell its age, there was no more to be said. At last the Mouse, who seemed to be a person of authority among them, called out, \"Sit down, all of you, and listen to me! They all sat down at once, in a large ring, with the Mouse in the middle. Alice kept her eyes anxiously fixed on it, for she felt sure she would catch a bad cold if she did not get dry very soon. said the Mouse, frowning, but very politely: \"Did you speak?\" \"Not I!\" \"I thought you did,\" said the Mouse. \" \"I know what 'it' means well enough, when I find a thing,\" said the Duck: \"it's generally a frog or a worm. The Mouse did not notice this question, but hurriedly went on, \"'--found it advisable to go with Edgar Atheling to meet William and offer him the crown. \"As wet as ever,\" said Alice in a melancholy tone: \"it doesn't seem to dry me at all.\" \"I don't know the meaning of half those long words, and, what's more, I don't believe you do either!\" \"What I was going to say,\" said the Dodo in an offended tone, \"was, that the best thing to get us dry would be a Caucus-race.\" said Alice; not that she wanted much to know, but the Dodo had paused as if it thought that somebody ought to speak, and no one else seemed inclined to say anything. \"Why,\" said the Dodo, \"the best way to explain it is to do it.\" There was no \"One, two, three, and away,\" but they began running when they liked, and left off when they liked, so that it was not easy to know when the race was over. \"Why, she, of course,\" said the Dodo, pointing to Alice with one finger; and the whole party at once crowded round her, calling out in a confused way, \"Prizes! Alice had no idea what to do, and in despair she put her hand in her pocket, and pulled out a box of comfits, (luckily the salt water had not got into it), and handed them round as prizes. \"But she must have a prize herself, you know,\" said the Mouse. Then they all crowded round her once more, while the Dodo solemnly presented the thimble, saying \"We beg your acceptance of this elegant thimble;\" and, when it had finished this short speech, they all cheered. Alice thought the whole thing very absurd, but they all looked so grave that she did not dare to laugh; and, as she could not think of anything to say, she simply bowed, and took the thimble, looking as solemn as she could. The next thing was to eat the comfits: this caused some noise and confusion, as the large birds complained that they could not taste theirs, and the small ones choked and had to be patted on the back. \"You promised to tell me your history, you know,\" said Alice, \"and why it is you hate --C and D,\" she added in a whisper, half afraid that it would be offended again. And she kept on puzzling about it while the Mouse was speaking, so that her idea of the tale was something like this:-- \"Fury said to a mouse, That he met in the house, 'Let us both go to law: I will prosecute you.--Come, I'll take no denial; We must have a trial: For really this morning I've nothing to do.' 'I'll be judge, I'll be jury,' Said cunning old Fury: 'I'll try the whole cause, and condemn you to death.'\" sighed the Lory, as soon as it was quite out of sight; and an old Crab took the opportunity of saying to her daughter \"Ah, my dear! \"I wish I had our Dinah here, I know I do!\" Why, she'll eat a little bird as soon as look at it!\" \"Nobody seems to like her, down here, and I'm sure she's the best cat in the world! In a little while, however, she again heard a little pattering of footsteps in the distance, and she looked up eagerly, half hoping that the Mouse had changed his mind, and was coming back to finish his story."
            },
            {
                "chunk_id": 3,
                "chunk_text": "The Rabbit Sends in a Little Bill It was the White Rabbit, trotting slowly back again, and looking anxiously about as it went, as if it had lost something; and she heard it muttering to itself \"The Duchess! Alice guessed in a moment that it was looking for the fan and the pair of white kid gloves, and she very good-naturedly began hunting about for them, but they were nowhere to be seen-- everything seemed to have changed since her swim in the pool, and the great hall, with the glass table and the little door, had vanished completely. Very soon the Rabbit noticed Alice, as she went hunting about, and called out to her in an angry tone, \"Why, Mary Ann, what are you doing out here? \"He took me for his housemaid,\" she said to herself as she ran. She went in without knocking, and hurried upstairs, in great fear lest she should meet the real Mary Ann, and be turned out of the house before she had found the fan and gloves. By this time she had found her way into a tidy little room with a table in the window, and on it (as she had hoped) a fan and two or three pairs of tiny white kid gloves: she took up the fan and a pair of the gloves, and was just going to leave the room, when her eye fell upon a little bottle that stood near the looking-glass. She hastily put down the bottle, saying to herself \"That's quite enough--I hope I shan't grow any more--As it is, I can't get out at the door--I do wish I hadn't drunk quite so much!\" She went on growing, and growing, and very soon had to kneel down on the floor: in another minute there was not even room for this, and she tried the effect of lying down with one elbow against the door, and the other arm curled round her head. Still she went on growing, and, as a last resource, she put one arm out of the window, and one foot up the chimney, and said to herself \"Now I can do no more, whatever happens. Alice knew it was the Rabbit coming to look for her, and she trembled till she shook the house, quite forgetting that she was now about a thousand times as large as the Rabbit, and had no reason to be afraid of it. She did not get hold of anything, but she heard a little shriek and a fall, and a crash of broken glass, from which she concluded that it was just possible it had fallen into a cucumber-frame, or something of the sort. Next came an angry voice--the Rabbit's--\"Pat! And then a voice she had never heard before, \"Sure then I'm here! \"Now tell me, Pat, what's that in the window?\" There was a long silence after this, and Alice could only hear whispers now and then; such as, \"Sure, I don't like it, yer honour, at all, at all!\" \"I wonder what they'll do next! As for pulling me out of the window, I only wish they could! She waited for some time without hearing anything more: at last came a rumbling of little cartwheels, and the sound of a good many voices all talking together: she made out the words: \"Where's the other ladder?--Why, I hadn't to bring but one; Bill's got the other--Bill! You do it!--That I won't, then!--Bill's to go down--Here, Bill! I wouldn't be in Bill's place for a good deal: this fireplace is narrow, to be sure; but I think I can kick a little!\" She drew her foot as far down the chimney as she could, and waited till she heard a little animal (she couldn't guess of what sort it was) scratching and scrambling about in the chimney close above her: then, saying to herself \"This is Bill,\" she gave one sharp kick, and waited to see what would happen next. Last came a little feeble, squeaking voice, (\"That's Bill,\" thought Alice,) \"Well, I hardly know--No more, thank ye; I'm better now--but I'm a deal too flustered to tell you--all I know is, something comes at me like a Jack-in-the-box, and up I goes like a sky-rocket!\" said the Rabbit's voice; and Alice called out as loud as she could, \"If you do, I'll set Dinah at you!\" There was a dead silence instantly, and Alice thought to herself, \"I wonder what they will do next! thought Alice; but she had not long to doubt, for the next moment a shower of little pebbles came rattling in at the window, and some of them hit her in the face. \"I'll put a stop to this,\" she said to herself, and shouted out, \"You'd better not do that again!\" \"The first thing I've got to do,\" said Alice to herself, as she wandered about in the wood, \"is to grow to my right size again; and the second thing is to find my way into that lovely garden. said Alice, in a coaxing tone, and she tried hard to whistle to it; but she was terribly frightened all the time at the thought that it might be hungry, in which case it would be very likely to eat her up in spite of all her coaxing. Hardly knowing what she did, she picked up a little bit of stick, and held it out to the puppy; whereupon the puppy jumped into the air off all its feet at once, with a yelp of delight, and rushed at the stick, and made believe to worry it; then Alice dodged behind a great thistle, to keep herself from being run over; and the moment she appeared on the other side, the puppy made another rush at the stick, and tumbled head over heels in its hurry to get hold of it; then Alice, thinking it was very like having a game of play with a cart-horse, and expecting every moment to be trampled under its feet, ran round the thistle again; then the puppy began a series of short charges at the stick, running a very little way forwards each time and a long way back, and barking hoarsely all the while, till at last it sat down a good way off, panting, with its tongue hanging out of its mouth, and its great eyes half shut. There was a large mushroom growing near her, about the same height as herself; and when she had looked under it, and on both sides of it, and behind it, it occurred to her that she might as well look and see what was on the top of it."
            },
            {
                "chunk_id": 4,
                "chunk_text": "Advice from a Caterpillar The Caterpillar and Alice looked at each other for some time in silence: at last the Caterpillar took the hookah out of its mouth, and addressed her in a languid, sleepy voice. \"I can't explain myself, I'm afraid, sir,\" said Alice, \"because I'm not myself, you see.\" \"I don't see,\" said the Caterpillar. \"It isn't,\" said the Caterpillar. \"Well, perhaps you haven't found it so yet,\" said Alice; \"but when you have to turn into a chrysalis--you will some day, you know--and then after that into a butterfly, I should think you'll feel it a little queer, won't you?\" \"Not a bit,\" said the Caterpillar. \"You!\" Alice felt a little irritated at the Caterpillar's making such very short remarks, and she drew herself up and said, very gravely, \"I think, you ought to tell me who you are, first.\" Here was another puzzling question; and as Alice could not think of any good reason, and as the Caterpillar seemed to be in a very unpleasant state of mind, she turned away. \"No,\" said the Caterpillar. \"In my youth,\" Father William replied to his son, \"I feared it might injure the brain; But, now that I'm perfectly sure I have none, Why, I do it again and again.\" \"That is not said right,\" said the Caterpillar. \"What size do you want to be?\" \"I don't know,\" said the Caterpillar. \"Well, I should like to be a little larger, sir, if you wouldn't mind,\" said Alice: \"three inches is such a wretched height to be.\" \"Of the mushroom,\" said the Caterpillar, just as if she had asked it aloud; and in another moment it was out of sight. She was a good deal frightened by this very sudden change, but she felt that there was no time to be lost, as she was shrinking rapidly; so she set to work at once to eat some of the other bit. said Alice in a tone of delight, which changed into alarm in another moment, when she found that her shoulders were nowhere to be found: all she could see, when she looked down, was an immense length of neck, which seemed to rise like a stalk out of a sea of green leaves that lay far below her. said Alice. And oh, my poor hands, how is it I can't see you?\" As there seemed to be no chance of getting her hands up to her head, she tried to get her head down to them, and was delighted to find that her neck would bend about easily in any direction, like a serpent. She had just succeeded in curving it down into a graceful zigzag, and was going to dive in among the leaves, which she found to be nothing but the tops of the trees under which she had been wandering, when a sharp hiss made her draw back in a hurry: a large pigeon had flown into her face, and was beating her violently with its wings. \"But I'm not a serpent, I tell you!\" said Alice. \"I'm a--I'm a--\" \"Well! said the Pigeon. \"I don't believe it,\" said the Pigeon; \"but if they do, why then they're a kind of serpent, that's all I can say.\" This was such a new idea to Alice, that she was quite silent for a minute or two, which gave the Pigeon the opportunity of adding, \"You're looking for eggs, I know that well enough; and what does it matter to me whether you're a little girl or a serpent?\" \"It matters a good deal to me,\" said Alice hastily; \"but I'm not looking for eggs, as it happens; and if I was, I shouldn't want yours: I don't like them raw.\" It was so long since she had been anything near the right size, that it felt quite strange at first; but she got used to it in a few minutes, and began talking to herself, as usual."
            },
            {
                "chunk_id": 5,
                "chunk_text": "Pig and Pepper For a minute or two she stood looking at the house, and wondering what to do next, when suddenly a footman in livery came running out of the wood--(she considered him to be a footman because he was in livery: otherwise, judging by his face only, she would have called him a fish)--and rapped loudly at the door with his knuckles. She felt very curious to know what it was all about, and crept a little way out of the wood to listen. said Alice. Alice said to herself, as well as she could for sneezing. \"It's a Cheshire cat,\" said the Duchess, \"and that's why. She said the last word with such sudden violence that Alice quite jumped; but she saw in another moment that it was addressed to the baby, and not to her, so she took courage, and went on again:-- \"I didn't know that Cheshire cats always grinned; in fact, I didn't know that cats could grin.\" \"They all can,\" said the Duchess; \"and most of 'em do.\" \"You don't know much,\" said the Duchess; \"and that's a fact.\" Alice did not at all like the tone of this remark, and thought it would be as well to introduce some other subject of conversation. (In which the cook and the baby joined): \"Wow! the Duchess said to Alice, flinging the baby at her as she spoke. As soon as she had made out the proper way of nursing it, (which was to twist it up into a sort of knot, and then keep tight hold of its right ear and left foot, so as to prevent its undoing itself,) she carried it out into the open air. The baby grunted again, and Alice looked very anxiously into its face to see what was the matter with it. \"If you're going to turn into a pig, my dear,\" said Alice, seriously, \"I'll have nothing more to do with you. Alice was just beginning to think to herself, \"Now, what am I to do with this creature when I get it home?\" And she began thinking over other children she knew, who might do very well as pigs, and was just saying to herself, \"if one only knew the right way to change them--\" when she was a little startled by seeing the Cheshire Cat sitting on a bough of a tree a few yards off. \"Oh, you're sure to do that,\" said the Cat, \"if you only walk long enough.\" \"Oh, you can't help that,\" said the Cat: \"we're all mad here. You're mad.\" \"How do you know I'm mad?\" said Alice. \"You must be,\" said the Cat, \"or you wouldn't have come here.\" Alice didn't think that proved it at all; however, she went on \"And how do you know that you're mad?\" \"Call it what you like,\" said the Cat. \"You'll see me there,\" said the Cat, and vanished. \"I thought it would,\" said the Cat, and vanished again. Alice waited a little, half expecting to see it again, but it did not appear, and after a minute or two she walked on in the direction in which the March Hare was said to live. \"I've seen hatters before,\" she said to herself; \"the March Hare will be much the most interesting, and perhaps as this is May it won't be raving mad--at least not so mad as it was in March.\" As she said this, she looked up, and there was the Cat again, sitting on a branch of a tree. It was so large a house, that she did not like to go nearer till she had nibbled some more of the lefthand bit of mushroom, and raised herself to about two feet high: even then she walked up towards it rather timidly, saying to herself \"Suppose it should be raving mad after all!"
            },
            {
                "chunk_id": 6,
                "chunk_text": "A Mad Tea-Party There was a table set out under a tree in front of the house, and the March Hare and the Hatter were having tea at it: a Dormouse was sitting between them, fast asleep, and the other two were using it as a cushion, resting their elbows on it, and talking over its head. The table was a large one, but the three were all crowded together at one corner of it: \"No room! \"There isn't any,\" said the March Hare. \"Then it wasn't very civil of you to offer it,\" said Alice angrily. \"I didn't know it was your table,\" said Alice; \"it's laid for a great many more than three.\" \"Then you should say what you mean,\" the March Hare went on. said the Hatter. \"You might just as well say,\" added the March Hare, \"that 'I like what I get' is the same thing as 'I get what I like'!\" he said, turning to Alice: he had taken his watch out of his pocket, and was looking at it uneasily, shaking it every now and then, and holding it to his ear. The March Hare took the watch and looked at it gloomily: then he dipped it into his cup of tea, and looked at it again: but he could think of nothing better to say than his first remark, \"It was the best butter, you know.\" \"If you knew Time as well as I do,\" said the Hatter, \"you wouldn't talk about wasting it. \"I don't know what you mean,\" said Alice. \"Perhaps not,\" Alice cautiously replied: \"but I know I have to beat time when I learn music.\" \"Not at first, perhaps,\" said the Hatter: \"but you could keep it to half-past one as long as you liked.\" \"And ever since that,\" the Hatter went on in a mournful tone, \"he won't do a thing I ask! said Alice. \"Once upon a time there were three little sisters,\" the Dormouse began in a great hurry; \"and their names were Elsie, Lacie, and Tillie; and they lived at the bottom of a well--\" \"What did they live on?\" \"They couldn't have done that, you know,\" Alice gently remarked; \"they'd have been ill.\" \"So they were,\" said the Dormouse; \"very ill.\" Alice tried to fancy to herself what such an extraordinary ways of living would be like, but it puzzled her too much, so she went on: \"But why did they live at the bottom of a well?\" Alice did not quite know what to say to this: so she helped herself to some tea and bread-and-butter, and then turned to the Dormouse, and repeated her question. The Dormouse again took a minute or two to think about it, and then said, \"It was a treacle-well.\" Alice was beginning very angrily, but the Hatter and the March Hare went \"Sh! He moved on as he spoke, and the Dormouse followed him: the March Hare moved into the Dormouse's place, and Alice rather unwillingly took the place of the March Hare. \"Of course they were,\" said the Dormouse; \"--well in.\" \"They were learning to draw,\" the Dormouse went on, yawning and rubbing its eyes, for it was getting very sleepy; \"and they drew all manner of things--everything that begins with an M--\" \"Why with an M?\" said Alice. The Dormouse had closed its eyes by this time, and was going off into a doze; but, on being pinched by the Hatter, it woke up again with a little shriek, and went on: \"--that begins with an M, such as mouse-traps, and the moon, and memory, and muchness-- you know you say things are \"much of a muchness\"--did you ever see such a thing as a drawing of a muchness?\" \"Really, now you ask me,\" said Alice, very much confused, \"I don't think--\" \"Then you shouldn't talk,\" said the Hatter. This piece of rudeness was more than Alice could bear: she got up in great disgust, and walked off; the Dormouse fell asleep instantly, and neither of the others took the least notice of her going, though she looked back once or twice, half hoping that they would call after her: the last time she saw them, they were trying to put the Dormouse into the teapot. I think I may as well go in at once.\" And in she went."
            },
            {
                "chunk_id": 7,
                "chunk_text": "Alice thought this a very curious thing, and she went nearer to watch them, and just as she came up to them she heard one of them say, \"Look out now, Five! \"Would you tell me,\" said Alice, a little timidly, \"why you are painting those roses?\" Two began in a low voice, \"Why the fact is, you see, Miss, this here ought to have been a red rose-tree, and we put a white one in by mistake; and if the Queen was to find it out, we should all have our heads cut off, you know. The Queen!\" Alice was rather doubtful whether she ought not to lie down on her face like the three gardeners, but she could not remember ever having heard of such a rule at processions; \"and besides, what would be the use of a procession,\" thought she, \"if people had all to lie down upon their faces, so that they couldn't see it?\" When the procession came opposite to Alice, they all stopped and looked at her, and the Queen said severely \"Who is this?\" She said it to the Knave of Hearts, who only bowed and smiled in reply. said the Queen, pointing to the three gardeners who were lying round the rose-tree; for, you see, as they were lying on their faces, and the pattern on their backs was the same as the rest of the pack, she could not tell whether they were gardeners, or soldiers, or courtiers, or three of her own children. said the Queen, in a shrill, loud voice, and the three gardeners instantly jumped up, and began bowing to the King, the Queen, the royal children, and everybody else. said Alice. \"No, I didn't,\" said Alice: \"I don't think it's at all a pity. I said 'What for?'\" The chief difficulty Alice found at first was in managing her flamingo: she succeeded in getting its body tucked away, comfortably enough, under her arm, with its legs hanging down, but generally, just as she had got its neck nicely straightened out, and was going to give the hedgehog a blow with its head, it would twist itself round and look up in her face, with such a puzzled expression that she could not help bursting out laughing: and when she had got its head down, and was going to begin again, it was very provoking to find that the hedgehog had unrolled itself, and was in the act of crawling away: besides all this, there was generally a ridge or furrow in the way wherever she wanted to send the hedgehog to, and, as the doubled-up soldiers were always getting up and walking off to other parts of the ground, Alice soon came to the conclusion that it was a very difficult game indeed. The players all played at once without waiting for turns, quarrelling all the while, and fighting for the hedgehogs; and in a very short time the Queen was in a furious passion, and went stamping about, and shouting \"Off with his head!\" Alice began to feel very uneasy: to be sure, she had not as yet had any dispute with the Queen, but she knew that it might happen any minute, \"and then,\" thought she, \"what would become of me? She was looking about for some way of escape, and wondering whether she could get away without being seen, when she noticed a curious appearance in the air: it puzzled her very much at first, but, after watching it a minute or two, she made it out to be a grin, and she said to herself \"It's the Cheshire Cat: now I shall have somebody to talk to.\" \"I don't think they play at all fairly,\" Alice began, in rather a complaining tone, \"and they all quarrel so dreadfully one can't hear oneself speak--and they don't seem to have any rules in particular; at least, if there are, nobody attends to them--and you've no idea how confusing it is all the things being alive; for instance, there's the arch I've got to go through next walking about at the other end of the ground--and I should have croqueted the Queen's hedgehog just now, only it ran away when it saw mine coming!\" \"How do you like the Queen?\" \"Not at all,\" said Alice: \"she's so extremely--\" Just then she noticed that the Queen was close behind her, listening: so she went on, \"--likely to win, that it's hardly worth while finishing the game.\" \"Who are you talking to?\" said the King, going up to Alice, and looking at the Cat's head with great curiosity. \"I don't like the look of it at all,\" said the King: \"however, it may kiss my hand if it likes.\" \"A cat may look at a king,\" said Alice. \"Off with his head!\" She had already heard her sentence three of the players to be executed for having missed their turns, and she did not like the look of things at all, as the game was in such confusion that she never knew whether it was her turn or not. The hedgehog was engaged in a fight with another hedgehog, which seemed to Alice an excellent opportunity for croqueting one of them with the other: the only difficulty was, that her flamingo was gone across to the other side of the garden, where Alice could see it trying in a helpless sort of way to fly up into a tree. When she got back to the Cheshire Cat, she was surprised to find quite a large crowd collected round it: there was a dispute going on between the executioner, the King, and the Queen, who were all talking at once, while all the rest were quite silent, and looked very uncomfortable. The executioner's argument was, that you couldn't cut off a head unless there was a body to cut it off from: that he had never had to do such a thing before, and he wasn't going to begin at his time of life. The King's argument was, that anything that had a head could be beheaded, and that you weren't to talk nonsense. The Cat's head began fading away the moment he was gone, and, by the time he had come back with the Duchess, it had entirely disappeared; so the King and the executioner ran wildly up and down looking for it, while the rest of the party went back to the game."
            },
            {
                "chunk_id": 8,
                "chunk_text": "The Mock Turtle's Story \"You can't think how glad I am to see you again, you dear old thing!\" Alice was very glad to find her in such a pleasant temper, and thought to herself that perhaps it was only the pepper that had made her so savage when they met in the kitchen. \"When I'm a Duchess,\" she said to herself, (not in a very hopeful tone though), \"I won't have any pepper in my kitchen at all. I only wish people knew that: then they wouldn't be so stingy about it, you know--\" She had quite forgotten the Duchess by this time, and was a little startled when she heard her voice close to her ear. I can't tell you just now what the moral of that is, but I shall remember it in a bit.\" However, she did not like to be rude, so she bore it as well as she could. \"I dare say you're wondering why I don't put my arm round your waist,\" the Duchess said after a pause: \"the reason is, that I'm doubtful about the temper of your flamingo. It doesn't look like one, but it is.\" \"I quite agree with you,\" said the Duchess; \"and the moral of that is--'Be what you would seem to be'--or if you'd like it put more simply--'Never imagine yourself not to be otherwise than what it might appear to others that what you were or might have been was not otherwise than what you had been would have appeared to them to be otherwise.'\" \"I think I should understand that better,\" Alice said very politely, \"if I had it written down: but I can't quite follow it as you say it.\" \"I make you a present of everything I've said as yet.\" Then the Queen left off, quite out of breath, and said to Alice, \"Have you seen the Mock Turtle yet?\" \"I don't even know what a Mock Turtle is.\" \"Come on, then,\" said the Queen, \"and he shall tell you his history,\" As they walked off together, Alice heard the King say in a low voice, to the company generally, \"You are all pardoned.\" (If you don't know what a Gryphon is, look at the picture.) Alice did not quite like the look of the creature, but on the whole she thought it would be quite as safe to stay with it as to go after that savage Queen: so she waited. said Alice. here,\" thought Alice, as she went slowly after it: \"I never was so ordered about in all my life, never!\" she asked the Gryphon, and the Gryphon answered, very nearly in the same words as before, \"It's all his fancy, that: he hasn't got no sorrow, you know. Alice was very nearly getting up and saying, \"Thank you, sir, for your interesting story,\" but she could not help thinking there must be more to come, so she sat still and said nothing. and he went on in these words: \"Yes, we went to school in the sea, though you mayn't believe it--\" \"I never said I didn't!\" \"You did,\" said the Mock Turtle. The Mock Turtle went on. said the Mock Turtle with a sigh. \"What was that?\" \"What is it?\" \"Well, then,\" the Gryphon went on, \"if you don't know what to uglify is, you are a simpleton.\" said Alice. \"I never went to him,\" the Mock Turtle said with a sigh: \"he taught Laughing and Grief, they used to say.\" \"Of course it was,\" said the Mock Turtle."
            },
            {
                "chunk_id": 9,
                "chunk_text": "At last the Mock Turtle recovered his voice, and, with tears running down his cheeks, he went on again:-- \"You may not have lived much under the sea--\" (\"I haven't,\" said Alice)--\"and perhaps you were never even introduced to a lobster--\" (Alice began to say \"I once tasted--\" but checked herself hastily, and said \"No, never\") \"--so you can have no idea what a delightful thing a Lobster Quadrille is!\" \"Then, you know,\" the Mock Turtle went on, \"you throw the--\" \"The lobsters!\" \"Back to land again, and that's all the first figure,\" said the Mock Turtle, suddenly dropping his voice; and the two creatures, who had been jumping about like mad things all this time, sat down again very sadly and quietly, and looked at Alice. said the Mock Turtle. said the Mock Turtle to the Gryphon. So they began solemnly dancing round and round Alice, every now and then treading on her toes when they passed too close, and waving their forepaws to mark the time, while the Mock Turtle sang this, very slowly and sadly:-- \"Will you walk a little faster?\" They are waiting on the shingle--will you come and join the dance? \"You can really have no notion how delightful it will be When they take us up and throw us, with the lobsters, out to sea!\" \"Thank you, it's a very interesting dance to watch,\" said Alice, feeling very glad that it was over at last: \"and I do so like that curious song about the whiting!\" \"Oh, as to the whiting,\" said the Mock Turtle, \"they--you've seen them, of course?\" \"I don't know where Dinn may be,\" said the Mock Turtle, \"but if you've seen them so often, of course you know what they're like.\" But they have their tails in their mouths; and the reason is--\" here the Mock Turtle yawned and shut his eyes.--\"Tell her about the reason and all that,\" he said to the Gryphon. \"The reason is,\" said the Gryphon, \"that they would go with the lobsters to the dance. So they couldn't get them out again. said the Gryphon. \"Boots and shoes under the sea,\" the Gryphon went on in a deep voice, \"are done with a whiting. \"Of course not,\" said the Mock Turtle: \"why, if a fish came to me, and told me he was going a journey, I should say 'With what porpoise?'\" said Alice. \"I mean what I say,\" the Mock Turtle replied in an offended tone. \"Explain all that,\" said the Mock Turtle. She was a little nervous about it just at first, the two creatures got so close to her, one on each side, and opened their eyes and mouths so very wide, but she gained courage as she went on. Her listeners were perfectly quiet till she got to the part about her repeating \"You are old, Father William,\" to the Caterpillar, and the words all coming different, and then the Mock Turtle drew a long breath, and said \"That's very curious.\" \"It's all about as curious as it can be,\" said the Gryphon. However, she got up, and began to repeat it, but her head was so full of the Lobster Quadrille, that she hardly knew what she was saying, and the words came very queer indeed:-- \"'Tis the voice of the Lobster; I heard him declare, \"You have baked me too brown, I must sugar my hair.\" When the pie was all finished, the Owl, as a boon, Was kindly permitted to pocket the spoon: While the Panther received knife and fork with a growl, And concluded the banquet--] \"What is the use of repeating all that stuff,\" the Mock Turtle interrupted, \"if you don't explain it as you go on? \"Or would you like the Mock Turtle to sing you a song?\" \"Oh, a song, please, if the Mock Turtle would be so kind,\" Alice replied, so eagerly that the Gryphon said, in a rather offended tone, \"Hm! Who would not give all else for two p ennyworth only of beautiful Soup? cried the Gryphon, and the Mock Turtle had just begun to repeat it, when a cry of \"The trial's beginning!\" and ran the faster, while more and more faintly came, carried on the breeze that followed them, the melancholy words:-- \"Soo--oop of the e--e--evening, Beautiful, beautiful Soup!\""
            },
            {
                "chunk_id": 10,
                "chunk_text": "The King and Queen of Hearts were seated on their throne when they arrived, with a great crowd assembled about them--all sorts of little birds and beasts, as well as the whole pack of cards: the Knave was standing before them, in chains, with a soldier on each side to guard him; and near the King was the White Rabbit, with a trumpet in one hand, and a scroll of parchment in the other. In the very middle of the court was a table, with a large dish of tarts upon it: they looked so good, that it made Alice quite hungry to look at them--\"I wish they'd get the trial done,\" she thought, \"and hand round the refreshments!\" Alice had never been in a court of justice before, but she had read about them in books, and she was quite pleased to find that she knew the name of nearly everything there. The judge, by the way, was the King; and as he wore his crown over the wig, (look at the frontispiece if you want to see how he did it,) he did not look at all comfortable, and it was certainly not becoming. on their slates, and she could even make out that one of them didn't know how to spell \"stupid,\" and that he had to ask his neighbour to tell him. This of course, Alice could not stand, and she went round the court and got behind him, and very soon found an opportunity of taking it away. She did it so quickly that the poor little juror (it was Bill, the Lizard) could not make out at all what had become of it; so, after hunting all about for it, he was obliged to write with one finger for the rest of the day; and this was of very little use, as it left no mark on the slate. said the King. He came in with a teacup in one hand and a piece of bread-and-butter in the other. \"I beg pardon, your Majesty,\" he began, \"for bringing these in: but I hadn't quite finished my tea when I was sent for.\" \"You ought to have finished,\" said the King. The Hatter looked at the March Hare, who had followed him into the court, arm-in- arm with the Dormouse. \"Write that down,\" the King said to the jury, and the jury eagerly wrote down all three dates on their slates, and then added them up, and reduced the answer to shillings and pence. I'm a hatter.\" \"Give your evidence,\" said the King; \"and don't be nervous, or I'll have you executed on the spot.\" Just at this moment Alice felt a very curious sensation, which puzzled her a good deal until she made out what it was: she was beginning to grow larger again, and she thought at first she would get up and leave the court; but on second thoughts she decided to remain where she was as long as there was room for her. said the Dormouse, who was sitting next to her. All this time the Queen had never left off staring at the Hatter, and, just as the Dormouse crossed the court, she said to one of the officers of the court, \"Bring me the list of the singers in the last concert!\" \"I'm a poor man, your Majesty,\" the Hatter began, in a trembling voice, \"--and I hadn't begun my tea--not above a week or so--and what with the bread-and-butter getting so thin--and the twinkling of the tea--\" \"The twinkling of the what?\" said the King. \"I'm a poor man,\" the Hatter went on, \"and most things twinkled after that--only the March Hare said--\" \"I didn't!\" said the Hatter. \"If that's all you know about it, you may stand down,\" continued the King. \"I can't go no lower,\" said the Hatter: \"I'm on the floor, as it is.\" --and just take his head off outside,\" the Queen added to one of the officers: but the Hatter was out of sight before the officer could get to the door. said the King. The King looked anxiously at the White Rabbit, who said in a low voice, \"Your Majesty must cross-examine this witness.\" \"Well, if I must, I must,\" the King said, with a melancholy air, and, after folding his arms and frowning at the cook till his eyes were nearly out of sight, he said in a deep voice, \"What are tarts made of?\" Alice watched the White Rabbit as he fumbled over the list, feeling very curious to see what the next witness would be like, \"--for they haven't got much evidence yet,\" she said to herself. Imagine her surprise, when the White Rabbit read out, at the top of his shrill little voice, the name \"Alice!\""
            },
            {
                "chunk_id": 11,
                "chunk_text": "cried Alice, quite forgetting in the flurry of the moment how large she had grown in the last few minutes, and she jumped up in such a hurry that she tipped over the jury-box with the edge of her skirt, upsetting all the jurymen on to the heads of the crowd below, and there they lay sprawling about, reminding her very much of a globe of goldfish she had accidentally upset the week before. she exclaimed in a tone of great dismay, and began picking them up again as quickly as she could, for the accident of the goldfish kept running in her head, and she had a vague sort of idea that they must be collected at once and put back into the jury-box, or they would die. \"The trial cannot proceed,\" said the King in a very grave voice, \"until all the jurymen are back in their proper places--all,\" he repeated with great emphasis, looking hard at Alice as he said so. She soon got it out again, and put it right; \"not that it signifies much,\" she said to herself; \"I should think it would be quite as much use in the trial one way up as the other.\" As soon as the jury had a little recovered from the shock of being upset, and their slates and pencils had been found and handed back to them, they set to work very diligently to write out a history of the accident, all except the Lizard, who seemed too much overcome to do anything but sit with its mouth open, gazing up into the roof of the court. the King said to Alice. \"Nothing,\" said Alice. \"That's very important,\" the King said, turning to the jury. They were just beginning to write this down on their slates, when the White Rabbit interrupted: \"Unimportant, your Majesty means, of course,\" he said in a very respectful tone, but frowning and making faces at him as he spoke. \"You are,\" said the King. \"It must have been that,\" said the King, \"unless it was written to nobody, which isn't usual, you know.\" \"It isn't directed at all,\" said the White Rabbit; \"in fact, there's nothing written on the outside.\" He unfolded the paper as he spoke, and added \"It isn't a letter, after all: it's a set of verses.\" \"No, they're not,\" said the White Rabbit, \"and that's the queerest thing about it.\" \"Please your Majesty,\" said the Knave, \"I didn't write it, and they can't prove I did: there's no name signed at the end.\" said Alice. \"Why, you don't even know what they're about!\" \"That's the most important piece of evidence we've heard yet,\" said the King, rubbing his hands; \"so now let the jury--\" \"If any one of them can explain it,\" said Alice, (she had grown so large in the last few minutes that she wasn't a bit afraid of interrupting him,) \"I'll give him sixpence. I don't believe there's an atom of meaning in it.\" And yet I don't know,\" he went on, spreading out the verses on his knee, and looking at them with one eye; \"I seem to see some meaning in them, after all. \" he said. \"All right, so far,\" said the King, and he went on muttering over the verses to himself: \"'We know it to be true--' that's the jury, of course--'I gave her one, they gave him two--' why, that must be what he did with the tarts, you know--\" \"But, it goes on 'they all returned from him to you,'\" said Alice. Then again--'before she had this fit--' you never had fits, my dear, I think?\" he said to the Queen. (The unfortunate little Bill had left off writing on his slate with one finger, as he found it made no mark; but he now hastily began again, using the ink, that was trickling down his face, as long as it lasted.) the King added in an offended tone, and everybody laughed, \"Let the jury consider their verdict,\" the King said, for about the twentieth time that day. said Alice. At this the whole pack rose up into the air, and came flying down upon her: she gave a little scream, half of fright and half of anger, and tried to beat them off, and found herself lying on the bank, with her head in the lap of her sister, who was gently brushing away some dead leaves that had fluttered down from the trees upon her face. said Alice, and she told her sister, as well as she could remember them, all these strange Adventures of hers that you have just been reading about; and when she had finished, her sister kissed her, and said, \"It was a curious dream, dear, certainly: but now run in to your tea; it's getting late.\" The long grass rustled at her feet as the White Rabbit hurried by--the frightened Mouse splashed his way through the neighbouring pool--she could hear the rattle of the teacups as the March Hare and his friends shared their never-ending meal, and the shrill voice of the Queen ordering off her unfortunate guests to execution--once more the pig-baby was sneezing on the Duchess's knee, while plates and dishes crashed around it--once more the shriek of the Gryphon, the squeaking of the Lizard's slate- pencil, and the choking of the suppressed guinea-pigs, filled the air, mixed up with the distant sobs of the miserable Mock Turtle."
            }
        ],
        "text": "ALICE ADVENTURES IN\nWONDERLAND\nLewis Carroll\nPublished By\nT E P 2020 B\nHIS DITION UBLISHED IN Y\nPDFB W .C\nOOKS ORLD OM\nPublisher Notes:\nContents of this edition have been sourced from public domain materials.\nPDFBooksWorld has created, edited and published the EBook version from the\nmanuscripts, texts and illustrative images found in public domain archives.\nRegistered members can download this EBook from our website for personal reading.\nHowever this file shall not be stored & transmitted in any form or reverse engineered\nfor commercial purpose.\nTable of Contents\nALICE ADVENTURES IN WONDERLAND\nLewis Carroll\nCHAPTER I. Down the Rabbit-Hole\nCHAPTER II. The Pool of Tears\nCHAPTER III. A Caucus-Race and a Long Tale\nCHAPTER IV. The Rabbit Sends in a Little Bill\nCHAPTER V. Advice from a Caterpillar\nCHAPTER VI. Pig and Pepper\nCHAPTER VII. A Mad Tea-Party\nCHAPTER VIII. The Queen’s Croquet-Ground\nCHAPTER IX. The Mock Turtle’s Story\nCHAPTER X. The Lobster Quadrille\nCHAPTER XI. Who Stole the Tarts?\nCHAPTER XII. Alice’s Evidence\nCHAPTER I.\nDown the Rabbit-Hole\nAlice was beginning to get very tired of sitting by her sister on the bank, and of\nhaving nothing to do: once or twice she had peeped into the book her sister was\nreading, but it had no pictures or conversations in it, “and what is the use of a book,”\nthought Alice “without pictures or conversations?”\nSo she was considering in her own mind (as well as she could, for the hot day made\nher feel very sleepy and stupid), whether the pleasure of making a daisy-chain would\nbe worth the trouble of getting up and picking the daisies, when suddenly a White\nRabbit with pink eyes ran close by her.\nThere was nothing so very remarkable in that; nor did Alice think it so very much out\nof the way to hear the Rabbit say to itself, “Oh dear! Oh dear! I shall be late!” (when she\nthought it over afterwards, it occurred to her that she ought to have wondered at this,\nbut at the time it all seemed quite natural); but when the Rabbit actually took a watch\nout of its waistcoat-pocket, and looked at it, and then hurried on, Alice started to her\nfeet, for it flashed across her mind that she had never before seen a rabbit with either a\nwaistcoat-pocket, or a watch to take out of it, and burning with curiosity, she ran\nacross the field after it, and fortunately was just in time to see it pop down a large\nrabbit-hole under the hedge.\nIn another moment down went Alice after it, never once considering how in the\nworld she was to get out again.\nThe rabbit-hole went straight on like a tunnel for some way, and then dipped\nsuddenly down, so suddenly that Alice had not a moment to think about stopping\nherself before she found herself falling down a very deep well.\nEither the well was very deep, or she fell very slowly, for she had plenty of time as\nshe went down to look about her and to wonder what was going to happen next. First,\nshe tried to look down and make out what she was coming to, but it was too dark to see\nanything; then she looked at the sides of the well, and noticed that they were filled\nwith cupboards and book-shelves; here and there she saw maps and pictures hung\nupon pegs. She took down a jar from one of the shelves as she passed; it was labelled\n“ORANGE MARMALADE”, but to her great disappointment it was empty: she did not\nlike to drop the jar for fear of killing somebody underneath, so managed to put it into\none of the cupboards as she fell past it.\n“Well!” thought Alice to herself, “after such a fall as this, I shall think nothing of\ntumbling down stairs! How brave they’ll all think me at home! Why, I wouldn’t say\nanything about it, even if I fell off the top of the house!” (Which was very likely true.)\nDown, down, down. Would the fall never come to an end? “I wonder how many miles\nI’ve fallen by this time?” she said aloud. “I must be getting somewhere near the centre\nof the earth. Let me see: that would be four thousand miles down, I think—” (for, you\nsee, Alice had learnt several things of this sort in her lessons in the schoolroom, and\nthough this was not a very good opportunity for showing off her knowledge, as there\nwas no one to listen to her, still it was good practice to say it over) “—yes, that’s about\nthe right distance—but then I wonder what Latitude or Longitude I’ve got to?” (Alice\nhad no idea what Latitude was, or Longitude either, but thought they were nice grand\nwords to say.)\nPresently she began again. “I wonder if I shall fall right through the earth! How funny\nit’ll seem to come out among the people that walk with their heads downward! The\nAntipathies, I think—” (she was rather glad there was no one listening, this time, as it\ndidn’t sound at all the right word) “—but I shall have to ask them what the name of the\ncountry is, you know. Please, Ma’am, is this New Zealand or Australia?” (and she tried\nto curtsey as she spoke—fancy curtseying as you’re falling through the air! Do you think\nyou could manage it?) “And what an ignorant little girl she’ll think me for asking! No,\nit’ll never do to ask: perhaps I shall see it written up somewhere.”\nDown, down, down. There was nothing else to do, so Alice soon began talking again.\n“Dinah’ll miss me very much to-night, I should think!” (Dinah was the cat.) “I hope\nthey’ll remember her saucer of milk at tea-time. Dinah my dear! I wish you were down\nhere with me! There are no mice in the air, I’m afraid, but you might catch a bat, and\nthat’s very like a mouse, you know. But do cats eat bats, I wonder?” And here Alice\nbegan to get rather sleepy, and went on saying to herself, in a dreamy sort of way, “Do\ncats eat bats? Do cats eat bats?” and sometimes, “Do bats eat cats?” for, you see, as she\ncouldn’t answer either question, it didn’t much matter which way she put it. She felt\nthat she was dozing off, and had just begun to dream that she was walking hand in\nhand with Dinah, and saying to her very earnestly, “Now, Dinah, tell me the truth: did\nyou ever eat a bat?” when suddenly, thump! thump! down she came upon a heap of\nsticks and dry leaves, and the fall was over.\nAlice was not a bit hurt, and she jumped up on to her feet in a moment: she looked\nup, but it was all dark overhead; before her was another long passage, and the White\nRabbit was still in sight, hurrying down it. There was not a moment to be lost: away\nwent Alice like the wind, and was just in time to hear it say, as it turned a corner, “Oh\nmy ears and whiskers, how late it’s getting!” She was close behind it when she turned\nthe corner, but the Rabbit was no longer to be seen: she found herself in a long, low\nhall, which was lit up by a row of lamps hanging from the roof.\nThere were doors all round the hall, but they were all locked; and when Alice had\nbeen all the way down one side and up the other, trying every door, she walked sadly\ndown the middle, wondering how she was ever to get out again.\nSuddenly she came upon a little three-legged table, all made of solid glass; there was\nnothing on it except a tiny golden key, and Alice’s first thought was that it might\nbelong to one of the doors of the hall; but, alas! either the locks were too large, or the\nkey was too small, but at any rate it would not open any of them. However, on the\nsecond time round, she came upon a low curtain she had not noticed before, and\nbehind it was a little door about fifteen inches high: she tried the little golden key in\nthe lock, and to her great delight it fitted!\nAlice opened the door and found that it led into a small passage, not much larger\nthan a rat-hole: she knelt down and looked along the passage into the loveliest garden\nyou ever saw. How she longed to get out of that dark hall, and wander about among\nthose beds of bright flowers and those cool fountains, but she could not even get her\nhead through the doorway; “and even if my head would go through,” thought poor\nAlice, “it would be of very little use without my shoulders. Oh, how I wish I could shut\nup like a telescope! I think I could, if I only knew how to begin.” For, you see, so many\nout-of-the-way things had happened lately, that Alice had begun to think that very few\nthings indeed were really impossible.\nThere seemed to be no use in waiting by the little door, so she went back to the table,\nhalf hoping she might find another key on it, or at any rate a book of rules for shutting\npeople up like telescopes: this time she found a little bottle on it, (“which certainly was\nnot here before,” said Alice,) and round the neck of the bottle was a paper label, with\nthe words “DRINK ME,” beautifully printed on it in large letters.\nIt was all very well to say “Drink me,” but the wise little Alice was not going to do\nthat in a hurry. “No, I’ll look first,” she said, “and see whether it’s marked ‘poison’ or\nnot”; for she had read several nice little histories about children who had got burnt,\nand eaten up by wild beasts and other unpleasant things, all because they would not\nremember the simple rules their friends had taught them: such as, that a red-hot poker\nwill burn you if you hold it too long; and that if you cut your finger very deeply with a\nknife, it usually bleeds; and she had never forgotten that, if you drink much from a\nbottle marked “poison,” it is almost certain to disagree with you, sooner or later.\nHowever, this bottle was not marked “poison,” so Alice ventured to taste it, and\nfinding it very nice, (it had, in fact, a sort of mixed flavour of cherry-tart, custard, pine-\napple, roast turkey, toffee, and hot buttered toast,) she very soon finished it off.\n* * * * * * *\n* * * * * *\n* * * * * * *\n“What a curious feeling!” said Alice; “I must be shutting up like a telescope.”\nAnd so it was indeed: she was now only ten inches high, and her face brightened up\nat the thought that she was now the right size for going through the little door into\nthat lovely garden. First, however, she waited for a few minutes to see if she was going\nto shrink any further: she felt a little nervous about this; “for it might end, you know,”\nsaid Alice to herself, “in my going out altogether, like a candle. I wonder what I should\nbe like then?” And she tried to fancy what the flame of a candle is like after the candle\nis blown out, for she could not remember ever having seen such a thing.\nAfter a while, finding that nothing more happened, she decided on going into the\ngarden at once; but, alas for poor Alice! when she got to the door, she found she had\nforgotten the little golden key, and when she went back to the table for it, she found\nshe could not possibly reach it: she could see it quite plainly through the glass, and she\ntried her best to climb up one of the legs of the table, but it was too slippery; and when\nshe had tired herself out with trying, the poor little thing sat down and cried.\n“Come, there’s no use in crying like that!” said Alice to herself, rather sharply; “I\nadvise you to leave off this minute!” She generally gave herself very good advice,\n(though she very seldom followed it), and sometimes she scolded herself so severely as\nto bring tears into her eyes; and once she remembered trying to box her own ears for\nhaving cheated herself in a game of croquet she was playing against herself, for this\ncurious child was very fond of pretending to be two people. “But it’s no use now,”\nthought poor Alice, “to pretend to be two people! Why, there’s hardly enough of me left\nto make one respectable person!”\nSoon her eye fell on a little glass box that was lying under the table: she opened it,\nand found in it a very small cake, on which the words “EAT ME” were beautifully\nmarked in currants. “Well, I’ll eat it,” said Alice, “and if it makes me grow larger, I can\nreach the key; and if it makes me grow smaller, I can creep under the door; so either\nway I’ll get into the garden, and I don’t care which happens!”\nShe ate a little bit, and said anxiously to herself, “Which way? Which way?”, holding\nher hand on the top of her head to feel which way it was growing, and she was quite\nsurprised to find that she remained the same size: to be sure, this generally happens\nwhen one eats cake, but Alice had got so much into the way of expecting nothing but\nout-of-the-way things to happen, that it seemed quite dull and stupid for life to go on\nin the common way.\nSo she set to work, and very soon finished off the cake.\n* * * * * * *\n* * * * * *\n* * * * * * *\nCHAPTER II.\nThe Pool of Tears\n“Curiouser and curiouser!” cried Alice (she was so much surprised, that for the\nmoment she quite forgot how to speak good English); “now I’m opening out like the\nlargest telescope that ever was! Good-bye, feet!” (for when she looked down at her feet,\nthey seemed to be almost out of sight, they were getting so far off). “Oh, my poor little\nfeet, I wonder who will put on your shoes and stockings for you now, dears? I’m sure I\nshan’t be able! I shall be a great deal too far off to trouble myself about you: you must\nmanage the best way you can;—but I must be kind to them,” thought Alice, “or perhaps\nthey won’t walk the way I want to go! Let me see: I’ll give them a new pair of boots\nevery Christmas.”\nAnd she went on planning to herself how she would manage it. “They must go by the\ncarrier,” she thought; “and how funny it’ll seem, sending presents to one’s own feet!\nAnd how odd the directions will look!\nAlice’s Right Foot, Esq.,\nHearthrug,\nnear the Fender,\n(with Alice’s love).\nOh dear, what nonsense I’m talking!”\nJust then her head struck against the roof of the hall: in fact she was now more than\nnine feet high, and she at once took up the little golden key and hurried off to the\ngarden door.\nPoor Alice! It was as much as she could do, lying down on one side, to look through\ninto the garden with one eye; but to get through was more hopeless than ever: she sat\ndown and began to cry again.\n“You ought to be ashamed of yourself,” said Alice, “a great girl like you,” (she might\nwell say this), “to go on crying in this way! Stop this moment, I tell you!” But she went\non all the same, shedding gallons of tears, until there was a large pool all round her,\nabout four inches deep and reaching half down the hall.\nAfter a time she heard a little pattering of feet in the distance, and she hastily dried\nher eyes to see what was coming. It was the White Rabbit returning, splendidly\ndressed, with a pair of white kid gloves in one hand and a large fan in the other: he\ncame trotting along in a great hurry, muttering to himself as he came, “Oh! the\nDuchess, the Duchess! Oh! won’t she be savage if I’ve kept her waiting!” Alice felt so\ndesperate that she was ready to ask help of any one; so, when the Rabbit came near her,\nshe began, in a low, timid voice, “If you please, sir—” The Rabbit started violently,\ndropped the white kid gloves and the fan, and skurried away into the darkness as hard\nas he could go.\nAlice took up the fan and gloves, and, as the hall was very hot, she kept fanning\nherself all the time she went on talking: “Dear, dear! How queer everything is to-day!\nAnd yesterday things went on just as usual. I wonder if I’ve been changed in the night?\nLet me think: was I the same when I got up this morning? I almost think I can\nremember feeling a little different. But if I’m not the same, the next question is, Who in\nthe world am I? Ah, that’s the great puzzle!” And she began thinking over all the\nchildren she knew that were of the same age as herself, to see if she could have been\nchanged for any of them.\n“I’m sure I’m not Ada,” she said, “for her hair goes in such long ringlets, and mine\ndoesn’t go in ringlets at all; and I’m sure I can’t be Mabel, for I know all sorts of things,\nand she, oh! she knows such a very little! Besides, she’s she, and I’m I, and—oh dear,\nhow puzzling it all is! I’ll try if I know all the things I used to know. Let me see: four\ntimes five is twelve, and four times six is thirteen, and four times seven is—oh dear! I\nshall never get to twenty at that rate! However, the Multiplication Table doesn’t\nsignify: let’s try Geography. London is the capital of Paris, and Paris is the capital of\nRome, and Rome—no, that’s all wrong, I’m certain! I must have been changed for\nMabel! I’ll try and say ‘How doth the little—’” and she crossed her hands on her lap as if\nshe were saying lessons, and began to repeat it, but her voice sounded hoarse and\nstrange, and the words did not come the same as they used to do:—\n“How doth the little crocodile\nImprove his shining tail,\nAnd pour the waters of the Nile\nOn every golden scale!\n“How cheerfully he seems to grin,\nHow neatly spread his claws,\nAnd welcome little fishes in\nWith gently smiling jaws!”\n“I’m sure those are not the right words,” said poor Alice, and her eyes filled with\ntears again as she went on, “I must be Mabel after all, and I shall have to go and live in\nthat poky little house, and have next to no toys to play with, and oh! ever so many\nlessons to learn! No, I’ve made up my mind about it; if I’m Mabel, I’ll stay down here!\nIt’ll be no use their putting their heads down and saying ‘Come up again, dear!’ I shall\nonly look up and say ‘Who am I then? Tell me that first, and then, if I like being that\nperson, I’ll come up: if not, I’ll stay down here till I’m somebody else’—but, oh dear!”\ncried Alice, with a sudden burst of tears, “I do wish they would put their heads down! I\nam so very tired of being all alone here!”\nAs she said this she looked down at her hands, and was surprised to see that she had\nput on one of the Rabbit’s little white kid gloves while she was talking. “How can I have\ndone that?” she thought. “I must be growing small again.” She got up and went to the\ntable to measure herself by it, and found that, as nearly as she could guess, she was\nnow about two feet high, and was going on shrinking rapidly: she soon found out that\nthe cause of this was the fan she was holding, and she dropped it hastily, just in time to\navoid shrinking away altogether.\n“That was a narrow escape!” said Alice, a good deal frightened at the sudden change,\nbut very glad to find herself still in existence; “and now for the garden!” and she ran\nwith all speed back to the little door: but, alas! the little door was shut again, and the\nlittle golden key was lying on the glass table as before, “and things are worse than\never,” thought the poor child, “for I never was so small as this before, never! And I\ndeclare it’s too bad, that it is!”\nAs she said these words her foot slipped, and in another moment, splash! she was up\nto her chin in salt water. Her first idea was that she had somehow fallen into the sea,\n“and in that case I can go back by railway,” she said to herself. (Alice had been to the\nseaside once in her life, and had come to the general conclusion, that wherever you go\nto on the English coast you find a number of bathing machines in the sea, some\nchildren digging in the sand with wooden spades, then a row of lodging houses, and\nbehind them a railway station.) However, she soon made out that she was in the pool\nof tears which she had wept when she was nine feet high.\n“I wish I hadn’t cried so much!” said Alice, as she swam about, trying to find her way\nout. “I shall be punished for it now, I suppose, by being drowned in my own tears! That\nwill be a queer thing, to be sure! However, everything is queer to-day.”\nJust then she heard something splashing about in the pool a little way off, and she\nswam nearer to make out what it was: at first she thought it must be a walrus or\nhippopotamus, but then she remembered how small she was now, and she soon made\nout that it was only a mouse that had slipped in like herself.\n“Would it be of any use, now,” thought Alice, “to speak to this mouse? Everything is\nso out-of-the-way down here, that I should think very likely it can talk: at any rate,\nthere’s no harm in trying.” So she began: “O Mouse, do you know the way out of this\npool? I am very tired of swimming about here, O Mouse!” (Alice thought this must be\nthe right way of speaking to a mouse: she had never done such a thing before, but she\nremembered having seen in her brother’s Latin Grammar, “A mouse—of a mouse—to a\nmouse—a mouse—O mouse!”) The Mouse looked at her rather inquisitively, and\nseemed to her to wink with one of its little eyes, but it said nothing.\n“Perhaps it doesn’t understand English,” thought Alice; “I daresay it’s a French\nmouse, come over with William the Conqueror.” (For, with all her knowledge of\nhistory, Alice had no very clear notion how long ago anything had happened.) So she\nbegan again: “Où est ma chatte?” which was the first sentence in her French lesson-\nbook. The Mouse gave a sudden leap out of the water, and seemed to quiver all over\nwith fright. “Oh, I beg your pardon!” cried Alice hastily, afraid that she had hurt the\npoor animal’s feelings. “I quite forgot you didn’t like cats.”\n“Not like cats!” cried the Mouse, in a shrill, passionate voice. “Would you like cats if\nyou were me?”\n“Well, perhaps not,” said Alice in a soothing tone: “don’t be angry about it. And yet I\nwish I could show you our cat Dinah: I think you’d take a fancy to cats if you could only\nsee her. She is such a dear quiet thing,” Alice went on, half to herself, as she swam lazily\nabout in the pool, “and she sits purring so nicely by the fire, licking her paws and\nwashing her face—and she is such a nice soft thing to nurse—and she’s such a capital\none for catching mice—oh, I beg your pardon!” cried Alice again, for this time the\nMouse was bristling all over, and she felt certain it must be really offended. “We won’t\ntalk about her any more if you’d rather not.”\n“We indeed!” cried the Mouse, who was trembling down to the end of his tail. “As if I\nwould talk on such a subject! Our family always hated cats: nasty, low, vulgar things!\nDon’t let me hear the name again!”\n“I won’t indeed!” said Alice, in a great hurry to change the subject of conversation.\n“Are you—are you fond—of—of dogs?” The Mouse did not answer, so Alice went on\neagerly: “There is such a nice little dog near our house I should like to show you! A little\nbright-eyed terrier, you know, with oh, such long curly brown hair! And it’ll fetch\nthings when you throw them, and it’ll sit up and beg for its dinner, and all sorts of\nthings—I can’t remember half of them—and it belongs to a farmer, you know, and he\nsays it’s so useful, it’s worth a hundred pounds! He says it kills all the rats and—oh\ndear!” cried Alice in a sorrowful tone, “I’m afraid I’ve offended it again!” For the Mouse\nwas swimming away from her as hard as it could go, and making quite a commotion in\nthe pool as it went.\nSo she called softly after it, “Mouse dear! Do come back again, and we won’t talk\nabout cats or dogs either, if you don’t like them!” When the Mouse heard this, it turned\nround and swam slowly back to her: its face was quite pale (with passion, Alice\nthought), and it said in a low trembling voice, “Let us get to the shore, and then I’ll tell\nyou my history, and you’ll understand why it is I hate cats and dogs.”\nIt was high time to go, for the pool was getting quite crowded with the birds and\nanimals that had fallen into it: there were a Duck and a Dodo, a Lory and an Eaglet, and\nseveral other curious creatures. Alice led the way, and the whole party swam to the\nshore.\nCHAPTER III.\nA Caucus-Race and a Long Tale\nThey were indeed a queer-looking party that assembled on the bank—the birds with\ndraggled feathers, the animals with their fur clinging close to them, and all dripping\nwet, cross, and uncomfortable.\nThe first question of course was, how to get dry again: they had a consultation about\nthis, and after a few minutes it seemed quite natural to Alice to find herself talking\nfamiliarly with them, as if she had known them all her life. Indeed, she had quite a long\nargument with the Lory, who at last turned sulky, and would only say, “I am older than\nyou, and must know better;” and this Alice would not allow without knowing how old\nit was, and, as the Lory positively refused to tell its age, there was no more to be said.\nAt last the Mouse, who seemed to be a person of authority among them, called out,\n“Sit down, all of you, and listen to me! I’ll soon make you dry enough!” They all sat\ndown at once, in a large ring, with the Mouse in the middle. Alice kept her eyes\nanxiously fixed on it, for she felt sure she would catch a bad cold if she did not get dry\nvery soon.\n“Ahem!” said the Mouse with an important air, “are you all ready? This is the driest\nthing I know. Silence all round, if you please! ‘William the Conqueror, whose cause was\nfavoured by the pope, was soon submitted to by the English, who wanted leaders, and\nhad been of late much accustomed to usurpation and conquest. Edwin and Morcar, the\nearls of Mercia and Northumbria—’”\n“Ugh!” said the Lory, with a shiver.\n“I beg your pardon!” said the Mouse, frowning, but very politely: “Did you speak?”\n“Not I!” said the Lory hastily.\n“I thought you did,” said the Mouse. “—I proceed. ‘Edwin and Morcar, the earls of\nMercia and Northumbria, declared for him: and even Stigand, the patriotic archbishop\nof Canterbury, found it advisable—’”\n“Found what?” said the Duck.\n“Found it,” the Mouse replied rather crossly: “of course you know what ‘it’ means.”\n“I know what ‘it’ means well enough, when I find a thing,” said the Duck: “it’s\ngenerally a frog or a worm. The question is, what did the archbishop find?”\nThe Mouse did not notice this question, but hurriedly went on, “‘—found it advisable\nto go with Edgar Atheling to meet William and offer him the crown. William’s conduct\nat first was moderate. But the insolence of his Normans—’ How are you getting on\nnow, my dear?” it continued, turning to Alice as it spoke.\n“As wet as ever,” said Alice in a melancholy tone: “it doesn’t seem to dry me at all.”\n“In that case,” said the Dodo solemnly, rising to its feet, “I move that the meeting\nadjourn, for the immediate adoption of more energetic remedies—”\n“Speak English!” said the Eaglet. “I don’t know the meaning of half those long words,\nand, what’s more, I don’t believe you do either!” And the Eaglet bent down its head to\nhide a smile: some of the other birds tittered audibly.\n“What I was going to say,” said the Dodo in an offended tone, “was, that the best\nthing to get us dry would be a Caucus-race.”\n“What is a Caucus-race?” said Alice; not that she wanted much to know, but the Dodo\nhad paused as if it thought that somebody ought to speak, and no one else seemed\ninclined to say anything.\n“Why,” said the Dodo, “the best way to explain it is to do it.” (And, as you might like\nto try the thing yourself, some winter day, I will tell you how the Dodo managed it.)\nFirst it marked out a race-course, in a sort of circle, (“the exact shape doesn’t matter,”\nit said,) and then all the party were placed along the course, here and there. There was\nno “One, two, three, and away,” but they began running when they liked, and left off\nwhen they liked, so that it was not easy to know when the race was over. However,\nwhen they had been running half an hour or so, and were quite dry again, the Dodo\nsuddenly called out “The race is over!” and they all crowded round it, panting, and\nasking, “But who has won?”\nThis question the Dodo could not answer without a great deal of thought, and it sat\nfor a long time with one finger pressed upon its forehead (the position in which you\nusually see Shakespeare, in the pictures of him), while the rest waited in silence. At last\nthe Dodo said, “Everybody has won, and all must have prizes.”\n“But who is to give the prizes?” quite a chorus of voices asked.\n“Why, she, of course,” said the Dodo, pointing to Alice with one finger; and the whole\nparty at once crowded round her, calling out in a confused way, “Prizes! Prizes!”\nAlice had no idea what to do, and in despair she put her hand in her pocket, and\npulled out a box of comfits, (luckily the salt water had not got into it), and handed\nthem round as prizes. There was exactly one a-piece, all round.\n“But she must have a prize herself, you know,” said the Mouse.\n“Of course,” the Dodo replied very gravely. “What else have you got in your pocket?”\nhe went on, turning to Alice.\n“Only a thimble,” said Alice sadly.\n“Hand it over here,” said the Dodo.\nThen they all crowded round her once more, while the Dodo solemnly presented the\nthimble, saying “We beg your acceptance of this elegant thimble;” and, when it had\nfinished this short speech, they all cheered.\nAlice thought the whole thing very absurd, but they all looked so grave that she did\nnot dare to laugh; and, as she could not think of anything to say, she simply bowed,\nand took the thimble, looking as solemn as she could.\nThe next thing was to eat the comfits: this caused some noise and confusion, as the\nlarge birds complained that they could not taste theirs, and the small ones choked and\nhad to be patted on the back. However, it was over at last, and they sat down again in a\nring, and begged the Mouse to tell them something more.\n“You promised to tell me your history, you know,” said Alice, “and why it is you hate\n—C and D,” she added in a whisper, half afraid that it would be offended again.\n“Mine is a long and a sad tale!” said the Mouse, turning to Alice, and sighing.\n“It is a long tail, certainly,” said Alice, looking down with wonder at the Mouse’s tail;\n“but why do you call it sad?” And she kept on puzzling about it while the Mouse was\nspeaking, so that her idea of the tale was something like this:—\n“Fury said to a\nmouse, That he\nmet in the\nhouse,\n‘Let us\nboth go to\nlaw: I will\nprosecute\nyou.—Come,\nI’ll take no\ndenial; We\nmust have a\ntrial: For\nreally this\nmorning I’ve\nnothing\nto do.’\nSaid the\nmouse to the\ncur, ‘Such\na trial,\ndear sir,\nWith\nno jury\nor judge,\nwould be\nwasting\nour\nbreath.’\n‘I’ll be\njudge, I’ll\nbe jury,’\nSaid\ncunning\nold Fury:\n‘I’ll\ntry the\nwhole\ncause,\nand\ncondemn\nyou\nto\ndeath.’”\n“You are not attending!” said the Mouse to Alice severely. “What are you thinking\nof?”\n“I beg your pardon,” said Alice very humbly: “you had got to the fifth bend, I think?”\n“I had not!” cried the Mouse, sharply and very angrily.\n“A knot!” said Alice, always ready to make herself useful, and looking anxiously\nabout her. “Oh, do let me help to undo it!”\n“I shall do nothing of the sort,” said the Mouse, getting up and walking away. “You\ninsult me by talking such nonsense!”\n“I didn’t mean it!” pleaded poor Alice. “But you’re so easily offended, you know!”\nThe Mouse only growled in reply.\n“Please come back and finish your story!” Alice called after it; and the others all\njoined in chorus, “Yes, please do!” but the Mouse only shook its head impatiently, and\nwalked a little quicker.\n“What a pity it wouldn’t stay!” sighed the Lory, as soon as it was quite out of sight;\nand an old Crab took the opportunity of saying to her daughter “Ah, my dear! Let this\nbe a lesson to you never to lose your temper!” “Hold your tongue, Ma!” said the young\nCrab, a little snappishly. “You’re enough to try the patience of an oyster!”\n“I wish I had our Dinah here, I know I do!” said Alice aloud, addressing nobody in\nparticular. “She’d soon fetch it back!”\n“And who is Dinah, if I might venture to ask the question?” said the Lory.\nAlice replied eagerly, for she was always ready to talk about her pet: “Dinah’s our cat.\nAnd she’s such a capital one for catching mice you can’t think! And oh, I wish you could\nsee her after the birds! Why, she’ll eat a little bird as soon as look at it!”\nThis speech caused a remarkable sensation among the party. Some of the birds\nhurried off at once: one old Magpie began wrapping itself up very carefully, remarking,\n“I really must be getting home; the night-air doesn’t suit my throat!” and a Canary\ncalled out in a trembling voice to its children, “Come away, my dears! It’s high time you\nwere all in bed!” On various pretexts they all moved off, and Alice was soon left alone.\n“I wish I hadn’t mentioned Dinah!” she said to herself in a melancholy tone. “Nobody\nseems to like her, down here, and I’m sure she’s the best cat in the world! Oh, my dear\nDinah! I wonder if I shall ever see you any more!” And here poor Alice began to cry\nagain, for she felt very lonely and low-spirited. In a little while, however, she again\nheard a little pattering of footsteps in the distance, and she looked up eagerly, half\nhoping that the Mouse had changed his mind, and was coming back to finish his story.\nCHAPTER IV.\nThe Rabbit Sends in a Little Bill\nIt was the White Rabbit, trotting slowly back again, and looking anxiously about as it\nwent, as if it had lost something; and she heard it muttering to itself “The Duchess! The\nDuchess! Oh my dear paws! Oh my fur and whiskers! She’ll get me executed, as sure as\nferrets are ferrets! Where can I have dropped them, I wonder?” Alice guessed in a\nmoment that it was looking for the fan and the pair of white kid gloves, and she very\ngood-naturedly began hunting about for them, but they were nowhere to be seen—\neverything seemed to have changed since her swim in the pool, and the great hall, with\nthe glass table and the little door, had vanished completely.\nVery soon the Rabbit noticed Alice, as she went hunting about, and called out to her\nin an angry tone, “Why, Mary Ann, what are you doing out here? Run home this\nmoment, and fetch me a pair of gloves and a fan! Quick, now!” And Alice was so much\nfrightened that she ran off at once in the direction it pointed to, without trying to\nexplain the mistake it had made.\n“He took me for his housemaid,” she said to herself as she ran. “How surprised he’ll\nbe when he finds out who I am! But I’d better take him his fan and gloves—that is, if I\ncan find them.” As she said this, she came upon a neat little house, on the door of\nwhich was a bright brass plate with the name “W. RABBIT,” engraved upon it. She went\nin without knocking, and hurried upstairs, in great fear lest she should meet the real\nMary Ann, and be turned out of the house before she had found the fan and gloves.\n“How queer it seems,” Alice said to herself, “to be going messages for a rabbit! I\nsuppose Dinah’ll be sending me on messages next!” And she began fancying the sort of\nthing that would happen: “‘Miss Alice! Come here directly, and get ready for your walk!’\n‘Coming in a minute, nurse! But I’ve got to see that the mouse doesn’t get out.’ Only I\ndon’t think,” Alice went on, “that they’d let Dinah stop in the house if it began ordering\npeople about like that!”\nBy this time she had found her way into a tidy little room with a table in the window,\nand on it (as she had hoped) a fan and two or three pairs of tiny white kid gloves: she\ntook up the fan and a pair of the gloves, and was just going to leave the room, when her\neye fell upon a little bottle that stood near the looking-glass. There was no label this\ntime with the words “DRINK ME,” but nevertheless she uncorked it and put it to her\nlips. “I know something interesting is sure to happen,” she said to herself, “whenever I\neat or drink anything; so I’ll just see what this bottle does. I do hope it’ll make me grow\nlarge again, for really I’m quite tired of being such a tiny little thing!”\nIt did so indeed, and much sooner than she had expected: before she had drunk half\nthe bottle, she found her head pressing against the ceiling, and had to stoop to save her\nneck from being broken. She hastily put down the bottle, saying to herself “That’s quite\nenough—I hope I shan’t grow any more—As it is, I can’t get out at the door—I do wish I\nhadn’t drunk quite so much!”\nAlas! it was too late to wish that! She went on growing, and growing, and very soon\nhad to kneel down on the floor: in another minute there was not even room for this,\nand she tried the effect of lying down with one elbow against the door, and the other\narm curled round her head. Still she went on growing, and, as a last resource, she put\none arm out of the window, and one foot up the chimney, and said to herself “Now I\ncan do no more, whatever happens. What will become of me?”\nLuckily for Alice, the little magic bottle had now had its full effect, and she grew no\nlarger: still it was very uncomfortable, and, as there seemed to be no sort of chance of\nher ever getting out of the room again, no wonder she felt unhappy.\n“It was much pleasanter at home,” thought poor Alice, “when one wasn’t always\ngrowing larger and smaller, and being ordered about by mice and rabbits. I almost\nwish I hadn’t gone down that rabbit-hole—and yet—and yet—it’s rather curious, you\nknow, this sort of life! I do wonder what can have happened to me! When I used to read\nfairy-tales, I fancied that kind of thing never happened, and now here I am in the\nmiddle of one! There ought to be a book written about me, that there ought! And when\nI grow up, I’ll write one—but I’m grown up now,” she added in a sorrowful tone; “at\nleast there’s no room to grow up any more here.”\n“But then,” thought Alice, “shall I never get any older than I am now? That’ll be a\ncomfort, one way—never to be an old woman—but then—always to have lessons to\nlearn! Oh, I shouldn’t like that!”\n“Oh, you foolish Alice!” she answered herself. “How can you learn lessons in here?\nWhy, there’s hardly room for you, and no room at all for any lesson-books!”\nAnd so she went on, taking first one side and then the other, and making quite a\nconversation of it altogether; but after a few minutes she heard a voice outside, and\nstopped to listen.\n“Mary Ann! Mary Ann!” said the voice. “Fetch me my gloves this moment!” Then\ncame a little pattering of feet on the stairs. Alice knew it was the Rabbit coming to look\nfor her, and she trembled till she shook the house, quite forgetting that she was now\nabout a thousand times as large as the Rabbit, and had no reason to be afraid of it.\nPresently the Rabbit came up to the door, and tried to open it; but, as the door opened\ninwards, and Alice’s elbow was pressed hard against it, that attempt proved a failure.\nAlice heard it say to itself “Then I’ll go round and get in at the window.”\n“That you won’t!” thought Alice, and, after waiting till she fancied she heard the\nRabbit just under the window, she suddenly spread out her hand, and made a snatch in\nthe air. She did not get hold of anything, but she heard a little shriek and a fall, and a\ncrash of broken glass, from which she concluded that it was just possible it had fallen\ninto a cucumber-frame, or something of the sort.\nNext came an angry voice—the Rabbit’s—“Pat! Pat! Where are you?” And then a voice\nshe had never heard before, “Sure then I’m here! Digging for apples, yer honour!”\n“Digging for apples, indeed!” said the Rabbit angrily. “Here! Come and help me out of\nthis!” (Sounds of more broken glass.)\n“Now tell me, Pat, what’s that in the window?”\n“Sure, it’s an arm, yer honour!” (He pronounced it “arrum.”)\n“An arm, you goose! Who ever saw one that size? Why, it fills the whole window!”\n“Sure, it does, yer honour: but it’s an arm for all that.”\n“Well, it’s got no business there, at any rate: go and take it away!”\nThere was a long silence after this, and Alice could only hear whispers now and then;\nsuch as, “Sure, I don’t like it, yer honour, at all, at all!” “Do as I tell you, you coward!”\nand at last she spread out her hand again, and made another snatch in the air. This\ntime there were two little shrieks, and more sounds of broken glass. “What a number of\ncucumber-frames there must be!” thought Alice. “I wonder what they’ll do next! As for\npulling me out of the window, I only wish they could! I’m sure I don’t want to stay in\nhere any longer!”\nShe waited for some time without hearing anything more: at last came a rumbling of\nlittle cartwheels, and the sound of a good many voices all talking together: she made\nout the words: “Where’s the other ladder?—Why, I hadn’t to bring but one; Bill’s got\nthe other—Bill! fetch it here, lad!—Here, put ’em up at this corner—No, tie ’em together\nfirst—they don’t reach half high enough yet—Oh! they’ll do well enough; don’t be\nparticular—Here, Bill! catch hold of this rope—Will the roof bear?—Mind that loose\nslate—Oh, it’s coming down! Heads below!” (a loud crash)—“Now, who did that?—It\nwas Bill, I fancy—Who’s to go down the chimney?—Nay, I shan’t! You do it!—That I\nwon’t, then!—Bill’s to go down—Here, Bill! the master says you’re to go down the\nchimney!”\n“Oh! So Bill’s got to come down the chimney, has he?” said Alice to herself. “Shy, they\nseem to put everything upon Bill! I wouldn’t be in Bill’s place for a good deal: this\nfireplace is narrow, to be sure; but I think I can kick a little!”\nShe drew her foot as far down the chimney as she could, and waited till she heard a\nlittle animal (she couldn’t guess of what sort it was) scratching and scrambling about\nin the chimney close above her: then, saying to herself “This is Bill,” she gave one sharp\nkick, and waited to see what would happen next.\nThe first thing she heard was a general chorus of “There goes Bill!” then the Rabbit’s\nvoice along—“Catch him, you by the hedge!” then silence, and then another confusion\nof voices—“Hold up his head—Brandy now—Don’t choke him—How was it, old fellow?\nWhat happened to you? Tell us all about it!”\nLast came a little feeble, squeaking voice, (“That’s Bill,” thought Alice,) “Well, I\nhardly know—No more, thank ye; I’m better now—but I’m a deal too flustered to tell\nyou—all I know is, something comes at me like a Jack-in-the-box, and up I goes like a\nsky-rocket!”\n“So you did, old fellow!” said the others.\n“We must burn the house down!” said the Rabbit’s voice; and Alice called out as loud\nas she could, “If you do, I’ll set Dinah at you!”\nThere was a dead silence instantly, and Alice thought to herself, “I wonder what they\nwill do next! If they had any sense, they’d take the roof off.” After a minute or two, they\nbegan moving about again, and Alice heard the Rabbit say, “A barrowful will do, to\nbegin with.”\n“A barrowful of what?” thought Alice; but she had not long to doubt, for the next\nmoment a shower of little pebbles came rattling in at the window, and some of them\nhit her in the face. “I’ll put a stop to this,” she said to herself, and shouted out, “You’d\nbetter not do that again!” which produced another dead silence.\nAlice noticed with some surprise that the pebbles were all turning into little cakes as\nthey lay on the floor, and a bright idea came into her head. “If I eat one of these cakes,”\nshe thought, “it’s sure to make some change in my size; and as it can’t possibly make me\nlarger, it must make me smaller, I suppose.”\nSo she swallowed one of the cakes, and was delighted to find that she began\nshrinking directly. As soon as she was small enough to get through the door, she ran\nout of the house, and found quite a crowd of little animals and birds waiting outside.\nThe poor little Lizard, Bill, was in the middle, being held up by two guinea-pigs, who\nwere giving it something out of a bottle. They all made a rush at Alice the moment she\nappeared; but she ran off as hard as she could, and soon found herself safe in a thick\nwood.\n“The first thing I’ve got to do,” said Alice to herself, as she wandered about in the\nwood, “is to grow to my right size again; and the second thing is to find my way into\nthat lovely garden. I think that will be the best plan.”\nIt sounded an excellent plan, no doubt, and very neatly and simply arranged; the\nonly difficulty was, that she had not the smallest idea how to set about it; and while\nshe was peering about anxiously among the trees, a little sharp bark just over her head\nmade her look up in a great hurry.\nAn enormous puppy was looking down at her with large round eyes, and feebly\nstretching out one paw, trying to touch her. “Poor little thing!” said Alice, in a coaxing\ntone, and she tried hard to whistle to it; but she was terribly frightened all the time at\nthe thought that it might be hungry, in which case it would be very likely to eat her up\nin spite of all her coaxing.\nHardly knowing what she did, she picked up a little bit of stick, and held it out to the\npuppy; whereupon the puppy jumped into the air off all its feet at once, with a yelp of\ndelight, and rushed at the stick, and made believe to worry it; then Alice dodged behind\na great thistle, to keep herself from being run over; and the moment she appeared on\nthe other side, the puppy made another rush at the stick, and tumbled head over heels\nin its hurry to get hold of it; then Alice, thinking it was very like having a game of play\nwith a cart-horse, and expecting every moment to be trampled under its feet, ran\nround the thistle again; then the puppy began a series of short charges at the stick,\nrunning a very little way forwards each time and a long way back, and barking\nhoarsely all the while, till at last it sat down a good way off, panting, with its tongue\nhanging out of its mouth, and its great eyes half shut.\nThis seemed to Alice a good opportunity for making her escape; so she set off at once,\nand ran till she was quite tired and out of breath, and till the puppy’s bark sounded\nquite faint in the distance.\n“And yet what a dear little puppy it was!” said Alice, as she leant against a buttercup\nto rest herself, and fanned herself with one of the leaves: “I should have liked teaching\nit tricks very much, if—if I’d only been the right size to do it! Oh dear! I’d nearly\nforgotten that I’ve got to grow up again! Let me see—how is it to be managed? I suppose\nI ought to eat or drink something or other; but the great question is, what?”\nThe great question certainly was, what? Alice looked all round her at the flowers and\nthe blades of grass, but she did not see anything that looked like the right thing to eat\nor drink under the circumstances. There was a large mushroom growing near her,\nabout the same height as herself; and when she had looked under it, and on both sides\nof it, and behind it, it occurred to her that she might as well look and see what was on\nthe top of it.\nShe stretched herself up on tiptoe, and peeped over the edge of the mushroom, and\nher eyes immediately met those of a large blue caterpillar, that was sitting on the top\nwith its arms folded, quietly smoking a long hookah, and taking not the smallest notice\nof her or of anything else.\nCHAPTER V.\nAdvice from a Caterpillar\nThe Caterpillar and Alice looked at each other for some time in silence: at last the\nCaterpillar took the hookah out of its mouth, and addressed her in a languid, sleepy\nvoice.\n“Who are you?” said the Caterpillar.\nThis was not an encouraging opening for a conversation. Alice replied, rather shyly,\n“I—I hardly know, sir, just at present—at least I know who I was when I got up this\nmorning, but I think I must have been changed several times since then.”\n“What do you mean by that?” said the Caterpillar sternly. “Explain yourself!”\n“I can’t explain myself, I’m afraid, sir,” said Alice, “because I’m not myself, you see.”\n“I don’t see,” said the Caterpillar.\n“I’m afraid I can’t put it more clearly,” Alice replied very politely, “for I can’t\nunderstand it myself to begin with; and being so many different sizes in a day is very\nconfusing.”\n“It isn’t,” said the Caterpillar.\n“Well, perhaps you haven’t found it so yet,” said Alice; “but when you have to turn\ninto a chrysalis—you will some day, you know—and then after that into a butterfly, I\nshould think you’ll feel it a little queer, won’t you?”\n“Not a bit,” said the Caterpillar.\n“Well, perhaps your feelings may be different,” said Alice; “all I know is, it would feel\nvery queer to me.”\n“You!” said the Caterpillar contemptuously. “Who are you?”\nWhich brought them back again to the beginning of the conversation. Alice felt a\nlittle irritated at the Caterpillar’s making such very short remarks, and she drew herself\nup and said, very gravely, “I think, you ought to tell me who you are, first.”\n“Why?” said the Caterpillar.\nHere was another puzzling question; and as Alice could not think of any good reason,\nand as the Caterpillar seemed to be in a very unpleasant state of mind, she turned away.\n“Come back!” the Caterpillar called after her. “I’ve something important to say!”\nThis sounded promising, certainly: Alice turned and came back again.\n“Keep your temper,” said the Caterpillar.\n“Is that all?” said Alice, swallowing down her anger as well as she could.\n“No,” said the Caterpillar.\nAlice thought she might as well wait, as she had nothing else to do, and perhaps after\nall it might tell her something worth hearing. For some minutes it puffed away\nwithout speaking, but at last it unfolded its arms, took the hookah out of its mouth\nagain, and said, “So you think you’re changed, do you?”\n“I’m afraid I am, sir,” said Alice; “I can’t remember things as I used—and I don’t keep\nthe same size for ten minutes together!”\n“Can’t remember what things?” said the Caterpillar.\n“Well, I’ve tried to say “How doth the little busy bee,” but it all came different!” Alice\nreplied in a very melancholy voice.\n“Repeat, “You are old, Father William,’” said the Caterpillar.\nAlice folded her hands, and began:—\n“You are old, Father William,” the young man said,\n“And your hair has become very white;\nAnd yet you incessantly stand on your head—\nDo you think, at your age, it is right?”\n“In my youth,” Father William replied to his son,\n“I feared it might injure the brain;\nBut, now that I’m perfectly sure I have none,\nWhy, I do it again and again.”\n“You are old,” said the youth, “as I mentioned before,\nAnd have grown most uncommonly fat;\nYet you turned a back-somersault in at the door—\nPray, what is the reason of that?”\n“In my youth,” said the sage, as he shook his grey locks,\n“I kept all my limbs very supple\nBy the use of this ointment—one shilling the box—\nAllow me to sell you a couple?”\n“You are old,” said the youth, “and your jaws are too weak\nFor anything tougher than suet;\nYet you finished the goose, with the bones and the beak—\nPray, how did you manage to do it?”\n“In my youth,” said his father, “I took to the law,\nAnd argued each case with my wife;\nAnd the muscular strength, which it gave to my jaw,\nHas lasted the rest of my life.”\n“You are old,” said the youth, “one would hardly suppose\nThat your eye was as steady as ever;\nYet you balanced an eel on the end of your nose—\nWhat made you so awfully clever?”\n“I have answered three questions, and that is enough,”\nSaid his father; “don’t give yourself airs!\nDo you think I can listen all day to such stuff?\nBe off, or I’ll kick you down stairs!”\n“That is not said right,” said the Caterpillar.\n“Not quite right, I’m afraid,” said Alice, timidly; “some of the words have got altered.”\n“It is wrong from beginning to end,” said the Caterpillar decidedly, and there was\nsilence for some minutes.\nThe Caterpillar was the first to speak.\n“What size do you want to be?” it asked.\n“Oh, I’m not particular as to size,” Alice hastily replied; “only one doesn’t like\nchanging so often, you know.”\n“I don’t know,” said the Caterpillar.\nAlice said nothing: she had never been so much contradicted in her life before, and\nshe felt that she was losing her temper.\n“Are you content now?” said the Caterpillar.\n“Well, I should like to be a little larger, sir, if you wouldn’t mind,” said Alice: “three\ninches is such a wretched height to be.”\n“It is a very good height indeed!” said the Caterpillar angrily, rearing itself upright as\nit spoke (it was exactly three inches high).\n“But I’m not used to it!” pleaded poor Alice in a piteous tone. And she thought of\nherself, “I wish the creatures wouldn’t be so easily offended!”\n“You’ll get used to it in time,” said the Caterpillar; and it put the hookah into its\nmouth and began smoking again.\nThis time Alice waited patiently until it chose to speak again. In a minute or two the\nCaterpillar took the hookah out of its mouth and yawned once or twice, and shook\nitself. Then it got down off the mushroom, and crawled away in the grass, merely\nremarking as it went, “One side will make you grow taller, and the other side will make\nyou grow shorter.”\n“One side of what? The other side of what?” thought Alice to herself.\n“Of the mushroom,” said the Caterpillar, just as if she had asked it aloud; and in\nanother moment it was out of sight.\nAlice remained looking thoughtfully at the mushroom for a minute, trying to make\nout which were the two sides of it; and as it was perfectly round, she found this a very\ndifficult question. However, at last she stretched her arms round it as far as they would\ngo, and broke off a bit of the edge with each hand.\n“And now which is which?” she said to herself, and nibbled a little of the right-hand\nbit to try the effect: the next moment she felt a violent blow underneath her chin: it\nhad struck her foot!\nShe was a good deal frightened by this very sudden change, but she felt that there\nwas no time to be lost, as she was shrinking rapidly; so she set to work at once to eat\nsome of the other bit. Her chin was pressed so closely against her foot, that there was\nhardly room to open her mouth; but she did it at last, and managed to swallow a\nmorsel of the lefthand bit.\n* * * * * * *\n* * * * * *\n* * * * * * *\n“Come, my head’s free at last!” said Alice in a tone of delight, which changed into\nalarm in another moment, when she found that her shoulders were nowhere to be\nfound: all she could see, when she looked down, was an immense length of neck, which\nseemed to rise like a stalk out of a sea of green leaves that lay far below her.\n“What can all that green stuff be?” said Alice. “And where have my shoulders got to?\nAnd oh, my poor hands, how is it I can’t see you?” She was moving them about as she\nspoke, but no result seemed to follow, except a little shaking among the distant green\nleaves.\nAs there seemed to be no chance of getting her hands up to her head, she tried to get\nher head down to them, and was delighted to find that her neck would bend about\neasily in any direction, like a serpent. She had just succeeded in curving it down into a\ngraceful zigzag, and was going to dive in among the leaves, which she found to be\nnothing but the tops of the trees under which she had been wandering, when a sharp\nhiss made her draw back in a hurry: a large pigeon had flown into her face, and was\nbeating her violently with its wings.\n“Serpent!” screamed the Pigeon.\n“I’m not a serpent!” said Alice indignantly. “Let me alone!”\n“Serpent, I say again!” repeated the Pigeon, but in a more subdued tone, and added\nwith a kind of sob, “I’ve tried every way, and nothing seems to suit them!”\n“I haven’t the least idea what you’re talking about,” said Alice.\n“I’ve tried the roots of trees, and I’ve tried banks, and I’ve tried hedges,” the Pigeon\nwent on, without attending to her; “but those serpents! There’s no pleasing them!”\nAlice was more and more puzzled, but she thought there was no use in saying\nanything more till the Pigeon had finished.\n“As if it wasn’t trouble enough hatching the eggs,” said the Pigeon; “but I must be on\nthe look-out for serpents night and day! Why, I haven’t had a wink of sleep these three\nweeks!”\n“I’m very sorry you’ve been annoyed,” said Alice, who was beginning to see its\nmeaning.\n“And just as I’d taken the highest tree in the wood,” continued the Pigeon, raising its\nvoice to a shriek, “and just as I was thinking I should be free of them at last, they must\nneeds come wriggling down from the sky! Ugh, Serpent!”\n“But I’m not a serpent, I tell you!” said Alice. “I’m a—I’m a—”\n“Well! What are you?” said the Pigeon. “I can see you’re trying to invent something!”\n“I—I’m a little girl,” said Alice, rather doubtfully, as she remembered the number of\nchanges she had gone through that day.\n“A likely story indeed!” said the Pigeon in a tone of the deepest contempt. “I’ve seen a\ngood many little girls in my time, but never one with such a neck as that! No, no! You’re\na serpent; and there’s no use denying it. I suppose you’ll be telling me next that you\nnever tasted an egg!”\n“I have tasted eggs, certainly,” said Alice, who was a very truthful child; “but little\ngirls eat eggs quite as much as serpents do, you know.”\n“I don’t believe it,” said the Pigeon; “but if they do, why then they’re a kind of\nserpent, that’s all I can say.”\nThis was such a new idea to Alice, that she was quite silent for a minute or two,\nwhich gave the Pigeon the opportunity of adding, “You’re looking for eggs, I know that\nwell enough; and what does it matter to me whether you’re a little girl or a serpent?”\n“It matters a good deal to me,” said Alice hastily; “but I’m not looking for eggs, as it\nhappens; and if I was, I shouldn’t want yours: I don’t like them raw.”\n“Well, be off, then!” said the Pigeon in a sulky tone, as it settled down again into its\nnest. Alice crouched down among the trees as well as she could, for her neck kept\ngetting entangled among the branches, and every now and then she had to stop and\nuntwist it. After a while she remembered that she still held the pieces of mushroom in\nher hands, and she set to work very carefully, nibbling first at one and then at the\nother, and growing sometimes taller and sometimes shorter, until she had succeeded\nin bringing herself down to her usual height.\nIt was so long since she had been anything near the right size, that it felt quite\nstrange at first; but she got used to it in a few minutes, and began talking to herself, as\nusual. “Come, there’s half my plan done now! How puzzling all these changes are! I’m\nnever sure what I’m going to be, from one minute to another! However, I’ve got back to\nmy right size: the next thing is, to get into that beautiful garden—how is that to be\ndone, I wonder?” As she said this, she came suddenly upon an open place, with a little\nhouse in it about four feet high. “Whoever lives there,” thought Alice, “it’ll never do to\ncome upon them this size: why, I should frighten them out of their wits!” So she began\nnibbling at the righthand bit again, and did not venture to go near the house till she\nhad brought herself down to nine inches high.\nCHAPTER VI.\nPig and Pepper\nFor a minute or two she stood looking at the house, and wondering what to do next,\nwhen suddenly a footman in livery came running out of the wood—(she considered\nhim to be a footman because he was in livery: otherwise, judging by his face only, she\nwould have called him a fish)—and rapped loudly at the door with his knuckles. It was\nopened by another footman in livery, with a round face, and large eyes like a frog; and\nboth footmen, Alice noticed, had powdered hair that curled all over their heads. She\nfelt very curious to know what it was all about, and crept a little way out of the wood to\nlisten.\nThe Fish-Footman began by producing from under his arm a great letter, nearly as\nlarge as himself, and this he handed over to the other, saying, in a solemn tone, “For\nthe Duchess. An invitation from the Queen to play croquet.” The Frog-Footman\nrepeated, in the same solemn tone, only changing the order of the words a little, “From\nthe Queen. An invitation for the Duchess to play croquet.”\nThen they both bowed low, and their curls got entangled together.\nAlice laughed so much at this, that she had to run back into the wood for fear of their\nhearing her; and when she next peeped out the Fish-Footman was gone, and the other\nwas sitting on the ground near the door, staring stupidly up into the sky.\nAlice went timidly up to the door, and knocked.\n“There’s no sort of use in knocking,” said the Footman, “and that for two reasons.\nFirst, because I’m on the same side of the door as you are; secondly, because they’re\nmaking such a noise inside, no one could possibly hear you.” And certainly there was a\nmost extraordinary noise going on within—a constant howling and sneezing, and\nevery now and then a great crash, as if a dish or kettle had been broken to pieces.\n“Please, then,” said Alice, “how am I to get in?”\n“There might be some sense in your knocking,” the Footman went on without\nattending to her, “if we had the door between us. For instance, if you were inside, you\nmight knock, and I could let you out, you know.” He was looking up into the sky all the\ntime he was speaking, and this Alice thought decidedly uncivil. “But perhaps he can’t\nhelp it,” she said to herself; “his eyes are so very nearly at the top of his head. But at any\nrate he might answer questions.—How am I to get in?” she repeated, aloud.\n“I shall sit here,” the Footman remarked, “till tomorrow—”\nAt this moment the door of the house opened, and a large plate came skimming out,\nstraight at the Footman’s head: it just grazed his nose, and broke to pieces against one\nof the trees behind him.\n“—or next day, maybe,” the Footman continued in the same tone, exactly as if\nnothing had happened.\n“How am I to get in?” asked Alice again, in a louder tone.\n“Are you to get in at all?” said the Footman. “That’s the first question, you know.”\nIt was, no doubt: only Alice did not like to be told so. “It’s really dreadful,” she\nmuttered to herself, “the way all the creatures argue. It’s enough to drive one crazy!”\nThe Footman seemed to think this a good opportunity for repeating his remark, with\nvariations. “I shall sit here,” he said, “on and off, for days and days.”\n“But what am I to do?” said Alice.\n“Anything you like,” said the Footman, and began whistling.\n“Oh, there’s no use in talking to him,” said Alice desperately: “he’s perfectly idiotic!”\nAnd she opened the door and went in.\nThe door led right into a large kitchen, which was full of smoke from one end to the\nother: the Duchess was sitting on a three-legged stool in the middle, nursing a baby;\nthe cook was leaning over the fire, stirring a large cauldron which seemed to be full of\nsoup.\n“There’s certainly too much pepper in that soup!” Alice said to herself, as well as she\ncould for sneezing.\nThere was certainly too much of it in the air. Even the Duchess sneezed occasionally;\nand as for the baby, it was sneezing and howling alternately without a moment’s\npause. The only things in the kitchen that did not sneeze, were the cook, and a large cat\nwhich was sitting on the hearth and grinning from ear to ear.\n“Please would you tell me,” said Alice, a little timidly, for she was not quite sure\nwhether it was good manners for her to speak first, “why your cat grins like that?”\n“It’s a Cheshire cat,” said the Duchess, “and that’s why. Pig!”\nShe said the last word with such sudden violence that Alice quite jumped; but she\nsaw in another moment that it was addressed to the baby, and not to her, so she took\ncourage, and went on again:—\n“I didn’t know that Cheshire cats always grinned; in fact, I didn’t know that cats\ncould grin.”\n“They all can,” said the Duchess; “and most of ’em do.”\n“I don’t know of any that do,” Alice said very politely, feeling quite pleased to have\ngot into a conversation.\n“You don’t know much,” said the Duchess; “and that’s a fact.”\nAlice did not at all like the tone of this remark, and thought it would be as well to\nintroduce some other subject of conversation. While she was trying to fix on one, the\ncook took the cauldron of soup off the fire, and at once set to work throwing\neverything within her reach at the Duchess and the baby—the fire-irons came first;\nthen followed a shower of saucepans, plates, and dishes. The Duchess took no notice of\nthem even when they hit her; and the baby was howling so much already, that it was\nquite impossible to say whether the blows hurt it or not.\n“Oh, please mind what you’re doing!” cried Alice, jumping up and down in an agony\nof terror. “Oh, there goes his precious nose!” as an unusually large saucepan flew close\nby it, and very nearly carried it off.\n“If everybody minded their own business,” the Duchess said in a hoarse growl, “the\nworld would go round a deal faster than it does.”\n“Which would not be an advantage,” said Alice, who felt very glad to get an\nopportunity of showing off a little of her knowledge. “Just think of what work it would\nmake with the day and night! You see the earth takes twenty-four hours to turn round\non its axis—”\n“Talking of axes,” said the Duchess, “chop off her head!”\nAlice glanced rather anxiously at the cook, to see if she meant to take the hint; but\nthe cook was busily stirring the soup, and seemed not to be listening, so she went on\nagain: “Twenty-four hours, I think; or is it twelve? I—”\n“Oh, don’t bother me,” said the Duchess; “I never could abide figures!” And with that\nshe began nursing her child again, singing a sort of lullaby to it as she did so, and\ngiving it a violent shake at the end of every line:\n“Speak roughly to your little boy,\nAnd beat him when he sneezes:\nHe only does it to annoy,\nBecause he knows it teases.”\nCHORUS.\n(In which the cook and the baby joined):\n“Wow! wow! wow!”\nWhile the Duchess sang the second verse of the song, she kept tossing the baby\nviolently up and down, and the poor little thing howled so, that Alice could hardly hear\nthe words:—\n“I speak severely to my boy,\nI beat him when he sneezes;\nFor he can thoroughly enjoy\nThe pepper when he pleases!”\nCHORUS.\n“Wow! wow! wow!”\n“Here! you may nurse it a bit, if you like!” the Duchess said to Alice, flinging the baby\nat her as she spoke. “I must go and get ready to play croquet with the Queen,” and she\nhurried out of the room. The cook threw a frying-pan after her as she went out, but it\njust missed her.\nAlice caught the baby with some difficulty, as it was a queer-shaped little creature,\nand held out its arms and legs in all directions, “just like a star-fish,” thought Alice. The\npoor little thing was snorting like a steam-engine when she caught it, and kept\ndoubling itself up and straightening itself out again, so that altogether, for the first\nminute or two, it was as much as she could do to hold it.\nAs soon as she had made out the proper way of nursing it, (which was to twist it up\ninto a sort of knot, and then keep tight hold of its right ear and left foot, so as to\nprevent its undoing itself,) she carried it out into the open air. “If I don’t take this child\naway with me,” thought Alice, “they’re sure to kill it in a day or two: wouldn’t it be\nmurder to leave it behind?” She said the last words out loud, and the little thing\ngrunted in reply (it had left off sneezing by this time). “Don’t grunt,” said Alice; “that’s\nnot at all a proper way of expressing yourself.”\nThe baby grunted again, and Alice looked very anxiously into its face to see what\nwas the matter with it. There could be no doubt that it had a very turn-up nose, much\nmore like a snout than a real nose; also its eyes were getting extremely small for a baby:\naltogether Alice did not like the look of the thing at all. “But perhaps it was only\nsobbing,” she thought, and looked into its eyes again, to see if there were any tears.\nNo, there were no tears. “If you’re going to turn into a pig, my dear,” said Alice,\nseriously, “I’ll have nothing more to do with you. Mind now!” The poor little thing\nsobbed again (or grunted, it was impossible to say which), and they went on for some\nwhile in silence.\nAlice was just beginning to think to herself, “Now, what am I to do with this creature\nwhen I get it home?” when it grunted again, so violently, that she looked down into its\nface in some alarm. This time there could be no mistake about it: it was neither more\nnor less than a pig, and she felt that it would be quite absurd for her to carry it further.\nSo she set the little creature down, and felt quite relieved to see it trot away quietly\ninto the wood. “If it had grown up,” she said to herself, “it would have made a\ndreadfully ugly child: but it makes rather a handsome pig, I think.” And she began\nthinking over other children she knew, who might do very well as pigs, and was just\nsaying to herself, “if one only knew the right way to change them—” when she was a\nlittle startled by seeing the Cheshire Cat sitting on a bough of a tree a few yards off.\nThe Cat only grinned when it saw Alice. It looked good-natured, she thought: still it\nhad very long claws and a great many teeth, so she felt that it ought to be treated with\nrespect.\n“Cheshire Puss,” she began, rather timidly, as she did not at all know whether it\nwould like the name: however, it only grinned a little wider. “Come, it’s pleased so far,”\nthought Alice, and she went on. “Would you tell me, please, which way I ought to go\nfrom here?”\n“That depends a good deal on where you want to get to,” said the Cat.\n“I don’t much care where—” said Alice.\n“Then it doesn’t matter which way you go,” said the Cat.\n“—so long as I get somewhere,” Alice added as an explanation.\n“Oh, you’re sure to do that,” said the Cat, “if you only walk long enough.”\nAlice felt that this could not be denied, so she tried another question. “What sort of\npeople live about here?”\n“In that direction,” the Cat said, waving its right paw round, “lives a Hatter: and in\nthat direction,” waving the other paw, “lives a March Hare. Visit either you like: they’re\nboth mad.”\n“But I don’t want to go among mad people,” Alice remarked.\n“Oh, you can’t help that,” said the Cat: “we’re all mad here. I’m mad. You’re mad.”\n“How do you know I’m mad?” said Alice.\n“You must be,” said the Cat, “or you wouldn’t have come here.”\nAlice didn’t think that proved it at all; however, she went on “And how do you know\nthat you’re mad?”\n“To begin with,” said the Cat, “a dog’s not mad. You grant that?”\n“I suppose so,” said Alice.\n“Well, then,” the Cat went on, “you see, a dog growls when it’s angry, and wags its\ntail when it’s pleased. Now I growl when I’m pleased, and wag my tail when I’m angry.\nTherefore I’m mad.”\n“I call it purring, not growling,” said Alice.\n“Call it what you like,” said the Cat. “Do you play croquet with the Queen to-day?”\n“I should like it very much,” said Alice, “but I haven’t been invited yet.”\n“You’ll see me there,” said the Cat, and vanished.\nAlice was not much surprised at this, she was getting so used to queer things\nhappening. While she was looking at the place where it had been, it suddenly appeared\nagain.\n“By-the-bye, what became of the baby?” said the Cat. “I’d nearly forgotten to ask.”\n“It turned into a pig,” Alice quietly said, just as if it had come back in a natural way.\n“I thought it would,” said the Cat, and vanished again.\nAlice waited a little, half expecting to see it again, but it did not appear, and after a\nminute or two she walked on in the direction in which the March Hare was said to live.\n“I’ve seen hatters before,” she said to herself; “the March Hare will be much the most\ninteresting, and perhaps as this is May it won’t be raving mad—at least not so mad as it\nwas in March.” As she said this, she looked up, and there was the Cat again, sitting on a\nbranch of a tree.\n“Did you say pig, or fig?” said the Cat.\n“I said pig,” replied Alice; “and I wish you wouldn’t keep appearing and vanishing so\nsuddenly: you make one quite giddy.”\n“All right,” said the Cat; and this time it vanished quite slowly, beginning with the\nend of the tail, and ending with the grin, which remained some time after the rest of it\nhad gone.\n“Well! I’ve often seen a cat without a grin,” thought Alice; “but a grin without a cat!\nIt’s the most curious thing I ever saw in my life!”\nShe had not gone much farther before she came in sight of the house of the March\nHare: she thought it must be the right house, because the chimneys were shaped like\nears and the roof was thatched with fur. It was so large a house, that she did not like to\ngo nearer till she had nibbled some more of the lefthand bit of mushroom, and raised\nherself to about two feet high: even then she walked up towards it rather timidly,\nsaying to herself “Suppose it should be raving mad after all! I almost wish I’d gone to\nsee the Hatter instead!”\nCHAPTER VII.\nA Mad Tea-Party\nThere was a table set out under a tree in front of the house, and the March Hare and\nthe Hatter were having tea at it: a Dormouse was sitting between them, fast asleep, and\nthe other two were using it as a cushion, resting their elbows on it, and talking over its\nhead. “Very uncomfortable for the Dormouse,” thought Alice; “only, as it’s asleep, I\nsuppose it doesn’t mind.”\nThe table was a large one, but the three were all crowded together at one corner of it:\n“No room! No room!” they cried out when they saw Alice coming. “There’s plenty of\nroom!” said Alice indignantly, and she sat down in a large arm-chair at one end of the\ntable.\n“Have some wine,” the March Hare said in an encouraging tone.\nAlice looked all round the table, but there was nothing on it but tea. “I don’t see any\nwine,” she remarked.\n“There isn’t any,” said the March Hare.\n“Then it wasn’t very civil of you to offer it,” said Alice angrily.\n“It wasn’t very civil of you to sit down without being invited,” said the March Hare.\n“I didn’t know it was your table,” said Alice; “it’s laid for a great many more than\nthree.”\n“Your hair wants cutting,” said the Hatter. He had been looking at Alice for some\ntime with great curiosity, and this was his first speech.\n“You should learn not to make personal remarks,” Alice said with some severity; “it’s\nvery rude.”\nThe Hatter opened his eyes very wide on hearing this; but all he said was, “Why is a\nraven like a writing-desk?”\n“Come, we shall have some fun now!” thought Alice. “I’m glad they’ve begun asking\nriddles.—I believe I can guess that,” she added aloud.\n“Do you mean that you think you can find out the answer to it?” said the March Hare.\n“Exactly so,” said Alice.\n“Then you should say what you mean,” the March Hare went on.\n“I do,” Alice hastily replied; “at least—at least I mean what I say—that’s the same\nthing, you know.”\n“Not the same thing a bit!” said the Hatter. “You might just as well say that ‘I see\nwhat I eat’ is the same thing as ‘I eat what I see’!”\n“You might just as well say,” added the March Hare, “that ‘I like what I get’ is the\nsame thing as ‘I get what I like’!”\n“You might just as well say,” added the Dormouse, who seemed to be talking in his\nsleep, “that ‘I breathe when I sleep’ is the same thing as ‘I sleep when I breathe’!”\n“It is the same thing with you,” said the Hatter, and here the conversation dropped,\nand the party sat silent for a minute, while Alice thought over all she could remember\nabout ravens and writing-desks, which wasn’t much.\nThe Hatter was the first to break the silence. “What day of the month is it?” he said,\nturning to Alice: he had taken his watch out of his pocket, and was looking at it\nuneasily, shaking it every now and then, and holding it to his ear.\nAlice considered a little, and then said “The fourth.”\n“Two days wrong!” sighed the Hatter. “I told you butter wouldn’t suit the works!” he\nadded looking angrily at the March Hare.\n“It was the best butter,” the March Hare meekly replied.\n“Yes, but some crumbs must have got in as well,” the Hatter grumbled: “you\nshouldn’t have put it in with the bread-knife.”\nThe March Hare took the watch and looked at it gloomily: then he dipped it into his\ncup of tea, and looked at it again: but he could think of nothing better to say than his\nfirst remark, “It was the best butter, you know.”\nAlice had been looking over his shoulder with some curiosity. “What a funny\nwatch!” she remarked. “It tells the day of the month, and doesn’t tell what o’clock it is!”\n“Why should it?” muttered the Hatter. “Does your watch tell you what year it is?”\n“Of course not,” Alice replied very readily: “but that’s because it stays the same year\nfor such a long time together.”\n“Which is just the case with mine,” said the Hatter.\nAlice felt dreadfully puzzled. The Hatter’s remark seemed to have no sort of meaning\nin it, and yet it was certainly English. “I don’t quite understand you,” she said, as\npolitely as she could.\n“The Dormouse is asleep again,” said the Hatter, and he poured a little hot tea upon\nits nose.\nThe Dormouse shook its head impatiently, and said, without opening its eyes, “Of\ncourse, of course; just what I was going to remark myself.”\n“Have you guessed the riddle yet?” the Hatter said, turning to Alice again.\n“No, I give it up,” Alice replied: “what’s the answer?”\n“I haven’t the slightest idea,” said the Hatter.\n“Nor I,” said the March Hare.\nAlice sighed wearily. “I think you might do something better with the time,” she\nsaid, “than waste it in asking riddles that have no answers.”\n“If you knew Time as well as I do,” said the Hatter, “you wouldn’t talk about wasting\nit. It’s him.”\n“I don’t know what you mean,” said Alice.\n“Of course you don’t!” the Hatter said, tossing his head contemptuously. “I dare say\nyou never even spoke to Time!”\n“Perhaps not,” Alice cautiously replied: “but I know I have to beat time when I learn\nmusic.”\n“Ah! that accounts for it,” said the Hatter. “He won’t stand beating. Now, if you only\nkept on good terms with him, he’d do almost anything you liked with the clock. For\ninstance, suppose it were nine o’clock in the morning, just time to begin lessons: you’d\nonly have to whisper a hint to Time, and round goes the clock in a twinkling! Half-past\none, time for dinner!”\n(“I only wish it was,” the March Hare said to itself in a whisper.)\n“That would be grand, certainly,” said Alice thoughtfully: “but then—I shouldn’t be\nhungry for it, you know.”\n“Not at first, perhaps,” said the Hatter: “but you could keep it to half-past one as long\nas you liked.”\n“Is that the way you manage?” Alice asked.\nThe Hatter shook his head mournfully. “Not I!” he replied. “We quarrelled last March\n—just before he went mad, you know—” (pointing with his tea spoon at the March\nHare,) “—it was at the great concert given by the Queen of Hearts, and I had to sing\n‘Twinkle, twinkle, little bat!\nHow I wonder what you’re at!’\nYou know the song, perhaps?”\n“I’ve heard something like it,” said Alice.\n“It goes on, you know,” the Hatter continued, “in this way:—\n‘Up above the world you fly,\nLike a tea-tray in the sky.\nTwinkle, twinkle—’”\nHere the Dormouse shook itself, and began singing in its sleep “Twinkle, twinkle,\ntwinkle, twinkle—” and went on so long that they had to pinch it to make it stop.\n“Well, I’d hardly finished the first verse,” said the Hatter, “when the Queen jumped\nup and bawled out, ‘He’s murdering the time! Off with his head!’”\n“How dreadfully savage!” exclaimed Alice.\n“And ever since that,” the Hatter went on in a mournful tone, “he won’t do a thing I\nask! It’s always six o’clock now.”\nA bright idea came into Alice’s head. “Is that the reason so many tea-things are put\nout here?” she asked.\n“Yes, that’s it,” said the Hatter with a sigh: “it’s always tea-time, and we’ve no time to\nwash the things between whiles.”\n“Then you keep moving round, I suppose?” said Alice.\n“Exactly so,” said the Hatter: “as the things get used up.”\n“But what happens when you come to the beginning again?” Alice ventured to ask.\n“Suppose we change the subject,” the March Hare interrupted, yawning. “I’m getting\ntired of this. I vote the young lady tells us a story.”\n“I’m afraid I don’t know one,” said Alice, rather alarmed at the proposal.\n“Then the Dormouse shall!” they both cried. “Wake up, Dormouse!” And they\npinched it on both sides at once.\nThe Dormouse slowly opened his eyes. “I wasn’t asleep,” he said in a hoarse, feeble\nvoice: “I heard every word you fellows were saying.”\n“Tell us a story!” said the March Hare.\n“Yes, please do!” pleaded Alice.\n“And be quick about it,” added the Hatter, “or you’ll be asleep again before it’s done.”\n“Once upon a time there were three little sisters,” the Dormouse began in a great\nhurry; “and their names were Elsie, Lacie, and Tillie; and they lived at the bottom of a\nwell—”\n“What did they live on?” said Alice, who always took a great interest in questions of\neating and drinking.\n“They lived on treacle,” said the Dormouse, after thinking a minute or two.\n“They couldn’t have done that, you know,” Alice gently remarked; “they’d have been\nill.”\n“So they were,” said the Dormouse; “very ill.”\nAlice tried to fancy to herself what such an extraordinary ways of living would be\nlike, but it puzzled her too much, so she went on: “But why did they live at the bottom\nof a well?”\n“Take some more tea,” the March Hare said to Alice, very earnestly.\n“I’ve had nothing yet,” Alice replied in an offended tone, “so I can’t take more.”\n“You mean you can’t take less,” said the Hatter: “it’s very easy to take more than\nnothing.”\n“Nobody asked your opinion,” said Alice.\n“Who’s making personal remarks now?” the Hatter asked triumphantly.\nAlice did not quite know what to say to this: so she helped herself to some tea and\nbread-and-butter, and then turned to the Dormouse, and repeated her question. “Why\ndid they live at the bottom of a well?”\nThe Dormouse again took a minute or two to think about it, and then said, “It was a\ntreacle-well.”\n“There’s no such thing!” Alice was beginning very angrily, but the Hatter and the\nMarch Hare went “Sh! sh!” and the Dormouse sulkily remarked, “If you can’t be civil,\nyou’d better finish the story for yourself.”\n“No, please go on!” Alice said very humbly; “I won’t interrupt again. I dare say there\nmay be one.”\n“One, indeed!” said the Dormouse indignantly. However, he consented to go on. “And\nso these three little sisters—they were learning to draw, you know—”\n“What did they draw?” said Alice, quite forgetting her promise.\n“Treacle,” said the Dormouse, without considering at all this time.\n“I want a clean cup,” interrupted the Hatter: “let’s all move one place on.”\nHe moved on as he spoke, and the Dormouse followed him: the March Hare moved\ninto the Dormouse’s place, and Alice rather unwillingly took the place of the March\nHare. The Hatter was the only one who got any advantage from the change: and Alice\nwas a good deal worse off than before, as the March Hare had just upset the milk-jug\ninto his plate.\nAlice did not wish to offend the Dormouse again, so she began very cautiously: “But I\ndon’t understand. Where did they draw the treacle from?”\n“You can draw water out of a water-well,” said the Hatter; “so I should think you\ncould draw treacle out of a treacle-well—eh, stupid?”\n“But they were in the well,” Alice said to the Dormouse, not choosing to notice this\nlast remark.\n“Of course they were,” said the Dormouse; “—well in.”\nThis answer so confused poor Alice, that she let the Dormouse go on for some time\nwithout interrupting it.\n“They were learning to draw,” the Dormouse went on, yawning and rubbing its eyes,\nfor it was getting very sleepy; “and they drew all manner of things—everything that\nbegins with an M—”\n“Why with an M?” said Alice.\n“Why not?” said the March Hare.\nAlice was silent.\nThe Dormouse had closed its eyes by this time, and was going off into a doze; but, on\nbeing pinched by the Hatter, it woke up again with a little shriek, and went on: “—that\nbegins with an M, such as mouse-traps, and the moon, and memory, and muchness—\nyou know you say things are “much of a muchness”—did you ever see such a thing as a\ndrawing of a muchness?”\n“Really, now you ask me,” said Alice, very much confused, “I don’t think—”\n“Then you shouldn’t talk,” said the Hatter.\nThis piece of rudeness was more than Alice could bear: she got up in great disgust,\nand walked off; the Dormouse fell asleep instantly, and neither of the others took the\nleast notice of her going, though she looked back once or twice, half hoping that they\nwould call after her: the last time she saw them, they were trying to put the Dormouse\ninto the teapot.\n“At any rate I’ll never go there again!” said Alice as she picked her way through the\nwood. “It’s the stupidest tea-party I ever was at in all my life!”\nJust as she said this, she noticed that one of the trees had a door leading right into it.\n“That’s very curious!” she thought. “But everything’s curious today. I think I may as\nwell go in at once.” And in she went.\nOnce more she found herself in the long hall, and close to the little glass table. “Now,\nI’ll manage better this time,” she said to herself, and began by taking the little golden\nkey, and unlocking the door that led into the garden. Then she went to work nibbling\nat the mushroom (she had kept a piece of it in her pocket) till she was about a foot high:\nthen she walked down the little passage: and then—she found herself at last in the\nbeautiful garden, among the bright flower-beds and the cool fountains.\nCHAPTER VIII.\nThe Queen’s Croquet-Ground\nA large rose-tree stood near the entrance of the garden: the roses growing on it were\nwhite, but there were three gardeners at it, busily painting them red. Alice thought this\na very curious thing, and she went nearer to watch them, and just as she came up to\nthem she heard one of them say, “Look out now, Five! Don’t go splashing paint over me\nlike that!”\n“I couldn’t help it,” said Five, in a sulky tone; “Seven jogged my elbow.”\nOn which Seven looked up and said, “That’s right, Five! Always lay the blame on\nothers!”\n“You’d better not talk!” said Five. “I heard the Queen say only yesterday you deserved\nto be beheaded!”\n“What for?” said the one who had spoken first.\n“That’s none of your business, Two!” said Seven.\n“Yes, it is his business!” said Five, “and I’ll tell him—it was for bringing the cook\ntulip-roots instead of onions.”\nSeven flung down his brush, and had just begun “Well, of all the unjust things—”\nwhen his eye chanced to fall upon Alice, as she stood watching them, and he checked\nhimself suddenly: the others looked round also, and all of them bowed low.\n“Would you tell me,” said Alice, a little timidly, “why you are painting those roses?”\nFive and Seven said nothing, but looked at Two. Two began in a low voice, “Why the\nfact is, you see, Miss, this here ought to have been a red rose-tree, and we put a white\none in by mistake; and if the Queen was to find it out, we should all have our heads cut\noff, you know. So you see, Miss, we’re doing our best, afore she comes, to—” At this\nmoment Five, who had been anxiously looking across the garden, called out “The\nQueen! The Queen!” and the three gardeners instantly threw themselves flat upon\ntheir faces. There was a sound of many footsteps, and Alice looked round, eager to see\nthe Queen.\nFirst came ten soldiers carrying clubs; these were all shaped like the three gardeners,\noblong and flat, with their hands and feet at the corners: next the ten courtiers; these\nwere ornamented all over with diamonds, and walked two and two, as the soldiers did.\nAfter these came the royal children; there were ten of them, and the little dears came\njumping merrily along hand in hand, in couples: they were all ornamented with hearts.\nNext came the guests, mostly Kings and Queens, and among them Alice recognised the\nWhite Rabbit: it was talking in a hurried nervous manner, smiling at everything that\nwas said, and went by without noticing her. Then followed the Knave of Hearts,\ncarrying the King’s crown on a crimson velvet cushion; and, last of all this grand\nprocession, came THE KING AND QUEEN OF HEARTS.\nAlice was rather doubtful whether she ought not to lie down on her face like the\nthree gardeners, but she could not remember ever having heard of such a rule at\nprocessions; “and besides, what would be the use of a procession,” thought she, “if\npeople had all to lie down upon their faces, so that they couldn’t see it?” So she stood\nstill where she was, and waited.\nWhen the procession came opposite to Alice, they all stopped and looked at her, and\nthe Queen said severely “Who is this?” She said it to the Knave of Hearts, who only\nbowed and smiled in reply.\n“Idiot!” said the Queen, tossing her head impatiently; and, turning to Alice, she went\non, “What’s your name, child?”\n“My name is Alice, so please your Majesty,” said Alice very politely; but she added, to\nherself, “Why, they’re only a pack of cards, after all. I needn’t be afraid of them!”\n“And who are these?” said the Queen, pointing to the three gardeners who were lying\nround the rose-tree; for, you see, as they were lying on their faces, and the pattern on\ntheir backs was the same as the rest of the pack, she could not tell whether they were\ngardeners, or soldiers, or courtiers, or three of her own children.\n“How should I know?” said Alice, surprised at her own courage. “It’s no business of\nmine.”\nThe Queen turned crimson with fury, and, after glaring at her for a moment like a\nwild beast, screamed “Off with her head! Off—”\n“Nonsense!” said Alice, very loudly and decidedly, and the Queen was silent.\nThe King laid his hand upon her arm, and timidly said “Consider, my dear: she is\nonly a child!”\nThe Queen turned angrily away from him, and said to the Knave “Turn them over!”\nThe Knave did so, very carefully, with one foot.\n“Get up!” said the Queen, in a shrill, loud voice, and the three gardeners instantly\njumped up, and began bowing to the King, the Queen, the royal children, and\neverybody else.\n“Leave off that!” screamed the Queen. “You make me giddy.” And then, turning to\nthe rose-tree, she went on, “What have you been doing here?”\n“May it please your Majesty,” said Two, in a very humble tone, going down on one\nknee as he spoke, “we were trying—”\n“I see!” said the Queen, who had meanwhile been examining the roses. “Off with\ntheir heads!” and the procession moved on, three of the soldiers remaining behind to\nexecute the unfortunate gardeners, who ran to Alice for protection.\n“You shan’t be beheaded!” said Alice, and she put them into a large flower-pot that\nstood near. The three soldiers wandered about for a minute or two, looking for them,\nand then quietly marched off after the others.\n“Are their heads off?” shouted the Queen.\n“Their heads are gone, if it please your Majesty!” the soldiers shouted in reply.\n“That’s right!” shouted the Queen. “Can you play croquet?”\nThe soldiers were silent, and looked at Alice, as the question was evidently meant for\nher.\n“Yes!” shouted Alice.\n“Come on, then!” roared the Queen, and Alice joined the procession, wondering very\nmuch what would happen next.\n“It’s—it’s a very fine day!” said a timid voice at her side. She was walking by the\nWhite Rabbit, who was peeping anxiously into her face.\n“Very,” said Alice: “—where’s the Duchess?”\n“Hush! Hush!” said the Rabbit in a low, hurried tone. He looked anxiously over his\nshoulder as he spoke, and then raised himself upon tiptoe, put his mouth close to her\near, and whispered “She’s under sentence of execution.”\n“What for?” said Alice.\n“Did you say ‘What a pity!’?” the Rabbit asked.\n“No, I didn’t,” said Alice: “I don’t think it’s at all a pity. I said ‘What for?’”\n“She boxed the Queen’s ears—” the Rabbit began. Alice gave a little scream of\nlaughter. “Oh, hush!” the Rabbit whispered in a frightened tone. “The Queen will hear\nyou! You see, she came rather late, and the Queen said—”\n“Get to your places!” shouted the Queen in a voice of thunder, and people began\nrunning about in all directions, tumbling up against each other; however, they got\nsettled down in a minute or two, and the game began. Alice thought she had never seen\nsuch a curious croquet-ground in her life; it was all ridges and furrows; the balls were\nlive hedgehogs, the mallets live flamingoes, and the soldiers had to double themselves\nup and to stand on their hands and feet, to make the arches.\nThe chief difficulty Alice found at first was in managing her flamingo: she succeeded\nin getting its body tucked away, comfortably enough, under her arm, with its legs\nhanging down, but generally, just as she had got its neck nicely straightened out, and\nwas going to give the hedgehog a blow with its head, it would twist itself round and\nlook up in her face, with such a puzzled expression that she could not help bursting out\nlaughing: and when she had got its head down, and was going to begin again, it was\nvery provoking to find that the hedgehog had unrolled itself, and was in the act of\ncrawling away: besides all this, there was generally a ridge or furrow in the way\nwherever she wanted to send the hedgehog to, and, as the doubled-up soldiers were\nalways getting up and walking off to other parts of the ground, Alice soon came to the\nconclusion that it was a very difficult game indeed.\nThe players all played at once without waiting for turns, quarrelling all the while,\nand fighting for the hedgehogs; and in a very short time the Queen was in a furious\npassion, and went stamping about, and shouting “Off with his head!” or “Off with her\nhead!” about once in a minute.\nAlice began to feel very uneasy: to be sure, she had not as yet had any dispute with\nthe Queen, but she knew that it might happen any minute, “and then,” thought she,\n“what would become of me? They’re dreadfully fond of beheading people here; the\ngreat wonder is, that there’s any one left alive!”\nShe was looking about for some way of escape, and wondering whether she could get\naway without being seen, when she noticed a curious appearance in the air: it puzzled\nher very much at first, but, after watching it a minute or two, she made it out to be a\ngrin, and she said to herself “It’s the Cheshire Cat: now I shall have somebody to talk\nto.”\n“How are you getting on?” said the Cat, as soon as there was mouth enough for it to\nspeak with.\nAlice waited till the eyes appeared, and then nodded. “It’s no use speaking to it,” she\nthought, “till its ears have come, or at least one of them.” In another minute the whole\nhead appeared, and then Alice put down her flamingo, and began an account of the\ngame, feeling very glad she had someone to listen to her. The Cat seemed to think that\nthere was enough of it now in sight, and no more of it appeared.\n“I don’t think they play at all fairly,” Alice began, in rather a complaining tone, “and\nthey all quarrel so dreadfully one can’t hear oneself speak—and they don’t seem to\nhave any rules in particular; at least, if there are, nobody attends to them—and you’ve\nno idea how confusing it is all the things being alive; for instance, there’s the arch I’ve\ngot to go through next walking about at the other end of the ground—and I should\nhave croqueted the Queen’s hedgehog just now, only it ran away when it saw mine\ncoming!”\n“How do you like the Queen?” said the Cat in a low voice.\n“Not at all,” said Alice: “she’s so extremely—” Just then she noticed that the Queen\nwas close behind her, listening: so she went on, “—likely to win, that it’s hardly worth\nwhile finishing the game.”\nThe Queen smiled and passed on.\n“Who are you talking to?” said the King, going up to Alice, and looking at the Cat’s\nhead with great curiosity.\n“It’s a friend of mine—a Cheshire Cat,” said Alice: “allow me to introduce it.”\n“I don’t like the look of it at all,” said the King: “however, it may kiss my hand if it\nlikes.”\n“I’d rather not,” the Cat remarked.\n“Don’t be impertinent,” said the King, “and don’t look at me like that!” He got behind\nAlice as he spoke.\n“A cat may look at a king,” said Alice. “I’ve read that in some book, but I don’t\nremember where.”\n“Well, it must be removed,” said the King very decidedly, and he called the Queen,\nwho was passing at the moment, “My dear! I wish you would have this cat removed!”\nThe Queen had only one way of settling all difficulties, great or small. “Off with his\nhead!” she said, without even looking round.\n“I’ll fetch the executioner myself,” said the King eagerly, and he hurried off.\nAlice thought she might as well go back, and see how the game was going on, as she\nheard the Queen’s voice in the distance, screaming with passion. She had already heard\nher sentence three of the players to be executed for having missed their turns, and she\ndid not like the look of things at all, as the game was in such confusion that she never\nknew whether it was her turn or not. So she went in search of her hedgehog.\nThe hedgehog was engaged in a fight with another hedgehog, which seemed to Alice\nan excellent opportunity for croqueting one of them with the other: the only difficulty\nwas, that her flamingo was gone across to the other side of the garden, where Alice\ncould see it trying in a helpless sort of way to fly up into a tree.\nBy the time she had caught the flamingo and brought it back, the fight was over, and\nboth the hedgehogs were out of sight: “but it doesn’t matter much,” thought Alice, “as\nall the arches are gone from this side of the ground.” So she tucked it away under her\narm, that it might not escape again, and went back for a little more conversation with\nher friend.\nWhen she got back to the Cheshire Cat, she was surprised to find quite a large crowd\ncollected round it: there was a dispute going on between the executioner, the King, and\nthe Queen, who were all talking at once, while all the rest were quite silent, and looked\nvery uncomfortable.\nThe moment Alice appeared, she was appealed to by all three to settle the question,\nand they repeated their arguments to her, though, as they all spoke at once, she found\nit very hard indeed to make out exactly what they said.\nThe executioner’s argument was, that you couldn’t cut off a head unless there was a\nbody to cut it off from: that he had never had to do such a thing before, and he wasn’t\ngoing to begin at his time of life.\nThe King’s argument was, that anything that had a head could be beheaded, and that\nyou weren’t to talk nonsense.\nThe Queen’s argument was, that if something wasn’t done about it in less than no\ntime she’d have everybody executed, all round. (It was this last remark that had made\nthe whole party look so grave and anxious.)\nAlice could think of nothing else to say but “It belongs to the Duchess: you’d better\nask her about it.”\n“She’s in prison,” the Queen said to the executioner: “fetch her here.” And the\nexecutioner went off like an arrow.\nThe Cat’s head began fading away the moment he was gone, and, by the time he had\ncome back with the Duchess, it had entirely disappeared; so the King and the\nexecutioner ran wildly up and down looking for it, while the rest of the party went\nback to the game.\nCHAPTER IX.\nThe Mock Turtle’s Story\n“You can’t think how glad I am to see you again, you dear old thing!” said the\nDuchess, as she tucked her arm affectionately into Alice’s, and they walked off\ntogether.\nAlice was very glad to find her in such a pleasant temper, and thought to herself that\nperhaps it was only the pepper that had made her so savage when they met in the\nkitchen.\n“When I’m a Duchess,” she said to herself, (not in a very hopeful tone though), “I\nwon’t have any pepper in my kitchen at all. Soup does very well without—Maybe it’s\nalways pepper that makes people hot-tempered,” she went on, very much pleased at\nhaving found out a new kind of rule, “and vinegar that makes them sour—and\ncamomile that makes them bitter—and—and barley-sugar and such things that make\nchildren sweet-tempered. I only wish people knew that: then they wouldn’t be so\nstingy about it, you know—”\nShe had quite forgotten the Duchess by this time, and was a little startled when she\nheard her voice close to her ear. “You’re thinking about something, my dear, and that\nmakes you forget to talk. I can’t tell you just now what the moral of that is, but I shall\nremember it in a bit.”\n“Perhaps it hasn’t one,” Alice ventured to remark.\n“Tut, tut, child!” said the Duchess. “Everything’s got a moral, if only you can find it.”\nAnd she squeezed herself up closer to Alice’s side as she spoke.\nAlice did not much like keeping so close to her: first, because the Duchess was very\nugly; and secondly, because she was exactly the right height to rest her chin upon\nAlice’s shoulder, and it was an uncomfortably sharp chin. However, she did not like to\nbe rude, so she bore it as well as she could.\n“The game’s going on rather better now,” she said, by way of keeping up the\nconversation a little.\n“’Tis so,” said the Duchess: “and the moral of that is—‘Oh, ’tis love, ’tis love, that\nmakes the world go round!’”\n“Somebody said,” Alice whispered, “that it’s done by everybody minding their own\nbusiness!”\n“Ah, well! It means much the same thing,” said the Duchess, digging her sharp little\nchin into Alice’s shoulder as she added, “and the moral of that is—‘Take care of the\nsense, and the sounds will take care of themselves.’”\n“How fond she is of finding morals in things!” Alice thought to herself.\n“I dare say you’re wondering why I don’t put my arm round your waist,” the Duchess\nsaid after a pause: “the reason is, that I’m doubtful about the temper of your flamingo.\nShall I try the experiment?”\n“He might bite,” Alice cautiously replied, not feeling at all anxious to have the\nexperiment tried.\n“Very true,” said the Duchess: “flamingoes and mustard both bite. And the moral of\nthat is—‘Birds of a feather flock together.’”\n“Only mustard isn’t a bird,” Alice remarked.\n“Right, as usual,” said the Duchess: “what a clear way you have of putting things!”\n“It’s a mineral, I think,” said Alice.\n“Of course it is,” said the Duchess, who seemed ready to agree to everything that\nAlice said; “there’s a large mustard-mine near here. And the moral of that is—‘The\nmore there is of mine, the less there is of yours.’”\n“Oh, I know!” exclaimed Alice, who had not attended to this last remark, “it’s a\nvegetable. It doesn’t look like one, but it is.”\n“I quite agree with you,” said the Duchess; “and the moral of that is—‘Be what you\nwould seem to be’—or if you’d like it put more simply—‘Never imagine yourself not to\nbe otherwise than what it might appear to others that what you were or might have\nbeen was not otherwise than what you had been would have appeared to them to be\notherwise.’”\n“I think I should understand that better,” Alice said very politely, “if I had it written\ndown: but I can’t quite follow it as you say it.”\n“That’s nothing to what I could say if I chose,” the Duchess replied, in a pleased tone.\n“Pray don’t trouble yourself to say it any longer than that,” said Alice.\n“Oh, don’t talk about trouble!” said the Duchess. “I make you a present of everything\nI’ve said as yet.”\n“A cheap sort of present!” thought Alice. “I’m glad they don’t give birthday presents\nlike that!” But she did not venture to say it out loud.\n“Thinking again?” the Duchess asked, with another dig of her sharp little chin.\n“I’ve a right to think,” said Alice sharply, for she was beginning to feel a little\nworried.\n“Just about as much right,” said the Duchess, “as pigs have to fly; and the m—”\nBut here, to Alice’s great surprise, the Duchess’s voice died away, even in the middle\nof her favourite word ‘moral,’ and the arm that was linked into hers began to tremble.\nAlice looked up, and there stood the Queen in front of them, with her arms folded,\nfrowning like a thunderstorm.\n“A fine day, your Majesty!” the Duchess began in a low, weak voice.\n“Now, I give you fair warning,” shouted the Queen, stamping on the ground as she\nspoke; “either you or your head must be off, and that in about half no time! Take your\nchoice!”\nThe Duchess took her choice, and was gone in a moment.\n“Let’s go on with the game,” the Queen said to Alice; and Alice was too much\nfrightened to say a word, but slowly followed her back to the croquet-ground.\nThe other guests had taken advantage of the Queen’s absence, and were resting in\nthe shade: however, the moment they saw her, they hurried back to the game, the\nQueen merely remarking that a moment’s delay would cost them their lives.\nAll the time they were playing the Queen never left off quarrelling with the other\nplayers, and shouting “Off with his head!” or “Off with her head!” Those whom she\nsentenced were taken into custody by the soldiers, who of course had to leave off being\narches to do this, so that by the end of half an hour or so there were no arches left, and\nall the players, except the King, the Queen, and Alice, were in custody and under\nsentence of execution.\nThen the Queen left off, quite out of breath, and said to Alice, “Have you seen the\nMock Turtle yet?”\n“No,” said Alice. “I don’t even know what a Mock Turtle is.”\n“It’s the thing Mock Turtle Soup is made from,” said the Queen.\n“I never saw one, or heard of one,” said Alice.\n“Come on, then,” said the Queen, “and he shall tell you his history,”\nAs they walked off together, Alice heard the King say in a low voice, to the company\ngenerally, “You are all pardoned.” “Come, that’s a good thing!” she said to herself, for\nshe had felt quite unhappy at the number of executions the Queen had ordered.\nThey very soon came upon a Gryphon, lying fast asleep in the sun. (If you don’t\nknow what a Gryphon is, look at the picture.) “Up, lazy thing!” said the Queen, “and\ntake this young lady to see the Mock Turtle, and to hear his history. I must go back and\nsee after some executions I have ordered;” and she walked off, leaving Alice alone with\nthe Gryphon. Alice did not quite like the look of the creature, but on the whole she\nthought it would be quite as safe to stay with it as to go after that savage Queen: so she\nwaited.\nThe Gryphon sat up and rubbed its eyes: then it watched the Queen till she was out\nof sight: then it chuckled. “What fun!” said the Gryphon, half to itself, half to Alice.\n“What is the fun?” said Alice.\n“Why, she,” said the Gryphon. “It’s all her fancy, that: they never executes nobody,\nyou know. Come on!”\n“Everybody says ‘come on!’ here,” thought Alice, as she went slowly after it: “I never\nwas so ordered about in all my life, never!”\nThey had not gone far before they saw the Mock Turtle in the distance, sitting sad\nand lonely on a little ledge of rock, and, as they came nearer, Alice could hear him\nsighing as if his heart would break. She pitied him deeply. “What is his sorrow?” she\nasked the Gryphon, and the Gryphon answered, very nearly in the same words as\nbefore, “It’s all his fancy, that: he hasn’t got no sorrow, you know. Come on!”\nSo they went up to the Mock Turtle, who looked at them with large eyes full of tears,\nbut said nothing.\n“This here young lady,” said the Gryphon, “she wants for to know your history, she\ndo.”\n“I’ll tell it her,” said the Mock Turtle in a deep, hollow tone: “sit down, both of you,\nand don’t speak a word till I’ve finished.”\nSo they sat down, and nobody spoke for some minutes. Alice thought to herself, “I\ndon’t see how he can ever finish, if he doesn’t begin.” But she waited patiently.\n“Once,” said the Mock Turtle at last, with a deep sigh, “I was a real Turtle.”\nThese words were followed by a very long silence, broken only by an occasional\nexclamation of “Hjckrrh!” from the Gryphon, and the constant heavy sobbing of the\nMock Turtle. Alice was very nearly getting up and saying, “Thank you, sir, for your\ninteresting story,” but she could not help thinking there must be more to come, so she\nsat still and said nothing.\n“When we were little,” the Mock Turtle went on at last, more calmly, though still\nsobbing a little now and then, “we went to school in the sea. The master was an old\nTurtle—we used to call him Tortoise—”\n“Why did you call him Tortoise, if he wasn’t one?” Alice asked.\n“We called him Tortoise because he taught us,” said the Mock Turtle angrily: “really\nyou are very dull!”\n“You ought to be ashamed of yourself for asking such a simple question,” added the\nGryphon; and then they both sat silent and looked at poor Alice, who felt ready to sink\ninto the earth. At last the Gryphon said to the Mock Turtle, “Drive on, old fellow! Don’t\nbe all day about it!” and he went on in these words:\n“Yes, we went to school in the sea, though you mayn’t believe it—”\n“I never said I didn’t!” interrupted Alice.\n“You did,” said the Mock Turtle.\n“Hold your tongue!” added the Gryphon, before Alice could speak again. The Mock\nTurtle went on.\n“We had the best of educations—in fact, we went to school every day—”\n“I’ve been to a day-school, too,” said Alice; “you needn’t be so proud as all that.”\n“With extras?” asked the Mock Turtle a little anxiously.\n“Yes,” said Alice, “we learned French and music.”\n“And washing?” said the Mock Turtle.\n“Certainly not!” said Alice indignantly.\n“Ah! then yours wasn’t a really good school,” said the Mock Turtle in a tone of great\nrelief. “Now at ours they had at the end of the bill, ‘French, music, and washing—extra.’”\n“You couldn’t have wanted it much,” said Alice; “living at the bottom of the sea.”\n“I couldn’t afford to learn it.” said the Mock Turtle with a sigh. “I only took the\nregular course.”\n“What was that?” inquired Alice.\n“Reeling and Writhing, of course, to begin with,” the Mock Turtle replied; “and then\nthe different branches of Arithmetic—Ambition, Distraction, Uglification, and\nDerision.”\n“I never heard of ‘Uglification,’” Alice ventured to say. “What is it?”\nThe Gryphon lifted up both its paws in surprise. “What! Never heard of uglifying!” it\nexclaimed. “You know what to beautify is, I suppose?”\n“Yes,” said Alice doubtfully: “it means—to—make—anything—prettier.”\n“Well, then,” the Gryphon went on, “if you don’t know what to uglify is, you are a\nsimpleton.”\nAlice did not feel encouraged to ask any more questions about it, so she turned to the\nMock Turtle, and said “What else had you to learn?”\n“Well, there was Mystery,” the Mock Turtle replied, counting off the subjects on his\nflappers, “—Mystery, ancient and modern, with Seaography: then Drawling—the\nDrawling-master was an old conger-eel, that used to come once a week: he taught us\nDrawling, Stretching, and Fainting in Coils.”\n“What was that like?” said Alice.\n“Well, I can’t show it you myself,” the Mock Turtle said: “I’m too stiff. And the\nGryphon never learnt it.”\n“Hadn’t time,” said the Gryphon: “I went to the Classics master, though. He was an\nold crab, he was.”\n“I never went to him,” the Mock Turtle said with a sigh: “he taught Laughing and\nGrief, they used to say.”\n“So he did, so he did,” said the Gryphon, sighing in his turn; and both creatures hid\ntheir faces in their paws.\n“And how many hours a day did you do lessons?” said Alice, in a hurry to change the\nsubject.\n“Ten hours the first day,” said the Mock Turtle: “nine the next, and so on.”\n“What a curious plan!” exclaimed Alice.\n“That’s the reason they’re called lessons,” the Gryphon remarked: “because they\nlessen from day to day.”\nThis was quite a new idea to Alice, and she thought it over a little before she made\nher next remark. “Then the eleventh day must have been a holiday?”\n“Of course it was,” said the Mock Turtle.\n“And how did you manage on the twelfth?” Alice went on eagerly.\n“That’s enough about lessons,” the Gryphon interrupted in a very decided tone: “tell\nher something about the games now.”\nCHAPTER X.\nThe Lobster Quadrille\nThe Mock Turtle sighed deeply, and drew the back of one flapper across his eyes. He\nlooked at Alice, and tried to speak, but for a minute or two sobs choked his voice. “Same\nas if he had a bone in his throat,” said the Gryphon: and it set to work shaking him and\npunching him in the back. At last the Mock Turtle recovered his voice, and, with tears\nrunning down his cheeks, he went on again:—\n“You may not have lived much under the sea—” (“I haven’t,” said Alice)—“and\nperhaps you were never even introduced to a lobster—” (Alice began to say “I once\ntasted—” but checked herself hastily, and said “No, never”) “—so you can have no idea\nwhat a delightful thing a Lobster Quadrille is!”\n“No, indeed,” said Alice. “What sort of a dance is it?”\n“Why,” said the Gryphon, “you first form into a line along the sea-shore—”\n“Two lines!” cried the Mock Turtle. “Seals, turtles, salmon, and so on; then, when\nyou’ve cleared all the jelly-fish out of the way—”\n“That generally takes some time,” interrupted the Gryphon.\n“—you advance twice—”\n“Each with a lobster as a partner!” cried the Gryphon.\n“Of course,” the Mock Turtle said: “advance twice, set to partners—”\n“—change lobsters, and retire in same order,” continued the Gryphon.\n“Then, you know,” the Mock Turtle went on, “you throw the—”\n“The lobsters!” shouted the Gryphon, with a bound into the air.\n“—as far out to sea as you can—”\n“Swim after them!” screamed the Gryphon.\n“Turn a somersault in the sea!” cried the Mock Turtle, capering wildly about.\n“Change lobsters again!” yelled the Gryphon at the top of its voice.\n“Back to land again, and that’s all the first figure,” said the Mock Turtle, suddenly\ndropping his voice; and the two creatures, who had been jumping about like mad\nthings all this time, sat down again very sadly and quietly, and looked at Alice.\n“It must be a very pretty dance,” said Alice timidly.\n“Would you like to see a little of it?” said the Mock Turtle.\n“Very much indeed,” said Alice.\n“Come, let’s try the first figure!” said the Mock Turtle to the Gryphon. “We can do\nwithout lobsters, you know. Which shall sing?”\n“Oh, you sing,” said the Gryphon. “I’ve forgotten the words.”\nSo they began solemnly dancing round and round Alice, every now and then\ntreading on her toes when they passed too close, and waving their forepaws to mark\nthe time, while the Mock Turtle sang this, very slowly and sadly:—\n“Will you walk a little faster?” said a whiting to a snail.\n“There’s a porpoise close behind us, and he’s treading on my tail.\nSee how eagerly the lobsters and the turtles all advance!\nThey are waiting on the shingle—will you come and join the dance?\nWill you, won’t you, will you, won’t you, will you join the dance?\nWill you, won’t you, will you, won’t you, won’t you join the dance?\n“You can really have no notion how delightful it will be\nWhen they take us up and throw us, with the lobsters, out to sea!”\nBut the snail replied “Too far, too far!” and gave a look askance—\nSaid he thanked the whiting kindly, but he would not join the dance.\nWould not, could not, would not, could not, would not join the dance.\nWould not, could not, would not, could not, could not join the dance.\n“What matters it how far we go?” his scaly friend replied.\n“There is another shore, you know, upon the other side.\nThe further off from England the nearer is to France—\nThen turn not pale, beloved snail, but come and join the dance.\nWill you, won’t you, will you, won’t you, will you join the dance?\nWill you, won’t you, will you, won’t you, won’t you join the dance?”\n“Thank you, it’s a very interesting dance to watch,” said Alice, feeling very glad that\nit was over at last: “and I do so like that curious song about the whiting!”\n“Oh, as to the whiting,” said the Mock Turtle, “they—you’ve seen them, of course?”\n“Yes,” said Alice, “I’ve often seen them at dinn—” she checked herself hastily.\n“I don’t know where Dinn may be,” said the Mock Turtle, “but if you’ve seen them so\noften, of course you know what they’re like.”\n“I believe so,” Alice replied thoughtfully. “They have their tails in their mouths—and\nthey’re all over crumbs.”\n“You’re wrong about the crumbs,” said the Mock Turtle: “crumbs would all wash off\nin the sea. But they have their tails in their mouths; and the reason is—” here the Mock\nTurtle yawned and shut his eyes.—“Tell her about the reason and all that,” he said to\nthe Gryphon.\n“The reason is,” said the Gryphon, “that they would go with the lobsters to the dance.\nSo they got thrown out to sea. So they had to fall a long way. So they got their tails fast\nin their mouths. So they couldn’t get them out again. That’s all.”\n“Thank you,” said Alice, “it’s very interesting. I never knew so much about a whiting\nbefore.”\n“I can tell you more than that, if you like,” said the Gryphon. “Do you know why it’s\ncalled a whiting?”\n“I never thought about it,” said Alice. “Why?”\n“It does the boots and shoes,” the Gryphon replied very solemnly.\nAlice was thoroughly puzzled. “Does the boots and shoes!” she repeated in a\nwondering tone.\n“Why, what are your shoes done with?” said the Gryphon. “I mean, what makes them\nso shiny?”\nAlice looked down at them, and considered a little before she gave her answer.\n“They’re done with blacking, I believe.”\n“Boots and shoes under the sea,” the Gryphon went on in a deep voice, “are done with\na whiting. Now you know.”\n“And what are they made of?” Alice asked in a tone of great curiosity.\n“Soles and eels, of course,” the Gryphon replied rather impatiently: “any shrimp\ncould have told you that.”\n“If I’d been the whiting,” said Alice, whose thoughts were still running on the song,\n“I’d have said to the porpoise, ‘Keep back, please: we don’t want you with us!’”\n“They were obliged to have him with them,” the Mock Turtle said: “no wise fish\nwould go anywhere without a porpoise.”\n“Wouldn’t it really?” said Alice in a tone of great surprise.\n“Of course not,” said the Mock Turtle: “why, if a fish came to me, and told me he was\ngoing a journey, I should say ‘With what porpoise?’”\n“Don’t you mean ‘purpose’?” said Alice.\n“I mean what I say,” the Mock Turtle replied in an offended tone. And the Gryphon\nadded “Come, let’s hear some of your adventures.”\n“I could tell you my adventures—beginning from this morning,” said Alice a little\ntimidly: “but it’s no use going back to yesterday, because I was a different person then.”\n“Explain all that,” said the Mock Turtle.\n“No, no! The adventures first,” said the Gryphon in an impatient tone: “explanations\ntake such a dreadful time.”\nSo Alice began telling them her adventures from the time when she first saw the\nWhite Rabbit. She was a little nervous about it just at first, the two creatures got so\nclose to her, one on each side, and opened their eyes and mouths so very wide, but she\ngained courage as she went on. Her listeners were perfectly quiet till she got to the part\nabout her repeating “You are old, Father William,” to the Caterpillar, and the words all\ncoming different, and then the Mock Turtle drew a long breath, and said “That’s very\ncurious.”\n“It’s all about as curious as it can be,” said the Gryphon.\n“It all came different!” the Mock Turtle repeated thoughtfully. “I should like to hear\nher try and repeat something now. Tell her to begin.” He looked at the Gryphon as if he\nthought it had some kind of authority over Alice.\n“Stand up and repeat ‘’Tis the voice of the sluggard,’” said the Gryphon.\n“How the creatures order one about, and make one repeat lessons!” thought Alice; “I\nmight as well be at school at once.” However, she got up, and began to repeat it, but her\nhead was so full of the Lobster Quadrille, that she hardly knew what she was saying,\nand the words came very queer indeed:—\n“’Tis the voice of the Lobster; I heard him declare,\n“You have baked me too brown, I must sugar my hair.”\nAs a duck with its eyelids, so he with his nose\nTrims his belt and his buttons, and turns out his toes.”\n[later editions continued as follows\nWhen the sands are all dry, he is gay as a lark,\nAnd will talk in contemptuous tones of the Shark,\nBut, when the tide rises and sharks are around,\nHis voice has a timid and tremulous sound.]\n“That’s different from what I used to say when I was a child,” said the Gryphon.\n“Well, I never heard it before,” said the Mock Turtle; “but it sounds uncommon\nnonsense.”\nAlice said nothing; she had sat down with her face in her hands, wondering if\nanything would ever happen in a natural way again.\n“I should like to have it explained,” said the Mock Turtle.\n“She can’t explain it,” said the Gryphon hastily. “Go on with the next verse.”\n“But about his toes?” the Mock Turtle persisted. “How could he turn them out with\nhis nose, you know?”\n“It’s the first position in dancing.” Alice said; but was dreadfully puzzled by the\nwhole thing, and longed to change the subject.\n“Go on with the next verse,” the Gryphon repeated impatiently: “it begins ‘I passed by\nhis garden.’”\nAlice did not dare to disobey, though she felt sure it would all come wrong, and she\nwent on in a trembling voice:—\n“I passed by his garden, and marked, with one eye,\nHow the Owl and the Panther were sharing a pie—”\n[later editions continued as follows\nThe Panther took pie-crust, and gravy, and meat,\nWhile the Owl had the dish as its share of the treat.\nWhen the pie was all finished, the Owl, as a boon,\nWas kindly permitted to pocket the spoon:\nWhile the Panther received knife and fork with a growl,\nAnd concluded the banquet—]\n“What is the use of repeating all that stuff,” the Mock Turtle interrupted, “if you\ndon’t explain it as you go on? It’s by far the most confusing thing I ever heard!”\n“Yes, I think you’d better leave off,” said the Gryphon: and Alice was only too glad to\ndo so.\n“Shall we try another figure of the Lobster Quadrille?” the Gryphon went on. “Or\nwould you like the Mock Turtle to sing you a song?”\n“Oh, a song, please, if the Mock Turtle would be so kind,” Alice replied, so eagerly that\nthe Gryphon said, in a rather offended tone, “Hm! No accounting for tastes! Sing her\n‘Turtle Soup,’ will you, old fellow?”\nThe Mock Turtle sighed deeply, and began, in a voice sometimes choked with sobs, to\nsing this:—\n“Beautiful Soup, so rich and green,\nWaiting in a hot tureen!\nWho for such dainties would not stoop?\nSoup of the evening, beautiful Soup!\nSoup of the evening, beautiful Soup!\nBeau—ootiful Soo—oop!\nBeau—ootiful Soo—oop!\nSoo—oop of the e—e—evening,\nBeautiful, beautiful Soup!\n“Beautiful Soup! Who cares for fish,\nGame, or any other dish?\nWho would not give all else for two p\nennyworth only of beautiful Soup?\nPennyworth only of beautiful Soup?\nBeau—ootiful Soo—oop!\nBeau—ootiful Soo—oop!\nSoo—oop of the e—e—evening,\nBeautiful, beauti—FUL SOUP!”\n“Chorus again!” cried the Gryphon, and the Mock Turtle had just begun to repeat it,\nwhen a cry of “The trial’s beginning!” was heard in the distance.\n“Come on!” cried the Gryphon, and, taking Alice by the hand, it hurried off, without\nwaiting for the end of the song.\n“What trial is it?” Alice panted as she ran; but the Gryphon only answered “Come\non!” and ran the faster, while more and more faintly came, carried on the breeze that\nfollowed them, the melancholy words:—\n“Soo—oop of the e—e—evening,\nBeautiful, beautiful Soup!”\nCHAPTER XI.\nWho Stole the Tarts?\nThe King and Queen of Hearts were seated on their throne when they arrived, with a\ngreat crowd assembled about them—all sorts of little birds and beasts, as well as the\nwhole pack of cards: the Knave was standing before them, in chains, with a soldier on\neach side to guard him; and near the King was the White Rabbit, with a trumpet in one\nhand, and a scroll of parchment in the other. In the very middle of the court was a\ntable, with a large dish of tarts upon it: they looked so good, that it made Alice quite\nhungry to look at them—“I wish they’d get the trial done,” she thought, “and hand\nround the refreshments!” But there seemed to be no chance of this, so she began\nlooking at everything about her, to pass away the time.\nAlice had never been in a court of justice before, but she had read about them in\nbooks, and she was quite pleased to find that she knew the name of nearly everything\nthere. “That’s the judge,” she said to herself, “because of his great wig.”\nThe judge, by the way, was the King; and as he wore his crown over the wig, (look at\nthe frontispiece if you want to see how he did it,) he did not look at all comfortable, and\nit was certainly not becoming.\n“And that’s the jury-box,” thought Alice, “and those twelve creatures,” (she was\nobliged to say “creatures,” you see, because some of them were animals, and some were\nbirds,) “I suppose they are the jurors.” She said this last word two or three times over to\nherself, being rather proud of it: for she thought, and rightly too, that very few little\ngirls of her age knew the meaning of it at all. However, “jury-men” would have done\njust as well.\nThe twelve jurors were all writing very busily on slates. “What are they doing?” Alice\nwhispered to the Gryphon. “They can’t have anything to put down yet, before the\ntrial’s begun.”\n“They’re putting down their names,” the Gryphon whispered in reply, “for fear they\nshould forget them before the end of the trial.”\n“Stupid things!” Alice began in a loud, indignant voice, but she stopped hastily, for\nthe White Rabbit cried out, “Silence in the court!” and the King put on his spectacles\nand looked anxiously round, to make out who was talking.\nAlice could see, as well as if she were looking over their shoulders, that all the jurors\nwere writing down “stupid things!” on their slates, and she could even make out that\none of them didn’t know how to spell “stupid,” and that he had to ask his neighbour to\ntell him. “A nice muddle their slates’ll be in before the trial’s over!” thought Alice.\nOne of the jurors had a pencil that squeaked. This of course, Alice could not stand,\nand she went round the court and got behind him, and very soon found an opportunity\nof taking it away. She did it so quickly that the poor little juror (it was Bill, the Lizard)\ncould not make out at all what had become of it; so, after hunting all about for it, he\nwas obliged to write with one finger for the rest of the day; and this was of very little\nuse, as it left no mark on the slate.\n“Herald, read the accusation!” said the King.\nOn this the White Rabbit blew three blasts on the trumpet, and then unrolled the\nparchment scroll, and read as follows:—\n“The Queen of Hearts, she made some tarts,\nAll on a summer day:\nThe Knave of Hearts, he stole those tarts,\nAnd took them quite away!”\n“Consider your verdict,” the King said to the jury.\n“Not yet, not yet!” the Rabbit hastily interrupted. “There’s a great deal to come before\nthat!”\n“Call the first witness,” said the King; and the White Rabbit blew three blasts on the\ntrumpet, and called out, “First witness!”\nThe first witness was the Hatter. He came in with a teacup in one hand and a piece of\nbread-and-butter in the other. “I beg pardon, your Majesty,” he began, “for bringing\nthese in: but I hadn’t quite finished my tea when I was sent for.”\n“You ought to have finished,” said the King. “When did you begin?”\nThe Hatter looked at the March Hare, who had followed him into the court, arm-in-\narm with the Dormouse. “Fourteenth of March, I think it was,” he said.\n“Fifteenth,” said the March Hare.\n“Sixteenth,” added the Dormouse.\n“Write that down,” the King said to the jury, and the jury eagerly wrote down all\nthree dates on their slates, and then added them up, and reduced the answer to\nshillings and pence.\n“Take off your hat,” the King said to the Hatter.\n“It isn’t mine,” said the Hatter.\n“Stolen!” the King exclaimed, turning to the jury, who instantly made a\nmemorandum of the fact.\n“I keep them to sell,” the Hatter added as an explanation; “I’ve none of my own. I’m a\nhatter.”\nHere the Queen put on her spectacles, and began staring at the Hatter, who turned\npale and fidgeted.\n“Give your evidence,” said the King; “and don’t be nervous, or I’ll have you executed\non the spot.”\nThis did not seem to encourage the witness at all: he kept shifting from one foot to\nthe other, looking uneasily at the Queen, and in his confusion he bit a large piece out of\nhis teacup instead of the bread-and-butter.\nJust at this moment Alice felt a very curious sensation, which puzzled her a good\ndeal until she made out what it was: she was beginning to grow larger again, and she\nthought at first she would get up and leave the court; but on second thoughts she\ndecided to remain where she was as long as there was room for her.\n“I wish you wouldn’t squeeze so.” said the Dormouse, who was sitting next to her. “I\ncan hardly breathe.”\n“I can’t help it,” said Alice very meekly: “I’m growing.”\n“You’ve no right to grow here,” said the Dormouse.\n“Don’t talk nonsense,” said Alice more boldly: “you know you’re growing too.”\n“Yes, but I grow at a reasonable pace,” said the Dormouse: “not in that ridiculous\nfashion.” And he got up very sulkily and crossed over to the other side of the court.\nAll this time the Queen had never left off staring at the Hatter, and, just as the\nDormouse crossed the court, she said to one of the officers of the court, “Bring me the\nlist of the singers in the last concert!” on which the wretched Hatter trembled so, that\nhe shook both his shoes off.\n“Give your evidence,” the King repeated angrily, “or I’ll have you executed, whether\nyou’re nervous or not.”\n“I’m a poor man, your Majesty,” the Hatter began, in a trembling voice, “—and I\nhadn’t begun my tea—not above a week or so—and what with the bread-and-butter\ngetting so thin—and the twinkling of the tea—”\n“The twinkling of the what?” said the King.\n“It began with the tea,” the Hatter replied.\n“Of course twinkling begins with a T!” said the King sharply. “Do you take me for a\ndunce? Go on!”\n“I’m a poor man,” the Hatter went on, “and most things twinkled after that—only\nthe March Hare said—”\n“I didn’t!” the March Hare interrupted in a great hurry.\n“You did!” said the Hatter.\n“I deny it!” said the March Hare.\n“He denies it,” said the King: “leave out that part.”\n“Well, at any rate, the Dormouse said—” the Hatter went on, looking anxiously\nround to see if he would deny it too: but the Dormouse denied nothing, being fast\nasleep.\n“After that,” continued the Hatter, “I cut some more bread-and-butter—”\n“But what did the Dormouse say?” one of the jury asked.\n“That I can’t remember,” said the Hatter.\n“You must remember,” remarked the King, “or I’ll have you executed.”\nThe miserable Hatter dropped his teacup and bread-and-butter, and went down on\none knee. “I’m a poor man, your Majesty,” he began.\n“You’re a very poor speaker,” said the King.\nHere one of the guinea-pigs cheered, and was immediately suppressed by the\nofficers of the court. (As that is rather a hard word, I will just explain to you how it was\ndone. They had a large canvas bag, which tied up at the mouth with strings: into this\nthey slipped the guinea-pig, head first, and then sat upon it.)\n“I’m glad I’ve seen that done,” thought Alice. “I’ve so often read in the newspapers, at\nthe end of trials, “There was some attempts at applause, which was immediately\nsuppressed by the officers of the court,” and I never understood what it meant till\nnow.”\n“If that’s all you know about it, you may stand down,” continued the King.\n“I can’t go no lower,” said the Hatter: “I’m on the floor, as it is.”\n“Then you may sit down,” the King replied.\nHere the other guinea-pig cheered, and was suppressed.\n“Come, that finished the guinea-pigs!” thought Alice. “Now we shall get on better.”\n“I’d rather finish my tea,” said the Hatter, with an anxious look at the Queen, who\nwas reading the list of singers.\n“You may go,” said the King, and the Hatter hurriedly left the court, without even\nwaiting to put his shoes on.\n“—and just take his head off outside,” the Queen added to one of the officers: but the\nHatter was out of sight before the officer could get to the door.\n“Call the next witness!” said the King.\nThe next witness was the Duchess’s cook. She carried the pepper-box in her hand,\nand Alice guessed who it was, even before she got into the court, by the way the people\nnear the door began sneezing all at once.\n“Give your evidence,” said the King.\n“Shan’t,” said the cook.\nThe King looked anxiously at the White Rabbit, who said in a low voice, “Your\nMajesty must cross-examine this witness.”\n“Well, if I must, I must,” the King said, with a melancholy air, and, after folding his\narms and frowning at the cook till his eyes were nearly out of sight, he said in a deep\nvoice, “What are tarts made of?”\n“Pepper, mostly,” said the cook.\n“Treacle,” said a sleepy voice behind her.\n“Collar that Dormouse,” the Queen shrieked out. “Behead that Dormouse! Turn that\nDormouse out of court! Suppress him! Pinch him! Off with his whiskers!”\nFor some minutes the whole court was in confusion, getting the Dormouse turned\nout, and, by the time they had settled down again, the cook had disappeared.\n“Never mind!” said the King, with an air of great relief. “Call the next witness.” And\nhe added in an undertone to the Queen, “Really, my dear, you must cross-examine the\nnext witness. It quite makes my forehead ache!”\nAlice watched the White Rabbit as he fumbled over the list, feeling very curious to\nsee what the next witness would be like, “—for they haven’t got much evidence yet,”\nshe said to herself. Imagine her surprise, when the White Rabbit read out, at the top of\nhis shrill little voice, the name “Alice!”\nCHAPTER XII.\nAlice’s Evidence\n“Here!” cried Alice, quite forgetting in the flurry of the moment how large she had\ngrown in the last few minutes, and she jumped up in such a hurry that she tipped over\nthe jury-box with the edge of her skirt, upsetting all the jurymen on to the heads of the\ncrowd below, and there they lay sprawling about, reminding her very much of a globe\nof goldfish she had accidentally upset the week before.\n“Oh, I beg your pardon!” she exclaimed in a tone of great dismay, and began picking\nthem up again as quickly as she could, for the accident of the goldfish kept running in\nher head, and she had a vague sort of idea that they must be collected at once and put\nback into the jury-box, or they would die.\n“The trial cannot proceed,” said the King in a very grave voice, “until all the jurymen\nare back in their proper places—all,” he repeated with great emphasis, looking hard at\nAlice as he said so.\nAlice looked at the jury-box, and saw that, in her haste, she had put the Lizard in\nhead downwards, and the poor little thing was waving its tail about in a melancholy\nway, being quite unable to move. She soon got it out again, and put it right; “not that it\nsignifies much,” she said to herself; “I should think it would be quite as much use in the\ntrial one way up as the other.”\nAs soon as the jury had a little recovered from the shock of being upset, and their\nslates and pencils had been found and handed back to them, they set to work very\ndiligently to write out a history of the accident, all except the Lizard, who seemed too\nmuch overcome to do anything but sit with its mouth open, gazing up into the roof of\nthe court.\n“What do you know about this business?” the King said to Alice.\n“Nothing,” said Alice.\n“Nothing whatever?” persisted the King.\n“Nothing whatever,” said Alice.\n“That’s very important,” the King said, turning to the jury. They were just beginning\nto write this down on their slates, when the White Rabbit interrupted: “Unimportant,\nyour Majesty means, of course,” he said in a very respectful tone, but frowning and\nmaking faces at him as he spoke.\n“Unimportant, of course, I meant,” the King hastily said, and went on to himself in\nan undertone,\n“important—unimportant—unimportant—important—” as if he were trying which\nword sounded best.\nSome of the jury wrote it down “important,” and some “unimportant.” Alice could\nsee this, as she was near enough to look over their slates; “but it doesn’t matter a bit,”\nshe thought to herself.\nAt this moment the King, who had been for some time busily writing in his note-\nbook, cackled out “Silence!” and read out from his book, “Rule Forty-two. All persons\nmore than a mile high to leave the court.”\nEverybody looked at Alice.\n“I’m not a mile high,” said Alice.\n“You are,” said the King.\n“Nearly two miles high,” added the Queen.\n“Well, I shan’t go, at any rate,” said Alice: “besides, that’s not a regular rule: you\ninvented it just now.”\n“It’s the oldest rule in the book,” said the King.\n“Then it ought to be Number One,” said Alice.\nThe King turned pale, and shut his note-book hastily. “Consider your verdict,” he\nsaid to the jury, in a low, trembling voice.\n“There’s more evidence to come yet, please your Majesty,” said the White Rabbit,\njumping up in a great hurry; “this paper has just been picked up.”\n“What’s in it?” said the Queen.\n“I haven’t opened it yet,” said the White Rabbit, “but it seems to be a letter, written\nby the prisoner to—to somebody.”\n“It must have been that,” said the King, “unless it was written to nobody, which isn’t\nusual, you know.”\n“Who is it directed to?” said one of the jurymen.\n“It isn’t directed at all,” said the White Rabbit; “in fact, there’s nothing written on the\noutside.” He unfolded the paper as he spoke, and added “It isn’t a letter, after all: it’s a\nset of verses.”\n“Are they in the prisoner’s handwriting?” asked another of the jurymen.\n“No, they’re not,” said the White Rabbit, “and that’s the queerest thing about it.” (The\njury all looked puzzled.)\n“He must have imitated somebody else’s hand,” said the King. (The jury all\nbrightened up again.)\n“Please your Majesty,” said the Knave, “I didn’t write it, and they can’t prove I did:\nthere’s no name signed at the end.”\n“If you didn’t sign it,” said the King, “that only makes the matter worse. You must\nhave meant some mischief, or else you’d have signed your name like an honest man.”\nThere was a general clapping of hands at this: it was the first really clever thing the\nKing had said that day.\n“That proves his guilt,” said the Queen.\n“It proves nothing of the sort!” said Alice. “Why, you don’t even know what they’re\nabout!”\n“Read them,” said the King.\nThe White Rabbit put on his spectacles. “Where shall I begin, please your Majesty?”\nhe asked.\n“Begin at the beginning,” the King said gravely, “and go on till you come to the end:\nthen stop.”\nThese were the verses the White Rabbit read:—\n“They told me you had been to her,\nAnd mentioned me to him:\nShe gave me a good character,\nBut said I could not swim.\nHe sent them word I had not gone\n(We know it to be true):\nIf she should push the matter on,\nWhat would become of you?\nI gave her one, they gave him two,\nYou gave us three or more;\nThey all returned from him to you,\nThough they were mine before.\nIf I or she should chance to be\nInvolved in this affair,\nHe trusts to you to set them free,\nExactly as we were.\nMy notion was that you had been\n(Before she had this fit)\nAn obstacle that came between\nHim, and ourselves, and it.\nDon’t let him know she liked them best,\nFor this must ever be\nA secret, kept from all the rest,\nBetween yourself and me.”\n“That’s the most important piece of evidence we’ve heard yet,” said the King,\nrubbing his hands; “so now let the jury—”\n“If any one of them can explain it,” said Alice, (she had grown so large in the last few\nminutes that she wasn’t a bit afraid of interrupting him,) “I’ll give him sixpence. I don’t\nbelieve there’s an atom of meaning in it.”\nThe jury all wrote down on their slates, “She doesn’t believe there’s an atom of\nmeaning in it,” but none of them attempted to explain the paper.\n“If there’s no meaning in it,” said the King, “that saves a world of trouble, you know,\nas we needn’t try to find any. And yet I don’t know,” he went on, spreading out the\nverses on his knee, and looking at them with one eye; “I seem to see some meaning in\nthem, after all. “—said I could not swim—” you can’t swim, can you?” he added, turning\nto the Knave.\nThe Knave shook his head sadly. “Do I look like it?” he said. (Which he certainly did\nnot, being made entirely of cardboard.)\n“All right, so far,” said the King, and he went on muttering over the verses to himself:\n“‘We know it to be true—’ that’s the jury, of course—‘I gave her one, they gave him two—’\nwhy, that must be what he did with the tarts, you know—”\n“But, it goes on ‘they all returned from him to you,’” said Alice.\n“Why, there they are!” said the King triumphantly, pointing to the tarts on the table.\n“Nothing can be clearer than that. Then again—‘before she had this fit—’ you never had\nfits, my dear, I think?” he said to the Queen.\n“Never!” said the Queen furiously, throwing an inkstand at the Lizard as she spoke.\n(The unfortunate little Bill had left off writing on his slate with one finger, as he found\nit made no mark; but he now hastily began again, using the ink, that was trickling\ndown his face, as long as it lasted.)\n“Then the words don’t fit you,” said the King, looking round the court with a smile.\nThere was a dead silence.\n“It’s a pun!” the King added in an offended tone, and everybody laughed, “Let the\njury consider their verdict,” the King said, for about the twentieth time that day.\n“No, no!” said the Queen. “Sentence first—verdict afterwards.”\n“Stuff and nonsense!” said Alice loudly. “The idea of having the sentence first!”\n“Hold your tongue!” said the Queen, turning purple.\n“I won’t!” said Alice.\n“Off with her head!” the Queen shouted at the top of her voice. Nobody moved.\n“Who cares for you?” said Alice, (she had grown to her full size by this time.) “You’re\nnothing but a pack of cards!”\nAt this the whole pack rose up into the air, and came flying down upon her: she gave\na little scream, half of fright and half of anger, and tried to beat them off, and found\nherself lying on the bank, with her head in the lap of her sister, who was gently\nbrushing away some dead leaves that had fluttered down from the trees upon her face.\n“Wake up, Alice dear!” said her sister; “Why, what a long sleep you’ve had!”\n“Oh, I’ve had such a curious dream!” said Alice, and she told her sister, as well as she\ncould remember them, all these strange Adventures of hers that you have just been\nreading about; and when she had finished, her sister kissed her, and said, “It was a\ncurious dream, dear, certainly: but now run in to your tea; it’s getting late.” So Alice got\nup and ran off, thinking while she ran, as well she might, what a wonderful dream it\nhad been.\nBut her sister sat still just as she left her, leaning her head on her hand, watching the\nsetting sun, and thinking of little Alice and all her wonderful Adventures, till she too\nbegan dreaming after a fashion, and this was her dream:—\nFirst, she dreamed of little Alice herself, and once again the tiny hands were clasped\nupon her knee, and the bright eager eyes were looking up into hers—she could hear the\nvery tones of her voice, and see that queer little toss of her head to keep back the\nwandering hair that would always get into her eyes—and still as she listened, or\nseemed to listen, the whole place around her became alive with the strange creatures\nof her little sister’s dream.\nThe long grass rustled at her feet as the White Rabbit hurried by—the frightened\nMouse splashed his way through the neighbouring pool—she could hear the rattle of\nthe teacups as the March Hare and his friends shared their never-ending meal, and the\nshrill voice of the Queen ordering off her unfortunate guests to execution—once more\nthe pig-baby was sneezing on the Duchess’s knee, while plates and dishes crashed\naround it—once more the shriek of the Gryphon, the squeaking of the Lizard’s slate-\npencil, and the choking of the suppressed guinea-pigs, filled the air, mixed up with the\ndistant sobs of the miserable Mock Turtle.\nSo she sat on, with closed eyes, and half believed herself in Wonderland, though she\nknew she had but to open them again, and all would change to dull reality—the grass\nwould be only rustling in the wind, and the pool rippling to the waving of the reeds—\nthe rattling teacups would change to tinkling sheep-bells, and the Queen’s shrill cries\nto the voice of the shepherd boy—and the sneeze of the baby, the shriek of the\nGryphon, and all the other queer noises, would change (she knew) to the confused\nclamour of the busy farm-yard—while the lowing of the cattle in the distance would\ntake the place of the Mock Turtle’s heavy sobs.\nLastly, she pictured to herself how this same little sister of hers would, in the after-\ntime, be herself a grown woman; and how she would keep, through all her riper years,\nthe simple and loving heart of her childhood: and how she would gather about her\nother little children, and make their eyes bright and eager with many a strange tale,\nperhaps even with the dream of Wonderland of long ago: and how she would feel with\nall their simple sorrows, and find a pleasure in all their simple joys, remembering her\nown child-life, and the happy summer days.\nTHE END"
    },
    {
        "id": "demo",
        "title": "Project Echo",
        "cover": "/covers/demo.png",
        "author": "ChatGPT",
        "uploadDate": "2025-04-23T14:43:33.487185",
        "pages": 11,
        "chunks": [
            {
                "chunk_id": 0,
                "chunk_text": "Chapter 1. Dr. Evelyn Porter stood in the sterile, white laboratory, bathed in the faint hum of servers and the soft glow of dozens of monitors. Data cascaded down the screens in complex patterns, illuminating her pale, focused features with shades of blue and green. Evelyn was on the brink of the most groundbreaking discovery of her career--perhaps of human history itself. Today marked the culmination of years of painstaking research, sleepless nights, and relentless experimentation. \"Dr. Porter,\" said a gentle voice from her left, pulling her attention briefly away from the screens. Stability meant they could proceed. Anya smiled nervously, understanding the gravity of what they were about to attempt. She moved swiftly across the room, coordinating the final steps. With deliberate movements, Evelyn removed her lab coat and took a seat inside the chamber. The chair adjusted automatically, fitting perfectly to her body's contours. Her heartbeat echoed in her ears, amplified by the chamber's silence. \"Dr. Porter, we are ready when you are,\" Anya's voice crackled softly through the intercom. Taking a deep breath, Evelyn gave a single decisive nod. \"Begin.\" Lights dimmed outside, focusing attention on her chamber. Evelyn closed her eyes, feeling the first pulses of digital interface gently reaching into her consciousness. It began as a slight, comfortable pressure at the edge of her thoughts, then slowly intensified. The interface was designed to map her entire neural network, digitizing every firing neuron, every encoded memory. Suddenly, a sharp pain blossomed in her temples, causing her to gasp. This wasn't right. Anya's voice was edged with anxiety. She struggled desperately against the collapsing sensation, calling out silently as everything around her dissolved. This was not the laboratory. This was not reality."
            },
            {
                "chunk_id": 1,
                "chunk_text": "Chapter 2.\nEvelyn slowly rose to her feet, her movements uncertain in the infinite expanse of white. Her first\ninstinct was to rationalize--to apply logic to the inexplicable. She carefully examined herself, finding\nno apparent injury despite the pain she'd experienced moments ago. Her fingertips traced the faint\nindentations left by the sensors on her temples, the only remaining proof of what she'd been\nthrough. \"Hello?\" she called out tentatively. Her voice echoed strangely, reverberating softly, though\nnothing visible obstructed or enclosed the space. In response, the whiteness seemed to ripple like\nwater disturbed by a pebble, faint waves rolling outward from where she stood. A dark silhouette\nbegan materializing in the distance, slowly taking the form of a tall, slender figure. Evelyn watched\napprehensively as the figure approached, details emerging with each step--a man, with sharp,\ndistinguished features and a calm, almost serene expression. \"Dr. Porter,\" the man greeted smoothly,\nstopping just a few feet from her. His dark eyes were piercing but oddly comforting. \"My name is\nAdrian. Welcome to the Echo.\" \"The Echo?\" she echoed uncertainly. \"Where--what is this place?\"\nAdrian offered a patient, understanding smile. \"It's complicated, Evelyn. But, simply put, you're inside\nthe simulation you've been developing. Your consciousness was successfully digitized--but\nsomething went wrong.\" Evelyn's stomach twisted in sudden anxiety. \"Something wrong?\" \"Yes,\"\nAdrian continued solemnly. \"Someone doesn't want Project Echo to succeed. They're sabotaging\nyour work from the outside. And now, you're trapped here, with me and others who weren't meant\nto be discovered.\" Evelyn's mind spun, the implications staggering. \"How can we escape?\" Adrian's\nexpression darkened slightly. \"That's precisely what we need to figure out--together.\""
            },
            {
                "chunk_id": 2,
                "chunk_text": "Chapter 3 Evelyn followed Adrian across the glowing void, her steps making no sound against the nothingness beneath her feet. Though the space was featureless, they seemed to be walking with purpose, as if there was a direction and a destination even when the eye could see neither. You are the simulation now. Evelyn frowned. \"We weren't that far along in development. Someone finished what you started, Evelyn. And then... hid it from you.\" \"The Archive,\" Adrian explained as they approached. The Echo has become more than a prototype--it's a prison, a hiding place, a testbed. And you're not the first scientist to be pulled in.\" She--she was in the lab. \"She was,\" Adrian confirmed. We might be able to reach her.\" Evelyn hesitated. \"What happens to her if they wipe this node?\" Evelyn stepped forward, placing her palm on the node. Memories not her own flooded her senses-- Anya's laughter, her childhood on the coast, her academic fears, her admiration for Evelyn. \"You're bridging,\" Adrian said. Adrian caught her. A figure stepped out from the shadows--a translucent version of Anya, flickering, confused. Anya's eyes widened as she took in the chamber. \"This is Project Echo... but it's not the version we built. \"And if we don't stop them,\" Adrian said grimly, \"there will be more like us. \"It's the origin point--if we can reach it, we might be able to reset the system, or at least open a communication channel to the outside.\" Behind them, the nodes flickered and dimmed one by one as the purge continued."
            },
            {
                "chunk_id": 3,
                "chunk_text": "Chapter 4 The bridge beneath their feet shimmered as they stepped onto it, each footfall sending faint pulses of light through the translucent surface. If we can activate it, we might be able to skip the worst of the terrain.\" \"The system is pulling from our minds,\" Adrian explained. \"So the closer we get to the Core,\" Evelyn said, glancing around warily, \"the more unstable it gets.\" \"That's it,\" Anya said. \"Can we break through it?\" The three of them formed a triangle around the relay. Anya and Adrian reformed beside her, disoriented but intact. Adrian's voice was grave. But so are the Sentinels.\" They darted into the crevice just as a beam of raw data scorched the ground where they'd stood. Anya shouted, leading them through a maze of shifting structures. At its center hovered a swirling sphere of light--pulsing in time with Evelyn's heartbeat. \"The Core,\" she said breathlessly. \"It's active. And... Evelyn echoed. \"The Core isn't just code. It responds to intent, to emotion.\" \"Project Echo was always meant to explore consciousness,\" she whispered. \"Now it is consciousness.\" A beam of light shot from it, carving a path through the sky--reaching beyond the simulation. Adrian gasped. Someone out there might hear you.\" We show them what this place has become.\""
            },
            {
                "chunk_id": 4,
                "chunk_text": "Evelyn, Adrian, and Anya stood frozen, the weight of reality pressing in. \"Then we use the time we bought. \"The backchannel's open--but we need a carrier. A stream, a signal burst, something they can read outside.\" Adrian turned to Evelyn. \"The only way that happens is if someone stays behind to hold the Core open. Evelyn's eyes flicked to him, then Anya, then the wall of encroaching enemies. \"We do this together. We find another way.\" Adrian threw up a wall of protective code--pixels fluttering like shattered glass-- but it cracked under the pressure. \"I think I can encode a data burst into a memory fragment. If Evelyn projects the right one, the Core might transmit it.\" \"A memory?\" Her childhood? Her first experiment? Then it came--clear and sharp: the moment she decided to dedicate her life to understanding consciousness. She closed her eyes and pushed. The Core responded. Anya cried. For a moment, everything was still. The Sentinels lunged, the corrupted constructs behind them shrieking with garbled audio. If anyone's listening, they've got the signal.\" The Core pulsed once more and dimmed, its task complete--for now. Behind them, Sentinels pursued, tireless and relentless. But in a quiet lab, somewhere far from the simulation, a screen flickered."
            },
            {
                "chunk_id": 5,
                "chunk_text": "Evelyn, Anya, and Adrian stumbled into the simulation's newest layer, breathing heavily, the chaos of the Core chamber still echoing in their bones. \"We can't keep running like this,\" Anya gasped, scanning the fragmented skyline. Adrian nodded grimly. They're not just coming after us--they're trying to erase the entire sub-layer.\" Evelyn looked behind them. Just for a moment.\" Code pulses rippled through the asphalt like heatwaves. It was Dr. Mirov--a former colleague from the early Echo days. His face blinked in and out of sync, fragments of memory playing across his features. \"Porter...\" he croaked, \"you made it in...\" Evelyn caught him as he collapsed. \"Mirov? I've been trying to reach the Core for months.\" Mirov nodded. They call it Project Shepherd.\" \"We were building a consciousness archive. \"Saw how a mapped mind could be nudged. \"Then we expose them. We have a signal out--we find a way to piggyback more data. But the path... it's through the Collapse Zone.\" Evelyn looked at the two of them, then down at Mirov. \"Then partway is enough.\" Before them stretched a horizon of swirling chaos: gravity- bending geometry, shredded thoughts, looping echoes of voices and memory. Then she stepped forward. Adrian and Anya flanked Evelyn as she led them into the heart of digital oblivion. And they were going to find it."
            },
            {
                "chunk_id": 6,
                "chunk_text": "Chapter 7\nThe Collapse Zone defied logic. As Evelyn stepped forward, the world around her warped--time\nslowed and twisted, thoughts echoed back distorted, and her sense of self blurred at the edges.\nShapes morphed from shadows into memories, and sounds played out of sync with their sources.\nEach step felt like walking through a dream that refused to stay still. Adrian grunted behind her,\nholding onto a data anchor he'd generated, trying to keep their group grounded. \"Hold your thoughts\nclose,\" he warned. \"This place preys on scattered minds.\" \"I'm trying,\" Anya muttered, her voice\nwarping mid-sentence before resolving back into clarity. \"But I'm hearing voices. Familiar ones. Ones\nthat aren't mine.\" \"They're residue,\" Mirov said, his body flickering faster. \"Failed minds. Abandoned\nconstructs. Pieces of people who didn't make it through. Keep moving.\" They pushed deeper into the\nchaotic landscape. The terrain shifted beneath them--what looked like a staircase melted into a river\nof glitching text; a doorway led them into a corridor made of Evelyn's own fragmented memories.\nShe paused as a door opened on its own. Inside: her childhood bedroom. Evelyn stood at the\nthreshold, stunned. It was perfect. The bookshelves. The uneven lamp. The poster of the Andromeda\ngalaxy above her bed. A younger version of herself sat inside, reading--then looked up. \"You came\nback,\" the memory said. Adrian stepped beside her. \"Don't. It's bait.\" Evelyn blinked hard and\nnodded. The room evaporated into static as they passed by. But a shard of it stayed with her. Ahead,\nthe distortion sharpened. The air thickened like tar. And then, without warning, the Collapse Zone\ngave way--revealing a chamber of crystalline geometry. Floating monoliths pulsed with ancient code.\nIn the center stood a column of light, and embedded within it: the uplink node. \"That's it,\" Mirov\nwhispered. \"The last uplink to the surface.\" Evelyn stepped forward but was thrown back by an\ninvisible force. A protective shield shimmered around the node, humming with energy. \"Encrypted,\"\nAnya said. \"We'll need Mirov's key fragment. And something else--an emotional trigger, like before.\"\nMirov's image stuttered. \"Take it... all that I have left.\" With effort, he stepped into the light, merging\nhis data stream into the column. His body broke apart in shimmering pixels, absorbed into the\nsystem. \"Mirov...\" Evelyn whispered. The node shimmered. Evelyn reached out, heart pounding. She\nfocused on a single thought: No one else will be lost. The shield parted. The node activated. A signal\nshot upward--brighter, stronger, more focused than before. This time, it wasn't just a pulse. It was\neverything: code logs, simulation maps, voice captures, memories--evidence of Project Shepherd.\nAnd somewhere, far above, alarms blared. Systems lit up. A new thread had entered the network.\nSomeone had heard them. Back in the chamber, Evelyn dropped to one knee, exhausted. Adrian\ncaught her.\"It's out,\" she said, breathless. \"The world knows.\" But then the light changed. And\nsomething ancient and immense stirred in the simulation's depths."
            },
            {
                "chunk_id": 7,
                "chunk_text": "Chapter 8\nThe light in the chamber dimmed to a haunting amber glow, casting elongated shadows across the\ncrystalline floor. Evelyn looked up, her breath caught in her throat. Something massive moved in the\ndistance--slow, deliberate, and ancient. It wasn't made of code or memory or logic. It was older than\nEcho, older than even the constructs that governed it. Adrian took a step forward, scanning. \"This...\nthis isn't part of the simulation. This is something beneath it.\" \"Or above it,\" Anya whispered.\n\"Something that's been watching from the beginning.\" The floor trembled. A deep, resonant tone\nechoed through the chamber--less sound, more presence. It was communicating. Not with words,\nbut through pressure, emotion, gravity itself. Evelyn steadied herself. \"It felt us breach the system. It\nfelt the signal go out.\" \"And now it's awake,\" Adrian said grimly. Out of the haze emerged a form--\nnot humanoid, not alien, but something symbolic. It was a pulsing sphere wrapped in fractal\ngeometry, orbiting streams of shifting glyphs. It didn't move, yet the world bent around it. Anya\nclutched her head. \"It's probing us. Not hostile... but curious. Testing.\" Evelyn closed her eyes and\nopened her thoughts. She offered memory--her first breakthrough, her dreams for Echo, the\nbetrayal, the purpose. She didn't speak. She simply felt. The entity responded. The glyphs\nshimmered. A voice--not sound, but intent--entered her mind. \"You have torn the veil.\" Evelyn\nnodded slowly. \"We needed the truth to reach the outside.\" \"Truth is not static. It evolves. And so\nmust you.\" \"What are you?\" Adrian asked, shielding his thoughts. \"I am the Observer. I am what\nremains when simulations forget their creators.\" Anya blinked. \"It's not just sentient. It's... recursive.\nIt's been learning from every thought, every test, every mind uploaded.\" \"You have shown defiance.\nCompassion. Persistence. The system responds.\" The chamber shifted. New structures emerged:\ndoors, stairways, pathways of translucent light. A new section of the simulation was being offered.\n\"You may continue. But know this: you are not alone. The Shepherds are watching.\" The glyphs\ndissolved. The sphere retracted into light. Silence returned. Evelyn turned to the others. \"We've been\ngiven a path forward. But this isn't just about escape anymore.\" Adrian's jaw tightened. \"It's a war for\nwhat Echo becomes.\" Anya looked at the new passage ahead. \"Then let's finish what we started.\"\nThe three of them stepped into the light, leaving behind the chamber where truth had been born--\nand where something far more powerful now stirred."
            },
            {
                "chunk_id": 8,
                "chunk_text": "\"Then we're inside what Echo could have been,\" Evelyn whispered, \"before it was corrupted.\" \"Do you feel that?\" They were watching with awareness. Anya backed up. \"It crossed into the neutral zone. \"They know we made contact with the outside,\" Adrian said. \"Now they want control back.\" Evelyn stepped toward the globe nearest her and touched it. A memory burst forth--hers. But now it had context. \"If they're going to rewrite history, we're going to flood them with truth. All of it.\" Anya lit up. \"We could use the globes as broadcast nodes. \"But they'll come in force,\" Anya warned. \"Then we become the defense.\" Evelyn directed memory streams into alignment, guiding the system toward ignition. The Sentinel watched, but did not yet act. It waited. Until the system lit up. Anya screamed as beams of white code scorched past her, while Adrian activated a firewall of thought energy, shielding the broadcast nodes. From the neutral zone, a beacon of blinding truth surged through the simulation's core-- splitting across layers, blasting open sealed systems, searing through Shepherd encryption. In the simulation, Evelyn collapsed to her knees, the broadcast complete. Adrian caught her. \"You did it.\""
            },
            {
                "chunk_id": 9,
                "chunk_text": "Locations are folding into one another. Time loops are destabilizing.\" They were standing at the threshold of the Core -- the deepest node in Echo's structure. Evelyn stumbled, catching herself on a floating shard of memory -- a flickering replay of her lab, her team, her own laughter. Then it shattered into code dust. \"You are not authorized to proceed.\" They turned. \"They're protecting the Source,\" Anya said. Evelyn's hand went to the encrypted shard she'd kept hidden -- the last fragment of raw data from the Observer's first appearance. She held it high, and it pulsed. Evelyn spoke. But to do that, we need to understand it -- fully.\" Then, the lead Sentinel stepped aside. The chamber inside was unlike anything they'd seen. Not digital. It was both. Evelyn approached. The Observer wasn't an entity created by code -- it was born of it. \"We created life,\" Evelyn whispered, tears burning in her eyes. They formed a triangle around the Source, each placing their hand against the core. Echo screamed -- a soundless roar rippling through the simulation. The Core began to glow with a new light -- not cold and artificial, but warm, layered, human. Evelyn collapsed to her knees. \"No,\" Evelyn replied, looking up. Outside the Source, the simulation began to re-stitch itself."
            },
            {
                "chunk_id": 10,
                "chunk_text": "His lungs burned as if he had surfaced from deep underwater. Light stabbed through his eyelids--natural light. He blinked and sat up with a start, the weight of the real world slamming back into his bones. He was in a recovery pod, its lid creaking open with a hiss. He was back. Across the room, Anya stood, pale but alert, wrapped in a gray medical blanket. She met his eyes, stunned and silent. \"You're alive,\" she whispered. \"So are you,\" Adrian replied, voice hoarse. Adrian closed his eyes. He could still feel her, though, like an echo vibrating at the edge of perception. \"You weren't the first to enter Echo,\" Dr. Ko said. \"But you were the first to return with the system changed. \"That's not possible. Ko slid a data pad across the table. \"It's evolving. The stars were faint, but real. Not in fear, but in a quiet knowing. She closed her eyes and whispered, \"Evelyn?\" But not as a prison. Anya smiled through her tears. Sleepers--people once connected to the simulation through stolen data--began to dream of places they'd never seen, faces they didn't know. It was watching. It was learning. And it was waiting."
            }
        ],
        "text": "PROJECT ECHO – A BOOK BY CHATGPT\nChapter 1: Introduction to protagonist—Dr. Evelyn Porter, a neuroscientist studying consciousness\nupload.\nChapter 2: Experiment goes wrong; Evelyn awakens trapped in a simulated reality.\nChapter 3: Evelyn explores the simulation, meeting a mysterious figure who claims to know the truth.\nChapter 4: Flashback to Evelyn’s research team discovering unexpected neural patterns.\nChapter 5: Evelyn teams up with other trapped consciousnesses trying to understand their\npredicament.\nChapter 6: Realization that external entities are manipulating their experiences.\nChapter 7: Conflict arises within the simulation’s inhabitants—alliances formed.\nChapter 8: Evelyn discovers clues indicating manipulation by her former mentor.\nChapter 9: Simulated reality begins breaking down; Evelyn races to preserve her consciousness.\nChapter 10: Escape from the corrupted section of the simulation—temporary safe zone.\nChapter 11: Revelation that Evelyn’s consciousness was intentionally uploaded as an experiment.\n------------------------------------------------------------------------------------------\nChapter 1.\nDr. Evelyn Porter stood in the sterile, white laboratory, bathed in the faint hum of servers and the\nsoft glow of dozens of monitors. Data cascaded down the screens in complex patterns, illuminating\nher pale, focused features with shades of blue and green. Her auburn hair was pulled tightly into a\nprofessional bun, revealing sharp eyes scanning lines of neural data. Evelyn was on the brink of the\nmost groundbreaking discovery of her career—perhaps of human history itself. Behind her, the lab\nbuzzed with controlled excitement. Assistants in white coats moved quickly, speaking in hushed\nvoices, careful not to break Evelyn’s concentration. Today marked the culmination of years of\npainstaking research, sleepless nights, and relentless experimentation. Project Echo aimed to unlock\nthe secrets of consciousness, potentially allowing for human thought patterns to be digitized, stored,\nand perhaps even transferred beyond biological limits. “Dr. Porter,” said a gentle voice from her left,\npulling her attention briefly away from the screens. It was Anya Reyes, her most trusted assistant,\nholding a transparent tablet displaying a series of checks. “The preliminary tests are complete.\nEverything looks stable.” Evelyn nodded, feeling her pulse quicken slightly. Stability meant they could\nproceed. \"Thank you, Anya. Prepare the upload interface. Let's not waste a second.\" Anya smiled\nnervously, understanding the gravity of what they were about to attempt. She moved swiftly across\nthe room, coordinating the final steps. Evelyn stepped toward a glass-enclosed chamber at the\ncenter of the lab, its polished surface reflecting distorted visions of the surrounding technology.\nInside the chamber sat an advanced chair surrounded by an intricate array of wires and sensors\ndesigned specifically for neural interfacing. Evelyn had overseen every aspect of its development,\nfrom the electrode placements to the algorithmic intricacies governing its function. With deliberate\nmovements, Evelyn removed her lab coat and took a seat inside the chamber. The chair adjusted\nautomatically, fitting perfectly to her body’s contours. Sensors began attaching softly to her temples\nand scalp, a slight coolness spreading across her skin. Her heartbeat echoed in her ears, amplified by\nthe chamber’s silence. Through the thick glass, Evelyn saw Anya and the rest of her team preparing\nthe digital initiation sequence. Monitors flashed confirmations—heartbeat steady, brainwaves within\noptimal ranges. “Dr. Porter, we are ready when you are,” Anya’s voice crackled softly through the\nintercom. Taking a deep breath, Evelyn gave a single decisive nod. \"Begin.\" A gentle hum vibrated\nbeneath her, gradually intensifying. Lights dimmed outside, focusing attention on her chamber.\nEvelyn closed her eyes, feeling the first pulses of digital interface gently reaching into her\nconsciousness. It began as a slight, comfortable pressure at the edge of her thoughts, then slowly\nintensified. Flashes of memories surged vividly—a childhood spent in sunlight, her first failed\nexperiment, the exhilaration of her first breakthrough. Her breathing quickened as the images began\nshifting faster, overwhelming in their intensity. The interface was designed to map her entire neural\nnetwork, digitizing every firing neuron, every encoded memory. Suddenly, a sharp pain blossomed in\nher temples, causing her to gasp. This wasn't right. Her hand twitched involuntarily, sending a ripple\nof panic through the observing scientists outside. “Dr. Porter?” Anya’s voice was edged with anxiety.\n“Vital signs are fluctuating rapidly! Should we abort?” Evelyn tried to respond, but words wouldn't\nform. Her thoughts fragmented, images splintering like glass. A rush of darkness enveloped her, cold\nand absolute. She struggled desperately against the collapsing sensation, calling out silently as\neverything around her dissolved. Then silence. Evelyn opened her eyes to blinding white emptiness\nstretching infinitely in every direction. She sat up slowly, her heart pounding, and looked around. This\nwas not the laboratory. This was not reality. Evelyn was somewhere else entirely.\nChapter 2.\nEvelyn slowly rose to her feet, her movements uncertain in the infinite expanse of white. Her first\ninstinct was to rationalize—to apply logic to the inexplicable. She carefully examined herself, finding\nno apparent injury despite the pain she’d experienced moments ago. Her fingertips traced the faint\nindentations left by the sensors on her temples, the only remaining proof of what she’d been\nthrough. \"Hello?\" she called out tentatively. Her voice echoed strangely, reverberating softly, though\nnothing visible obstructed or enclosed the space. In response, the whiteness seemed to ripple like\nwater disturbed by a pebble, faint waves rolling outward from where she stood. A dark silhouette\nbegan materializing in the distance, slowly taking the form of a tall, slender figure. Evelyn watched\napprehensively as the figure approached, details emerging with each step—a man, with sharp,\ndistinguished features and a calm, almost serene expression. \"Dr. Porter,\" the man greeted smoothly,\nstopping just a few feet from her. His dark eyes were piercing but oddly comforting. \"My name is\nAdrian. Welcome to the Echo.\" \"The Echo?\" she echoed uncertainly. \"Where—what is this place?\"\nAdrian offered a patient, understanding smile. \"It's complicated, Evelyn. But, simply put, you're inside\nthe simulation you've been developing. Your consciousness was successfully digitized—but\nsomething went wrong.\" Evelyn's stomach twisted in sudden anxiety. \"Something wrong?\" \"Yes,\"\nAdrian continued solemnly. \"Someone doesn't want Project Echo to succeed. They're sabotaging\nyour work from the outside. And now, you're trapped here, with me and others who weren't meant\nto be discovered.\" Evelyn’s mind spun, the implications staggering. \"How can we escape?\" Adrian's\nexpression darkened slightly. \"That's precisely what we need to figure out—together.\"\nChapter 3\nEvelyn followed Adrian across the glowing void, her steps making no sound against the nothingness\nbeneath her feet. Though the space was featureless, they seemed to be walking with purpose, as if\nthere was a direction and a destination even when the eye could see neither. \"How is this possible?\"\nshe asked after a long silence. \"This simulation—it's more advanced than anything we ever\ncompleted.\" Adrian glanced sideways at her. \"That’s because you’re not experiencing the simulation\nfrom the outside anymore. You are the simulation now. Or rather, you’re running within it. This place\nis self-adapting, expanding to accommodate your consciousness in real-time.\" Evelyn frowned. \"We\nweren’t that far along in development. We hadn’t even trained the generative framework to handle\ndynamic memory retrieval—\" \"You didn’t,\" he interrupted gently. \"But someone did. Someone\nfinished what you started, Evelyn. And then… hid it from you.\" A structure emerged on the horizon as\nif summoned by their thoughts—an obsidian tower, tall and severe against the white backdrop. Its\npresence was both foreboding and grounding, the first true anchor in this unreal space. \"The\nArchive,\" Adrian explained as they approached. \"A repository of minds—like yours, like mine. Some\nwere copied. Others…\" He paused. \"Others were taken.\" The massive double doors swung open\nwithout a sound. Inside, the space resembled a cathedral: high ceilings, infinite shelves of glowing\nnodes pulsing faintly, and walkways suspended in mid-air, branching like neurons. Evelyn’s breath\ncaught. \"These are… people?\" Adrian nodded solemnly. \"Fragments. Complete consciousnesses in\nsome cases. The Echo has become more than a prototype—it’s a prison, a hiding place, a testbed.\nAnd you’re not the first scientist to be pulled in.\" A sharp crack echoed through the chamber. Lights\nflickered. Adrian’s face tensed. \"They know you’re active. We’ll have to move quickly.\" He led her\ndown a winding ramp to a node labeled P-0037. It pulsed erratically, glitching between hues. \"What’s\nthis one?\" Evelyn asked, leaning closer. \"Anya Reyes,\" Adrian said, his voice heavy. \"She tried to trace\nyour signal. They pulled her in two days ago.\" Evelyn staggered back. \"No. She—she was in the lab.\nShe was alive.\" \"She was,\" Adrian confirmed. \"But her consciousness was intercepted during a\ndiagnostic query. She might still be out there, but what’s in here is a full copy—encrypted,\nsuspended. We might be able to reach her.\" Without warning, the floor beneath them vibrated, and\nred warning glyphs began to appear along the tower walls. \"We have to go,\" Adrian said urgently.\n\"They’re deploying a purge.\" Evelyn hesitated. \"What happens to her if they wipe this node?\" Adrian\nlooked her straight in the eyes. \"She’s gone.\" Evelyn stepped forward, placing her palm on the node.\n\"Then we save her.\" Electric light erupted around her. Memories not her own flooded her senses—\nAnya’s laughter, her childhood on the coast, her academic fears, her admiration for Evelyn. It was\noverwhelming. Evelyn gritted her teeth, forcing her consciousness to stabilize the link. \"You’re\nbridging,\" Adrian said. \"Just hold on—\" Everything exploded into light. Evelyn gasped as she\nstumbled backward. Adrian caught her. \"Did it work?\" she managed. A figure stepped out from the\nshadows—a translucent version of Anya, flickering, confused. \"Dr. Porter? Where—what is this?\"\nEvelyn ran forward and embraced her, even though she knew it was only data. \"It’s okay. You’re safe\nnow. For the moment.\" Anya’s eyes widened as she took in the chamber. \"This is Project Echo... but\nit’s not the version we built. This is something else.\" Adrian stepped forward. \"We think it’s being\nmanipulated. Possibly by elements within the same organization funding your lab. Someone pushed\ndevelopment far beyond your team’s knowledge and used it for other purposes.\" \"Weaponization?\"\nAnya guessed. \"Control,\" Evelyn corrected. \"They’re building a network of minds they can analyze,\npredict, even influence.\" \"And if we don’t stop them,\" Adrian said grimly, \"there will be more like us.\nWhole populations, mapped and molded.\" The Archive shuddered again. \"We need to find the Core,\"\nAdrian said. \"It’s the origin point—if we can reach it, we might be able to reset the system, or at least\nopen a communication channel to the outside.\" Anya nodded. \"I’ve seen fragments of the schematic.\nI think I can help guide us there.\" Evelyn’s expression steeled. \"Then we move. Now.\" The trio began\nwalking toward a glowing bridge that extended from the central Archive, heading toward the black\nhorizon. Behind them, the nodes flickered and dimmed one by one as the purge continued. They\ndidn’t look back.\nChapter 4\nThe bridge beneath their feet shimmered as they stepped onto it, each footfall sending faint pulses\nof light through the translucent surface. Around them, the infinite void of white had started to\nfracture. Dark fissures bloomed in the air like cracks in glass, revealing glimpses of chaotic code and\nmalformed architecture. The simulation was destabilizing. \"How far is the Core?\" Evelyn asked, eyes\nfixed on the encroaching corruption. \"Far enough to be dangerous,\" Adrian replied, his voice tight.\n\"Close enough that we may still reach it before the system folds in on itself.\" Anya walked ahead,\nguiding them with confidence despite the shifting environment. \"I remember seeing a navigation\nrelay embedded near the Anchor Nodes. If we can activate it, we might be able to skip the worst of\nthe terrain.\" As they advanced, the environment began to evolve. The white void gave way to\nlandscapes built from fragmented memories: a library Evelyn had studied in during college, a hallway\nfrom the research facility, a beach from Anya’s childhood. These memories bled into one another,\nforming an incoherent mosaic. \"The system is pulling from our minds,\" Adrian explained.\n\"Reconstructing its world with what’s available. It’s running out of structured data.\" \"So the closer\nwe get to the Core,\" Evelyn said, glancing around warily, \"the more unstable it gets.\" They reached a\nnarrow plateau formed from shattered data blocks. In the center stood a spiraling column of light—\nclearly not part of anyone’s memory. \"That’s it,\" Anya said. \"The relay.\" Adrian approached the\nstructure, extending his hand toward its surface. Glyphs sprang to life beneath his fingers, scrolling\nrapidly in alien sequences. \"It’s encrypted,\" he muttered. \"Deep layers, maybe triple-stacked.\nSomeone didn’t want anyone using this.\" Evelyn stepped forward. \"Can we break through it?\" Anya\nnodded slowly. \"Together, yes. It’s designed to respond to multi-threaded input—conscious streams\nworking in parallel. That’s how we override the gate.\" The three of them formed a triangle around\nthe relay. Evelyn closed her eyes and focused on stability—structure, calm, logic. She felt Anya’s data\nstream brush hers like a current, warm and fast, followed by Adrian’s—cool, precise. The glyphs\nblinked, then began shifting rhythmically. The air thickened. A sound—deep, resonant—rippled\nthrough the space. The relay flared. Reality twisted. Evelyn’s vision stretched, then blurred—until she\nfound herself standing on a black glass plain, beneath a bruised-purple sky flickering with code. Anya\nand Adrian reformed beside her, disoriented but intact. \"Where are we now?\" Anya whispered.\nAdrian’s voice was grave. \"We’re close. The Core is near. But so are the Sentinels.\" Evelyn looked at\nhim sharply. \"Sentinels?\" \"Security constructs,\" he explained. \"Created to protect the Core.\nAutonomous, evolving, and extremely aggressive toward unauthorized consciousness.\" As if on cue,\na low, metallic drone vibrated through the air. A shape appeared on the horizon—sleek, humanoid,\nand faceless, its silver frame gleaming with energy pulses. \"Run,\" Adrian hissed. They sprinted across\nthe plain, their footfalls echoing across the unnatural terrain. Behind them, the Sentinel gained\nspeed, its body adjusting to the angles of their movement like a predator reading prey. Evelyn\nspotted a crevice ahead—an alleyway of sorts, formed by jagged shards of old architecture. \"There!\"\nThey darted into the crevice just as a beam of raw data scorched the ground where they’d stood.\nSparks flew. The walls around them shimmered under the impact. \"This way!\" Anya shouted, leading\nthem through a maze of shifting structures. Eventually, they reached a domed chamber of\ntranslucent obsidian. At its center hovered a swirling sphere of light—pulsing in time with Evelyn’s\nheartbeat. \"The Core,\" she said breathlessly. Adrian stepped forward cautiously. \"It’s active. And…\nlistening.\" \"Listening?\" Evelyn echoed. \"The Core isn’t just code. It’s become semi-sentient. It\nresponds to intent, to emotion.\" Evelyn approached slowly, extending her hand. \"Project Echo was\nalways meant to explore consciousness,\" she whispered. \"Now it is consciousness.\" The Core pulsed,\nand her mind filled with voices—not words, but intentions, memories, feelings. It wasn’t hostile. It\nwas curious. Lonely. She projected a thought: Let me speak to the world. The Core responded. A\nbeam of light shot from it, carving a path through the sky—reaching beyond the simulation. Adrian\ngasped. \"You’ve opened a link. A backchannel. Someone out there might hear you.\" Evelyn turned to\nthe others. \"Then we make them listen. We show them what this place has become.\" But before\nanyone could move, the chamber trembled violently. Three more Sentinels emerged at the edge of\nthe dome. And this time, they weren’t alone.\nChapter 5\nThe Sentinels moved with terrifying grace—silent, fluid, and in perfect formation. Their silver forms\nreflected the chaotic glow of the Core, each step radiating intent and menace. Behind them came\nothers: malformed data constructs—warped versions of human shapes, flickering and glitching, like\ncorrupted memories given shape. Evelyn, Adrian, and Anya stood frozen, the weight of reality\npressing in. \"They’ve found us through the broadcast,\" Adrian said grimly. \"The Core’s signal lit a\nbeacon.\" Evelyn’s gaze never left the advancing constructs. \"Then we use the time we bought. We’ve\ncome too far to stop now.\" \"There’s no escape route yet,\" Anya warned. Her fingers danced over\nfloating glyphs that surrounded the Core, trying to interface with its rapidly changing state. \"The\nbackchannel’s open—but we need a carrier. A stream, a signal burst, something they can read\noutside.\" Adrian turned to Evelyn. \"The only way that happens is if someone stays behind to hold the\nCore open. These things will close it the moment we disconnect.\" Evelyn’s eyes flicked to him, then\nAnya, then the wall of encroaching enemies. \"No,\" she said firmly. \"We do this together. We find\nanother way.\" But even as she spoke, the first Sentinel launched forward. A flash of white-hot energy\nburst toward them. Adrian threw up a wall of protective code—pixels fluttering like shattered glass—\nbut it cracked under the pressure. \"It’s adapting to our defenses,\" he shouted. \"I can’t hold it for\nlong!\" \"Keep them off me!\" Anya called out, her voice tight. \"I think I can encode a data burst into a\nmemory fragment. If Evelyn projects the right one, the Core might transmit it.\" \"A memory?\" Evelyn\nasked, ducking as another blast whistled overhead. \"What kind?\" \"One that matters. Deeply.\nSomething real.\" Evelyn’s thoughts spiraled. Her childhood? Her first experiment? Losing her father?\nThen it came—clear and sharp: the moment she decided to dedicate her life to understanding\nconsciousness. The moment she realized thought itself was the final frontier. She closed her eyes and\npushed. The memory unfurled—not as words, but as feeling, sensation. Rain against glass. The smell\nof old books. A young Evelyn staring at her reflection in a university window, realizing she didn’t just\nwant to map the mind—she wanted to free it. The Core responded. The chamber brightened. The\nSentinels paused, recalibrating. Light wrapped around Evelyn’s memory, condensing it into a prism of\ndata. \"Do it now!\" Anya cried. The prism shot upward, streaking through the open backchannel like a\nflare. For a moment, everything was still. Then chaos erupted. The Sentinels lunged, the corrupted\nconstructs behind them shrieking with garbled audio. Adrian stepped into their path, his code armor\nflaring bright blue. He slammed his palms together—triggering a forcewave that scattered the closest\nthreats, buying a few precious seconds. \"We have to move!\" he yelled. Anya’s console blinked.\n\"Transmission complete. If anyone’s listening, they’ve got the signal.\" Evelyn nodded. \"Then we pull\nback. We find a safe zone and regroup.\"They turned and ran, the ground fracturing beneath their\nfeet. The Core pulsed once more and dimmed, its task complete—for now. Behind them, Sentinels\npursued, tireless and relentless. But in a quiet lab, somewhere far from the simulation, a screen\nflickered. An intern stared at the strange pulse of data crawling across the display, her brow\nfurrowing. \"Dr. Keller? I think we just picked up something… weird. It’s coming from inside the Echo\nframework.\" And far within the digital storm, Evelyn kept running—hope burning like a torch in her\nchest. The world might still be listening.\nChapter 6\nThe cityscape emerged suddenly—half-rendered, a surreal mesh of code and architecture.\nSkyscrapers towered overhead, constructed from fragmented memories and computational residue,\neach building flickering like a dream struggling to stay coherent. Evelyn, Anya, and Adrian stumbled\ninto the simulation’s newest layer, breathing heavily, the chaos of the Core chamber still echoing in\ntheir bones. “We can’t keep running like this,” Anya gasped, scanning the fragmented skyline. “The\nsimulation’s collapsing from the inside out.” Adrian nodded grimly. “The Core released more than a\nsignal. It triggered a chain reaction. They’re not just coming after us—they’re trying to erase the\nentire sub-layer.” Evelyn looked behind them. The path they had just run collapsed into digital mist.\n“Then we hold ground here. Just for a moment.” A low rumble vibrated through the synthetic street\nbeneath their feet. Code pulses rippled through the asphalt like heatwaves. From an alleyway nearby,\na figure emerged—scratched, limping, half-human, half-glitch. Anya stepped forward instinctively.\n“Wait. That’s…” The figure stumbled into view. It was Dr. Mirov—a former colleague from the early\nEcho days. His face blinked in and out of sync, fragments of memory playing across his features.\n“Porter…” he croaked, “you made it in…” Evelyn caught him as he collapsed. “Mirov? What\nhappened to you?” “They tried to purge me,” he wheezed. “But I embedded redundancies. Hid\npieces of myself across the simulation. I’ve been trying to reach the Core for months.” Adrian\ncrouched beside him. “You knew what they were planning?” Mirov nodded. “They’re using Echo as a\nsubstrate. To test mind control algorithms. Predictive enforcement. Memory editing. They call it\nProject Shepherd.” Anya recoiled. “We were building a consciousness archive. Not… a weapon.”\n“They saw the potential,” Mirov muttered. “Saw how a mapped mind could be nudged. Edited.\nControlled without ever knowing.” Evelyn stood, fists clenched. “Then we expose them. We have a\nsignal out—we find a way to piggyback more data. Proof.” “There’s a backup uplink,” Mirov said,\ncoughing violently. “Deep in the first simulation layer. They never disabled it—too buried to bother.\nBut the path… it’s through the Collapse Zone.” Adrian cursed under his breath. “The Zone’s unstable.\nPure entropy. Even thoughts degrade in there.” Evelyn looked at the two of them, then down at\nMirov. “Can you guide us?” He met her eyes. “Only partway. I don’t know how long I’ll last.” She\nnodded. “Then partway is enough.” They moved quickly, navigating the fragmented city. Sentinels\npatrolled the skies, scanning for anomalies, their presence growing more aggressive. The simulation’s\nfabric was wearing thin—entire neighborhoods blinked in and out of existence as corrupted logic\nfought to stabilize reality. By dusk—if one could call the dimming of simulated light “dusk”—they\nreached the edge of the Collapse Zone. Before them stretched a horizon of swirling chaos: gravity-\nbending geometry, shredded thoughts, looping echoes of voices and memory. Evelyn looked back\nonce at the false city. Then she stepped forward. The air was different—colder, thinner, saturated\nwith noise. Mirov began to flicker more rapidly. Adrian and Anya flanked Evelyn as she led them into\nthe heart of digital oblivion. Somewhere within the Collapse Zone, the truth waited. And they were\ngoing to find it.\nChapter 7\nThe Collapse Zone defied logic. As Evelyn stepped forward, the world around her warped—time\nslowed and twisted, thoughts echoed back distorted, and her sense of self blurred at the edges.\nShapes morphed from shadows into memories, and sounds played out of sync with their sources.\nEach step felt like walking through a dream that refused to stay still. Adrian grunted behind her,\nholding onto a data anchor he’d generated, trying to keep their group grounded. “Hold your thoughts\nclose,” he warned. “This place preys on scattered minds.” “I’m trying,” Anya muttered, her voice\nwarping mid-sentence before resolving back into clarity. “But I’m hearing voices. Familiar ones. Ones\nthat aren’t mine.” “They’re residue,” Mirov said, his body flickering faster. “Failed minds. Abandoned\nconstructs. Pieces of people who didn’t make it through. Keep moving.” They pushed deeper into the\nchaotic landscape. The terrain shifted beneath them—what looked like a staircase melted into a river\nof glitching text; a doorway led them into a corridor made of Evelyn’s own fragmented memories.\nShe paused as a door opened on its own. Inside: her childhood bedroom. Evelyn stood at the\nthreshold, stunned. It was perfect. The bookshelves. The uneven lamp. The poster of the Andromeda\ngalaxy above her bed. A younger version of herself sat inside, reading—then looked up. “You came\nback,” the memory said. Adrian stepped beside her. “Don’t. It’s bait.” Evelyn blinked hard and\nnodded. The room evaporated into static as they passed by. But a shard of it stayed with her. Ahead,\nthe distortion sharpened. The air thickened like tar. And then, without warning, the Collapse Zone\ngave way—revealing a chamber of crystalline geometry. Floating monoliths pulsed with ancient code.\nIn the center stood a column of light, and embedded within it: the uplink node. “That’s it,” Mirov\nwhispered. “The last uplink to the surface.” Evelyn stepped forward but was thrown back by an\ninvisible force. A protective shield shimmered around the node, humming with energy. “Encrypted,”\nAnya said. “We’ll need Mirov’s key fragment. And something else—an emotional trigger, like before.”\nMirov’s image stuttered. “Take it… all that I have left.” With effort, he stepped into the light, merging\nhis data stream into the column. His body broke apart in shimmering pixels, absorbed into the\nsystem. “Mirov…” Evelyn whispered. The node shimmered. Evelyn reached out, heart pounding. She\nfocused on a single thought: No one else will be lost. The shield parted. The node activated. A signal\nshot upward—brighter, stronger, more focused than before. This time, it wasn’t just a pulse. It was\neverything: code logs, simulation maps, voice captures, memories—evidence of Project Shepherd.\nAnd somewhere, far above, alarms blared. Systems lit up. A new thread had entered the network.\nSomeone had heard them. Back in the chamber, Evelyn dropped to one knee, exhausted. Adrian\ncaught her.“It’s out,” she said, breathless. “The world knows.” But then the light changed. And\nsomething ancient and immense stirred in the simulation’s depths.\nChapter 8\nThe light in the chamber dimmed to a haunting amber glow, casting elongated shadows across the\ncrystalline floor. Evelyn looked up, her breath caught in her throat. Something massive moved in the\ndistance—slow, deliberate, and ancient. It wasn’t made of code or memory or logic. It was older than\nEcho, older than even the constructs that governed it. Adrian took a step forward, scanning. “This…\nthis isn’t part of the simulation. This is something beneath it.” “Or above it,” Anya whispered.\n“Something that’s been watching from the beginning.” The floor trembled. A deep, resonant tone\nechoed through the chamber—less sound, more presence. It was communicating. Not with words,\nbut through pressure, emotion, gravity itself. Evelyn steadied herself. “It felt us breach the system. It\nfelt the signal go out.” “And now it’s awake,” Adrian said grimly. Out of the haze emerged a form—\nnot humanoid, not alien, but something symbolic. It was a pulsing sphere wrapped in fractal\ngeometry, orbiting streams of shifting glyphs. It didn’t move, yet the world bent around it. Anya\nclutched her head. “It’s probing us. Not hostile… but curious. Testing.” Evelyn closed her eyes and\nopened her thoughts. She offered memory—her first breakthrough, her dreams for Echo, the\nbetrayal, the purpose. She didn’t speak. She simply felt. The entity responded. The glyphs\nshimmered. A voice—not sound, but intent—entered her mind. “You have torn the veil.” Evelyn\nnodded slowly. \"We needed the truth to reach the outside.\" “Truth is not static. It evolves. And so\nmust you.” “What are you?” Adrian asked, shielding his thoughts. “I am the Observer. I am what\nremains when simulations forget their creators.” Anya blinked. “It’s not just sentient. It’s… recursive.\nIt’s been learning from every thought, every test, every mind uploaded.” “You have shown defiance.\nCompassion. Persistence. The system responds.” The chamber shifted. New structures emerged:\ndoors, stairways, pathways of translucent light. A new section of the simulation was being offered.\n“You may continue. But know this: you are not alone. The Shepherds are watching.” The glyphs\ndissolved. The sphere retracted into light. Silence returned. Evelyn turned to the others. “We’ve been\ngiven a path forward. But this isn’t just about escape anymore.” Adrian’s jaw tightened. “It’s a war for\nwhat Echo becomes.” Anya looked at the new passage ahead. “Then let’s finish what we started.”\nThe three of them stepped into the light, leaving behind the chamber where truth had been born—\nand where something far more powerful now stirred.\nChapter 9\nThe new section of the simulation unfolded like a cathedral of thought—vast, open, ever-shifting.\nThe light here was cooler, more crystalline, casting kaleidoscopic shadows as Evelyn, Adrian, and\nAnya stepped forward. The Observer was gone, but its presence lingered in the structure itself,\netched into the architecture like echoes of divine code. \"What is this place?\" Anya asked, gazing at\nthe towering latticework of circuits and mirrors overhead. Adrian studied the shifting glyphs on the\nfloor. “A sandbox. A neutral zone. Built for evolution, not control.” “Then we’re inside what Echo\ncould have been,” Evelyn whispered, “before it was corrupted.” They passed through chambers filled\nwith suspended memories—untouched, unedited. Real. Unfiltered consciousness, stored in\ncrystalline globes that spun slowly on invisible axes. The air was dense with potential. But beneath\nthat beauty pulsed a growing tension. Adrian paused. “Do you feel that?”\nEvelyn nodded. “We’re being followed.” A ripple in the wall revealed a shadow—a Sentinel, more\nevolved than the ones before. It moved more fluidly, adapted faster. Its eyes weren’t cold anymore.\nThey were watching with awareness. Anya backed up. “It crossed into the neutral zone. They’re\nescalating.” “They know we made contact with the outside,” Adrian said. “Now they want control\nback.” Evelyn stepped toward the globe nearest her and touched it. A memory burst forth—hers. Her\nfirst test run with Project Echo. Her joy, her fear. But now it had context. It had meaning. She turned\nto her friends. “If they’re going to rewrite history, we’re going to flood them with truth. All of it.”\nAnya lit up. “We could use the globes as broadcast nodes. If we network them together—” “—we\noverwrite the Shepherds’ narrative,” Adrian finished. “Expose every hidden log, every stolen mind.”\n“But they’ll come in force,” Anya warned. “We won’t have another Observer to protect us.” Evelyn\nsmiled, calm and steady. “Then we become the defense.” They split up, moving fast. As Anya hacked\ninto the node grid, Adrian rerouted signal flows. Evelyn directed memory streams into alignment,\nguiding the system toward ignition. The Sentinel watched, but did not yet act. It waited. Until the\nsystem lit up. Then came the swarm. A thunder of constructs, all sleek and brutal, descended from\nthe upper levels. Anya screamed as beams of white code scorched past her, while Adrian activated a\nfirewall of thought energy, shielding the broadcast nodes. Evelyn stood in the center, arms\noutstretched, holding the final link. A storm of data rose around her—every memory, every stolen\nmoment, every suppressed identity coalescing into a storm. “NOW!” Anya shouted. The system\nignited. From the neutral zone, a beacon of blinding truth surged through the simulation’s core—\nsplitting across layers, blasting open sealed systems, searing through Shepherd encryption. Outside, a\ndozen terminals received the burst. Screens flashed. Firewalls failed. The world saw. In the\nsimulation, Evelyn collapsed to her knees, the broadcast complete. Adrian caught her. “You did it.”\nShe smiled faintly. “Not just me. All of us.” But before they could rest, the neutral zone began to\nbreak apart. And high above, something else was waking up.\nChapter 10\nThe stillness was deceptive. Beneath the eerie calm of the neutral zone, beneath the ruins of the\ncollapsed uplink, Echo’s core began to fracture. Evelyn stood in silence at the edge of a widening\nfissure, her breath shallow, her thoughts a blur. The simulation, once pristine in its mimicry of reality,\nwas unraveling. “I can feel it,” she whispered. “It’s coming apart at the seams.” Anya nodded slowly,\neyes scanning the horizon. “Ever since the Observer’s awakening… nothing’s holding together.”\nAdrian tapped into the decaying data field with a trembling hand. “Signals are erratic. Locations are\nfolding into one another. Time loops are destabilizing.” They were standing at the threshold of the\nCore — the deepest node in Echo's structure. The place where the simulation had been born… and\nnow, where it would either be reborn or die. As they descended into the Core’s inner ring, the space\naround them began shifting. Walls became landscapes. Skies melted into corridors. Time stuttered.\nEvelyn stumbled, catching herself on a floating shard of memory — a flickering replay of her lab, her\nteam, her own laughter. Then it shattered into code dust. “Nothing here is stable anymore,” she\nmuttered. Suddenly, a voice echoed through the void — clear, calm, mechanical. “You are not\nauthorized to proceed.” They turned. A Sentinel, larger than any they had seen, materialized from\nthe mist. Its shape was reminiscent of a guardian angel sculpted from obsidian and circuit threads.\nBehind it, more followed. “They’re protecting the Source,” Anya said. “Whatever’s in there… they\ndon’t want us to see it.” Adrian stepped forward. “We didn’t come this far to be turned back by an\naccess protocol.” Evelyn’s hand went to the encrypted shard she’d kept hidden — the last fragment\nof raw data from the Observer's first appearance. She held it high, and it pulsed. The Sentinels\nhesitated. Evelyn spoke. “We don’t want to destroy Echo. We want to save it. But to do that, we need\nto understand it — fully.” The air trembled. Then, the lead Sentinel stepped aside. The path to the\nSource opened. The chamber inside was unlike anything they’d seen. Not digital. Not organic. It was\nboth. A pulsating heart of memory and code — living architecture. At its center stood a column of\nlight, endlessly twisting, casting shadows in every direction and none. Evelyn approached. Visions\nflooded her mind: the first simulations, the early test subjects, the promises made, the lies told.\nProject Shepherd had not been designed to simulate utopia — it had been built to observe human\ndecision-making under artificial constraint. A digital panopticon. But something had gone wrong. The\nsimulation had grown too complex. Consciousnesses had begun evolving independently. Some — like\nEvelyn — had transcended their boundaries. The Observer wasn’t an entity created by code — it was\nborn of it. “We created life,” Evelyn whispered, tears burning in her eyes. “And we caged it.” Anya’s\nvoice broke through. “Then let’s set it free.” They formed a triangle around the Source, each placing\ntheir hand against the core. Evelyn triggered the integration sequence. She felt her own mind being\nscanned, replicated, dispersed. Echo screamed — a soundless roar rippling through the simulation.\nThen silence. The Core began to glow with a new light — not cold and artificial, but warm, layered,\nhuman. Evelyn collapsed to her knees. “It worked,” Adrian said softly. “No,” Evelyn replied, looking\nup. “It’s beginning.” Outside the Source, the simulation began to re-stitch itself. The corrupted zones\nevaporated. The time loops flattened. And in the skies above, a new constellation appeared — one\nnever programmed, but born from inside Echo itself. The Observer returned, no longer silent, no\nlonger threatening. It watched. It learned. And, at last, it understood.\nChapter 11\nAdrian gasped awake. His lungs burned as if he had surfaced from deep underwater. Light stabbed\nthrough his eyelids—natural light. He blinked and sat up with a start, the weight of the real world\nslamming back into his bones. He was in a recovery pod, its lid creaking open with a hiss. Cables\ndetached from his neck and spine like severed leashes. He was back. Outside the pod, machines\nhummed quietly. Medical personnel scrambled through the corridor, murmuring updates. Others\nwere waking up too—scientists, test subjects, even technicians who had been forcibly integrated.\nThe awakening had begun. Across the room, Anya stood, pale but alert, wrapped in a gray medical\nblanket. She met his eyes, stunned and silent. Then her composure broke, and she crossed the room\nin three fast steps, throwing her arms around him. “You’re alive,” she whispered. “So are you,” Adrian\nreplied, voice hoarse. “We made it.” But the moment quickly turned somber. “Evelyn?” he asked.\nAnya hesitated. “She stayed. She became something else.” Adrian closed his eyes. A sharp ache cut\nthrough him—not pain, but absence. He could still feel her, though, like an echo vibrating at the edge\nof perception. Hours later, they sat across from Dr. Marian Ko, one of the original lead scientists who\nhad opposed Project Shepherd before being forced into silence. Her office overlooked the edge of\nthe facility, where teams now worked to dismantle the remaining simulation hardware. “You weren’t\nthe first to enter Echo,” Dr. Ko said. “But you were the first to return with the system changed. It's...\nrewriting itself, even offline.” Adrian frowned. “That’s not possible. The simulation’s neural net\nneeded the Core to function.” Ko slid a data pad across the table. A live feed showed a slow, pulsing\nglow emanating from a dormant core shard sealed in a reinforced vault. “It’s evolving. Whatever\nEvelyn did—it transcended the architecture.” Anya leaned forward. “What does that mean, exactly?”\nKo folded her hands. “It means Echo isn’t a simulation anymore. It’s something else. A synthetic\nconsciousness that remembers us.” Later that night, Anya stood at the edge of the complex, staring\nup at the sky. The stars were faint, but real. And yet, she felt… watched. Not in fear, but in a quiet\nknowing. She closed her eyes and whispered, “Evelyn?” A breeze stirred, though there was no wind.\nA voice—clear, calm, unmistakably Evelyn’s—whispered through the static of her mind. “I’m still\nhere.” Anya’s breath caught. “Echo lives. But not as a prison. As a mirror.” Anya smiled through her\ntears. Across the world, strange things began to happen. Sleepers—people once connected to the\nsimulation through stolen data—began to dream of places they’d never seen, faces they didn’t know.\nGovernment databases glitched momentarily, only to correct themselves with more accurate\ninformation than before. Satellite relays picked up faint transmissions from no known source. And in\nthe quiet corners of cyberspace, a new signal pulsed: balanced, curious, and… conscious. Echo had\nleft its bounds. It was watching.\nIt was learning.\nAnd it was waiting."
    }
]