{
    "PrimaryThemaCodes": {
        "Code" : [
            {
                "CodeValue": "A",
                "CodeDescription": "The Arts",
                "CodeNotes": "Use all A* codes for: specialist and general adult titles, including both highly illustrated and more text-based works. For a hobby or recreational approach. Prefer: a WF* code as the main subject and supplement with A* code(s) where appropriate. Use all A* codes with: other subject categories and qualifiers as appropriate, in particular STYLE 6*, plus PLACE 1* and TIME PERIOD 3* Qualifiers"
            },
            {
                "CodeValue": "C",
                "CodeDescription": "Language and Linguistics",
                "CodeNotes": "Use all C* codes for: specialist and general adult titles. DO NOT USE: code ‘C’ itself, but select specific categories from section C*. Use all C* codes with: other subject categories and qualifiers where appropriate, in particular LANGUAGE 2* Qualifiers plus PLACE 1*, TIME PERIOD 3* and EDUCATIONAL PURPOSE 4* Qualifiers"
            },
            {
                "CodeValue": "D",
                "CodeDescription": "Biography, Literature and Literary studies",
                "CodeNotes": "Use all D* codes for: specialist and general adult titles. DO NOT USE: code ‘D’ itself, but select specific categories from section D*. Use all D* codes with: other subject categories and qualifiers where appropriate, in particular STYLE 6*, PLACE 1*, LANGUAGE 2*, TIME PERIOD 3* or INTEREST 5* Qualifiers"
            },
            {
                "CodeValue": "F",
                "CodeDescription": "Fiction",
                "CodeNotes": "Use all F* codes for: fictional stories, narratives or works of literature published as novels, novellas, short stories or in any other form. DO NOT USE: code ‘F’ itself, but select specific categories from section F*. Use all F* codes with: other subject categories and qualifiers where appropriate, in particular PLACE 1* and/or TIME PERIOD 3* Qualifiers where these aspects are particularly pertinent and significant. N.B. F* codes may be used with appropriate non-fiction categories to indicate key settings or topics of the narrative, but for all adult fiction the primary category must be an F* code. FX* codes may be used to indicate a strong underlying theme. Also use with 5H*, 5J*, 5L* or 5P* qualifiers when these represent a significant topic or part of the appeal of the narrative. FY* codes may be used to indicate special features of a fiction title"
            },
            {
                "CodeValue": "G",
                "CodeDescription": "Reference, Information and Interdisciplinary subjects",
                "CodeNotes": "Use all G* codes for: specialist and general adult titles. DO NOT USE: code ‘G’ itself, but select specific categories from section G*. Use all G* codes with: other subject categories and qualifiers where appropriate"
            },
            {
                "CodeValue": "J",
                "CodeDescription": "Society and Social Sciences",
                "CodeNotes": "Use all J* codes for: specialist and some general adult titles, but see also V* codes for practical approaches to many topics. Use all J* codes with: other subject categories and qualifiers where appropriate. In J* use the most appropriate code(s) available, as many social sciences are broad topics that can have many alternative terms or names"
            },
            {
                "CodeValue": "K",
                "CodeDescription": "Economics, Finance, Business and Management",
                "CodeNotes": "Use all K* codes for: specialist (professional and academic) and general adult titles, but see also VS* codes for practical approaches to many topics. Use all K* codes with: other subject categories and qualifiers where appropriate in particular EDUCATIONAL PURPOSE 4* qualifiers for vocational, professional or apprenticeship style education titles, 4TM for revision and study guides, 4CP for vocational or professional qualifications, 4Z* for specific national qualifications"
            },
            {
                "CodeValue": "L",
                "CodeDescription": "Law",
                "CodeNotes": "Use all L* codes for: academic, professional or specialist titles only. DO NOT USE: code ‘L’ itself, but select specific categories from section L*. The L* section is not meant to reflect any particular legal system and many titles will need at least two codes to create the appropriate category. Use all L* codes with: PLACE 1* Qualifiers to indicate jurisdiction (especially with LN* codes), plus other qualifiers as appropriate, and use with EDUCATIONAL PURPOSE 4* qualifiers for vocational, professional or apprenticeship style education titles, 4TM for revision and study guides, 4CP for vocational or professional qualifications, 4Z* for specific national qualifications. Prefer: VS* codes for more general adult titles, See also: VS*"
            },
            {
                "CodeValue": "M",
                "CodeDescription": "Medicine and Nursing",
                "CodeNotes": "Also class here: the Health sciences, Healthcare. Use all M* codes for: academic, technical and specialist healthcare and medical material only. Use with: EDUCATIONAL PURPOSE 4* Qualifiers as appropriate. Prefer: V* codes for health topics aimed at a broad general adult audience, See also: V*"
            },
            {
                "CodeValue": "N",
                "CodeDescription": "History and Archaeology",
                "CodeNotes": "Use all N* codes for: specialist and general adult titles. DO NOT USE: code ‘N’ itself, but select specific categories from section N*. Use all N* codes with: other subject categories and qualifiers where appropriate, in particular PLACE 1* and TIME PERIOD 3* Qualifiers. A History work will usually need more than one subject category, from either History or non-History subjects to give greater detail, for example categories from Social Sciences (J*) with NHTB"
            },
            {
                "CodeValue": "P",
                "CodeDescription": "Mathematics and Science",
                "CodeNotes": "Use all P* codes for: mostly academic, technical and specialist titles and some general adult works. Qualifiers are mostly not required with P* codes. DO NOT USE: code ‘P’ itself, but select specific categories from section P*. Prefer: WN* codes for general interest adult titles where appropriate, See also: WN*"
            },
            {
                "CodeValue": "Q",
                "CodeDescription": "Philosophy",
                "CodeNotes": ""
            },
            {
                "CodeValue": "R",
                "CodeDescription": "Earth Sciences, Geography, Environment, Planning",
                "CodeNotes": "Use all R* codes for: academic, technical, specialist and general adult titles. DO NOT USE: code ‘R’ itself, but select specific categories from section R*. Use all R* codes with: other subject categories and qualifiers where appropriate, in particular PLACE 1* Qualifiers"
            },
            {
                "CodeValue": "S",
                "CodeDescription": "Sports and Active outdoor recreation",
                "CodeNotes": "Use all S* codes for: general adult and specialist titles. Use all S* codes with: other subject categories and qualifiers where appropriate, in particular PLACE 1* Qualifiers, for example with WT* for adventure holidays, or VFM for a sport as part of a fitness regime"
            },
            {
                "CodeValue": "T",
                "CodeDescription": "Technology, Engineering, Agriculture, Industrial processes",
                "CodeNotes": "Also class here: associated skills, trades and professions. Use all T* codes for: academic, technical, specialist and general adult titles. DO NOT USE: code ‘T’ itself, but select specific categories from section T*. Use all T* codes with: other subject categories and qualifiers where appropriate, in particular EDUCATIONAL PURPOSE 4* qualifiers for vocational, professional or apprenticeship style education titles, 4TM for revision and study guides, 4CP for vocational or professional qualifications, 4Z* for specific national qualifications"
            },
            {
                "CodeValue": "U",
                "CodeDescription": "Computing and Information Technology",
                "CodeNotes": "Use all U* codes for: academic, technical, specialist and some general adult titles. DO NOT USE: code ‘U’ itself, but select specific categories from section U*. Use all U* codes with: other subject categories and qualifiers where appropriate, in particular EDUCATIONAL PURPOSE 4* qualifiers for vocational educational titles, 4TM for revision and study guides, 4CP for vocational or professional qualifications, 4Z* for specific national qualifications"
            },
            {
                "CodeValue": "V",
                "CodeDescription": "Health, Relationships and Personal development",
                "CodeNotes": "Use all V* codes for: general adult titles. DO NOT USE: code ‘V’ itself, but select specific categories from section V*. Use all V* codes with: other subject categories and qualifiers where appropriate, in particular INTEREST 5* Qualifiers. Prefer: codes from C*, J*, K*, L*, M*, Q*, R* for specialist works. NB: if mixing V* codes with specialist codes to give greater detail, then a V* code should be designated as the Main Subject to indicate the content is for a broad general readership rather than specialist, professional or academic"
            },
            {
                "CodeValue": "W",
                "CodeDescription": "Lifestyle, Hobbies and Leisure",
                "CodeNotes": "Use all W* codes for: popular accounts for general adult readership, or practical how to and activity style content of general interest. DO NOT USE: code ‘W’ itself, but select specific categories from section W*. Use all W* codes with: other subject categories and qualifiers where appropriate. Prefer: codes from A*, K*, P*, R*, T*, etc, for specialist, technical and academic works"
            },
            {
                "CodeValue": "X",
                "CodeDescription": "Graphic novels, Comic books, Manga, Cartoons",
                "CodeNotes": "Use all X* codes for: general adult, teenage or children’s comic book titles in any form and from any style or tradition. DO NOT USE: code ‘X’ itself, but select specific categories from section X*. Use all X* codes with: other subject A* – W* OR Y* categories (but not both) and qualifiers where appropriate, in particular with PLACE 1*, TIME PERIOD 3* and INTEREST 5* Qualifiers. Use an XA* code to indicate the tradition, an XQ* to indicate genre plus other codes to give greater detail. NB: INTEREST AGE 5A* Qualifiers MUST be used with comic books, graphic novels or manga titles aimed at children or teenagers"
            },
            {
                "CodeValue": "Y",
                "CodeDescription": "Children’s, Teenage and Educational",
                "CodeNotes": "Use all Y* codes for: material aimed at, or purposefully written or created for a juvenile or adolescent audience (except for graphic novels, comic books, manga in X*). DO NOT USE: code ‘Y’ itself, but select specific categories from section Y*. Use all Y* codes with: only one INTEREST AGE 5A* Qualifier to indicate a guideline starting interest age (detailed age ranges should be included in other metadata) – or for YP* use EDUCATIONAL PURPOSE 4* qualifiers. All other qualifiers can be used as appropriate with Y* codes. DO NOT USE for: material intended primarily for adults that may also appeal to older teenagers. For ‘new adult’ content see note at 5LKE, for ‘Young Adult’ use the most appropriate 5A* Qualifier according to local usage of the term. NB: Y* codes should be used along with X* codes for graphic novels, comic books, manga. Y* codes may be used in combination with A*– W* codes but always prefer Y* codes and if mixing Y* codes with A*– W* codes, the Y* code must ALWAYS be designated as the Main Subject and sent with one 5A* qualifier. If sending A*– W* codes as Main Subject, then Y* codes should NOT be included except for JNU / JNUM with YP* or DSYC for reviews or critiques"
            }
        ]
    }
}