[
    {
        "author": "Philip K. Dick",
        "score": 29,
        "justification": "The text explores themes of consciousness, reality, and identity, reminiscent of Dick's focus on the nature of reality and the human mind. The narrative's psychological depth and the concept of simulated realities echo his signature style."
    },
    {
        "author": "Isaac Asimov",
        "score": 23,
        "justification": "Asimov's influence is evident in the scientific rigor and ethical dilemmas presented in the story, particularly regarding the implications of consciousness uploading and artificial intelligence. The structured approach to scientific exploration aligns with Asimov's narrative style."
    },
    {
        "author": "Arthur C. Clarke",
        "score": 18,
        "justification": "Clarke's work often blends advanced technology with philosophical questions, much like the text's exploration of consciousness and the implications of digital existence. The atmosphere of wonder and the unknown reflects Clarke's thematic concerns."
    },
    {
        "author": "Ursula K. Le Guin",
        "score": 14,
        "justification": "Le Guin's influence is seen in the text's exploration of identity and the human experience within a speculative framework. The character-driven narrative and focus on interpersonal relationships amidst a sci-fi backdrop resonate with her style."
    },
    {
        "author": "Ray Bradbury",
        "score": 9,
        "justification": "Bradbury's lyrical prose and emphasis on the emotional aspects of technology can be felt in the text's vivid descriptions and the protagonist's internal struggles. The blend of human experience with speculative elements reflects his influence."
    },
    {
        "author": "H. G. Wells",
        "score": 8,
        "justification": "Wells' pioneering ideas about time travel and alternate realities resonate in the text's exploration of simulated environments and the consequences of scientific experimentation. The narrative's adventurous spirit is reminiscent of Wells' storytelling."
    }
]